; ModuleID = 'game'
source_filename = "game"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.3 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].2" = type { ptr, i64 }
%Color = type { i8, i8, i8, i8 }
%any.11 = type { ptr, i64 }
%Rectangle = type { float, float, float, float }
%Vector2.7 = type { float, float }
%Block = type { %Vector2.7, i8 }
%Laser = type { %Vector2.7, float, i8 }
%Sound.8 = type { %AudioStream.9, i32 }
%AudioStream.9 = type { ptr, ptr, i32, i32, i32 }
%Texture.6 = type { i32, i32, i32, i32, i32 }
%Spaceship.5 = type { %Texture.6, %Vector2.7, %Sound.8, %List.10, double, i8 }
%List.10 = type { i64, i64, %any.11, ptr }
%"any[]" = type { ptr, i64 }
%Font.13 = type { i32, i32, i32, %Texture.6, ptr, ptr }
%Obstacle = type { %Vector2.7, %List.18 }
%List.18 = type { i64, i64, %any.11, ptr }
%Music.14 = type { %AudioStream.9, i32, i8, i32, ptr }
%MysteryShip.17 = type { %Texture.6, %Vector2.7, float, i8 }
%Game.12 = type { i32, %Font.13, %Sound.8, %Music.14, double, i32, i32, i32, i32, i32, double, double, double, i8, i8, %List.15, %List.16, %List.10, %Spaceship.5, %MysteryShip.17 }
%List.15 = type { i64, i64, %any.11, ptr }
%List.16 = type { i64, i64, %any.11, ptr }
%Alien = type { i8, %Vector2.7, %Texture.6, i8 }

@"$ct.game.Block" = linkonce global %.introspect.3 { i8 10, i64 0, ptr null, i64 12, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GRID", linkageName: "game.GRID", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 1)
!2 = !DIFile(filename: "obstacle.c3", directory: "/Users/flevin58/Projects/C3/invaders/src")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2392, align: 8, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!5 = !{!6, !7}
!6 = !DISubrange(count: 13, lowerBound: 0)
!7 = !DISubrange(count: 23, lowerBound: 0)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "GREY", linkageName: "game.GREY", scope: !10, file: !10, line: 5, type: !11, isLocal: false, isDefinition: true, align: 1)
!10 = !DIFile(filename: "constants.c3", directory: "/Users/flevin58/Projects/C3/invaders/src")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !12, file: !12, line: 79, size: 32, align: 8, elements: !13, identifier: "raylib.Color")
!12 = !DIFile(filename: "gui.c3", directory: "/Users/flevin58/Projects/C3/invaders/src")
!13 = !{!14, !15, !16, !17}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !11, file: !12, line: 81, baseType: !4, size: 8, align: 8)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !11, file: !12, line: 82, baseType: !4, size: 8, align: 8, offset: 8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !11, file: !12, line: 83, baseType: !4, size: 8, align: 8, offset: 16)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !11, file: !12, line: 84, baseType: !4, size: 8, align: 8, offset: 24)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "YELLOW", linkageName: "game.YELLOW", scope: !10, file: !10, line: 6, type: !11, isLocal: false, isDefinition: true, align: 1)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "GREEN", linkageName: "game.GREEN", scope: !10, file: !10, line: 7, type: !11, isLocal: false, isDefinition: true, align: 1)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "RED", linkageName: "game.RED", scope: !10, file: !10, line: 8, type: !11, isLocal: false, isDefinition: true, align: 1)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "BLOCK_WIDTH", linkageName: "game.BLOCK_WIDTH", scope: !10, file: !10, line: 11, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "BLOCK_HEIGHT", linkageName: "game.BLOCK_HEIGHT", scope: !10, file: !10, line: 12, type: !26, isLocal: false, isDefinition: true, align: 4)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "BLOCK_COLOR", linkageName: "game.BLOCK_COLOR", scope: !10, file: !10, line: 13, type: !11, isLocal: false, isDefinition: true, align: 1)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "LASER_WIDTH", linkageName: "game.LASER_WIDTH", scope: !10, file: !10, line: 16, type: !26, isLocal: false, isDefinition: true, align: 4)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "LASER_HEIGHT", linkageName: "game.LASER_HEIGHT", scope: !10, file: !10, line: 17, type: !26, isLocal: false, isDefinition: true, align: 4)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "LASER_COLOR", linkageName: "game.LASER_COLOR", scope: !10, file: !10, line: 18, type: !11, isLocal: false, isDefinition: true, align: 1)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "ALIEN_LASER_SHOOT_INTERVAL", linkageName: "game.ALIEN_LASER_SHOOT_INTERVAL", scope: !10, file: !10, line: 21, type: !39, isLocal: false, isDefinition: true, align: 8)
!39 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!40 = !{i32 2, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 2, !"wchar_size", i32 4}
!43 = !{i32 4, !"PIC Level", i32 2}
!44 = !{i32 1, !"uwtable", i32 1}
!45 = !{i32 2, !"frame-pointer", i32 1}
!46 = distinct !DICompileUnit(language: DW_LANG_C11, file: !47, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !48, globals: !255, splitDebugInlining: false)
!47 = !DIFile(filename: "block.c3", directory: "/Users/flevin58/Projects/C3/invaders/src")
!48 = !{!49, !82, !230}
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PixelFormat", scope: !51, file: !50, line: 544, baseType: !26, size: 32, align: 32, elements: !59)
!50 = !DIFile(filename: "spaceship.c3", directory: "/Users/flevin58/Projects/C3/invaders/src")
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture", scope: !50, file: !50, line: 107, size: 160, align: 32, elements: !52, identifier: "raylib.Texture")
!52 = !{!53, !55, !56, !57, !58}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !51, file: !50, line: 109, baseType: !54, size: 32, align: 32)
!54 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !51, file: !50, line: 110, baseType: !26, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !51, file: !50, line: 111, baseType: !26, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "mipmaps", scope: !51, file: !50, line: 112, baseType: !26, size: 32, align: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !51, file: !50, line: 113, baseType: !49, size: 32, align: 32, offset: 128)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!60 = !DIEnumerator(name: "NONE", value: 0)
!61 = !DIEnumerator(name: "UNCOMPRESSED_GRAYSCALE", value: 1)
!62 = !DIEnumerator(name: "UNCOMPRESSED_GRAY_ALPHA", value: 2)
!63 = !DIEnumerator(name: "UNCOMPRESSED_R5G6B5", value: 3)
!64 = !DIEnumerator(name: "UNCOMPRESSED_R8G8B8", value: 4)
!65 = !DIEnumerator(name: "UNCOMPRESSED_R5G5B5A1", value: 5)
!66 = !DIEnumerator(name: "UNCOMPRESSED_R4G4B4A4", value: 6)
!67 = !DIEnumerator(name: "UNCOMPRESSED_R8G8B8A8", value: 7)
!68 = !DIEnumerator(name: "UNCOMPRESSED_R32", value: 8)
!69 = !DIEnumerator(name: "UNCOMPRESSED_R32G32B32", value: 9)
!70 = !DIEnumerator(name: "UNCOMPRESSED_R32G32B32A32", value: 10)
!71 = !DIEnumerator(name: "COMPRESSED_DXT1_RGB", value: 11)
!72 = !DIEnumerator(name: "COMPRESSED_DXT1_RGBA", value: 12)
!73 = !DIEnumerator(name: "COMPRESSED_DXT3_RGBA", value: 13)
!74 = !DIEnumerator(name: "COMPRESSED_DXT5_RGBA", value: 14)
!75 = !DIEnumerator(name: "COMPRESSED_ETC1_RGB", value: 15)
!76 = !DIEnumerator(name: "COMPRESSED_ETC2_RGB", value: 16)
!77 = !DIEnumerator(name: "COMPRESSED_ETC2_EAC_RGBA", value: 17)
!78 = !DIEnumerator(name: "COMPRESSED_PVRT_RGB", value: 18)
!79 = !DIEnumerator(name: "COMPRESSED_PVRT_RGBA", value: 19)
!80 = !DIEnumerator(name: "COMPRESSED_ASTC_4X4_RGBA", value: 20)
!81 = !DIEnumerator(name: "COMPRESSED_ASTC_8X8_RGBA", value: 21)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GameState", scope: !83, file: !12, line: 5, baseType: !26, size: 32, align: 32, elements: !248)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Game", scope: !12, file: !12, line: 18, size: 4032, align: 64, elements: !84, identifier: "game.Game")
!84 = !{!85, !86, !120, !173, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !216, !238, !240, !241}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !83, file: !12, line: 19, baseType: !82, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !83, file: !12, line: 20, baseType: !87, size: 384, align: 64, offset: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", scope: !83, file: !12, line: 155, size: 384, align: 64, elements: !88, identifier: "raylib.Font")
!88 = !{!89, !90, !91, !92, !94, !103}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "base_size", scope: !87, file: !12, line: 157, baseType: !26, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "glyph_count", scope: !87, file: !12, line: 158, baseType: !26, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "glyph_padding", scope: !87, file: !12, line: 159, baseType: !26, size: 32, align: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !87, file: !12, line: 160, baseType: !93, size: 160, align: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Texture2D", scope: !50, file: !50, line: 117, baseType: !51, align: 4)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "recs", scope: !87, file: !12, line: 161, baseType: !95, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Rectangle*", baseType: !96, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rectangle", scope: !47, file: !47, line: 88, size: 128, align: 32, elements: !97, identifier: "raylib.Rectangle")
!97 = !{!98, !100, !101, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !96, file: !47, line: 90, baseType: !99, size: 32, align: 32)
!99 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !96, file: !47, line: 91, baseType: !99, size: 32, align: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !96, file: !47, line: 92, baseType: !99, size: 32, align: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !96, file: !47, line: 93, baseType: !99, size: 32, align: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !87, file: !12, line: 162, baseType: !104, size: 64, align: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "GlyphInfo*", baseType: !105, size: 64, align: 64, dwarfAddressSpace: 0)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlyphInfo", scope: !12, file: !12, line: 145, size: 320, align: 64, elements: !106, identifier: "raylib.GlyphInfo")
!106 = !{!107, !108, !109, !110, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !12, line: 147, baseType: !26, size: 32, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "offset_x", scope: !105, file: !12, line: 148, baseType: !26, size: 32, align: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "offset_y", scope: !105, file: !12, line: 149, baseType: !26, size: 32, align: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "advance_x", scope: !105, file: !12, line: 150, baseType: !26, size: 32, align: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !105, file: !12, line: 151, baseType: !112, size: 192, align: 64, offset: 128)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", scope: !105, file: !12, line: 97, size: 192, align: 64, elements: !113, identifier: "raylib.Image")
!113 = !{!114, !116, !117, !118, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !12, line: 99, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !112, file: !12, line: 100, baseType: !26, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !112, file: !12, line: 101, baseType: !26, size: 32, align: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mipmaps", scope: !112, file: !12, line: 102, baseType: !26, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !112, file: !12, line: 103, baseType: !49, size: 32, align: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "explosion_sound", scope: !83, file: !12, line: 21, baseType: !121, size: 320, align: 64, offset: 448)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sound", scope: !122, file: !50, line: 323, size: 320, align: 64, elements: !161, identifier: "raylib.Sound")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spaceship", scope: !50, file: !50, line: 6, size: 1024, align: 64, elements: !123, identifier: "game.Spaceship")
!123 = !{!124, !125, !135, !136, !159, !160}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !122, file: !50, line: 7, baseType: !93, size: 160, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !122, file: !50, line: 8, baseType: !126, size: 64, align: 32, offset: 160)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vector2", scope: !127, file: !47, line: 43, size: 64, align: 32, elements: !132, identifier: "raylib.Vector2")
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block", scope: !47, file: !47, line: 4, size: 96, align: 32, elements: !128, identifier: "game.Block")
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !127, file: !47, line: 5, baseType: !126, size: 64, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !127, file: !47, line: 6, baseType: !131, size: 8, align: 8, offset: 64)
!131 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !126, file: !47, line: 45, baseType: !99, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !126, file: !47, line: 46, baseType: !99, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "laser_sound", scope: !122, file: !50, line: 9, baseType: !121, size: 320, align: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lasers", scope: !122, file: !50, line: 10, baseType: !137, size: 320, align: 64, offset: 576)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !122, file: !50, line: 18, size: 320, align: 64, elements: !138, identifier: "std_collections_list$p$game.Laser$.List")
!138 = !{!139, !142, !143, !149}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !137, file: !50, line: 20, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !141)
!141 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !137, file: !50, line: 21, baseType: !140, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !137, file: !50, line: 22, baseType: !144, size: 128, align: 64, offset: 128)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !145, identifier: "Allocator")
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !144, baseType: !115, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !137, file: !50, line: 23, baseType: !150, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !151, size: 64, align: 64, dwarfAddressSpace: 0)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !50, file: !50, line: 10, baseType: !152, align: 8)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Laser*", baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Laser", scope: !154, file: !154, line: 4, size: 128, align: 32, elements: !155, identifier: "game.Laser")
!154 = !DIFile(filename: "laser.c3", directory: "/Users/flevin58/Projects/C3/invaders/src")
!155 = !{!156, !157, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !153, file: !154, line: 5, baseType: !126, size: 64, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !153, file: !154, line: 6, baseType: !99, size: 32, align: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !153, file: !154, line: 7, baseType: !131, size: 8, align: 8, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "last_fire_time", scope: !122, file: !50, line: 11, baseType: !39, size: 64, align: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mute", scope: !122, file: !50, line: 12, baseType: !131, size: 8, align: 8, offset: 960)
!161 = !{!162, !172}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !121, file: !50, line: 325, baseType: !163, size: 256, align: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "AudioStream", scope: !121, file: !50, line: 313, size: 256, align: 64, elements: !164, identifier: "raylib.AudioStream")
!164 = !{!165, !167, !169, !170, !171}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !163, file: !50, line: 315, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioBufferRef", scope: !50, file: !50, line: 309, baseType: !115, align: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !163, file: !50, line: 316, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AudioProcessorRef", scope: !50, file: !50, line: 310, baseType: !115, align: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !163, file: !50, line: 317, baseType: !54, size: 32, align: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !163, file: !50, line: 318, baseType: !54, size: 32, align: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !163, file: !50, line: 319, baseType: !54, size: 32, align: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count", scope: !121, file: !50, line: 326, baseType: !54, size: 32, align: 32, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "music", scope: !83, file: !12, line: 22, baseType: !174, size: 448, align: 64, offset: 768)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Music", scope: !83, file: !12, line: 330, size: 448, align: 64, elements: !175, identifier: "raylib.Music")
!175 = !{!176, !177, !178, !179, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !174, file: !12, line: 332, baseType: !163, size: 256, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count", scope: !174, file: !12, line: 333, baseType: !54, size: 32, align: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "looping", scope: !174, file: !12, line: 334, baseType: !131, size: 8, align: 8, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_type", scope: !174, file: !12, line: 336, baseType: !26, size: 32, align: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_data", scope: !174, file: !12, line: 337, baseType: !115, size: 64, align: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "alien_laser_shoot_interval", scope: !83, file: !12, line: 23, baseType: !39, size: 64, align: 64, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !83, file: !12, line: 24, baseType: !26, size: 32, align: 32, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !83, file: !12, line: 25, baseType: !26, size: 32, align: 32, offset: 1312)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "high_score", scope: !83, file: !12, line: 26, baseType: !26, size: 32, align: 32, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "lives", scope: !83, file: !12, line: 27, baseType: !26, size: 32, align: 32, offset: 1376)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "aliens_direction", scope: !83, file: !12, line: 28, baseType: !26, size: 32, align: 32, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spawn_interval", scope: !83, file: !12, line: 29, baseType: !39, size: 64, align: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ms_time_last_spawned", scope: !83, file: !12, line: 30, baseType: !39, size: 64, align: 64, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "time_last_alien_fired", scope: !83, file: !12, line: 31, baseType: !39, size: 64, align: 64, offset: 1600)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mute_music", scope: !83, file: !12, line: 32, baseType: !131, size: 8, align: 8, offset: 1664)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mute_sfx", scope: !83, file: !12, line: 33, baseType: !131, size: 8, align: 8, offset: 1672)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "obstacles", scope: !83, file: !12, line: 34, baseType: !193, size: 320, align: 64, offset: 1728)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObstacleList", scope: !12, file: !12, line: 14, baseType: !194, align: 8)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !12, file: !12, line: 18, size: 320, align: 64, elements: !195, identifier: "std_collections_list$p$game.Obstacle$.List")
!195 = !{!196, !197, !198, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !194, file: !12, line: 20, baseType: !140, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !194, file: !12, line: 21, baseType: !140, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !194, file: !12, line: 22, baseType: !144, size: 128, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !194, file: !12, line: 23, baseType: !200, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !12, file: !12, line: 14, baseType: !202, align: 8)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Obstacle*", baseType: !203, size: 64, align: 64, dwarfAddressSpace: 0)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Obstacle", scope: !12, file: !12, line: 22, size: 384, align: 64, elements: !204, identifier: "game.Obstacle")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !203, file: !12, line: 23, baseType: !126, size: 64, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !203, file: !12, line: 24, baseType: !207, size: 320, align: 64, offset: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !203, file: !12, line: 18, size: 320, align: 64, elements: !208, identifier: "std_collections_list$p$game.Block$.List")
!208 = !{!209, !210, !211, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !207, file: !12, line: 20, baseType: !140, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !207, file: !12, line: 21, baseType: !140, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !207, file: !12, line: 22, baseType: !144, size: 128, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !207, file: !12, line: 23, baseType: !213, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !214, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !12, file: !12, line: 24, baseType: !215, align: 8)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Block*", baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "aliens", scope: !83, file: !12, line: 35, baseType: !217, size: 320, align: 64, offset: 2048)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlienList", scope: !12, file: !12, line: 15, baseType: !218, align: 8)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !12, file: !12, line: 18, size: 320, align: 64, elements: !219, identifier: "std_collections_list$p$game.Alien$.List")
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !218, file: !12, line: 20, baseType: !140, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !218, file: !12, line: 21, baseType: !140, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !218, file: !12, line: 22, baseType: !144, size: 128, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !218, file: !12, line: 23, baseType: !224, size: 64, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !225, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !12, file: !12, line: 15, baseType: !226, align: 8)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Alien*", baseType: !227, size: 64, align: 64, dwarfAddressSpace: 0)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Alien", scope: !12, file: !12, line: 10, size: 288, align: 32, elements: !228, identifier: "game.Alien")
!228 = !{!229, !235, !236, !237}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !12, line: 11, baseType: !230, size: 8, align: 8)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlienType", scope: !227, file: !12, line: 4, baseType: !4, size: 8, align: 8, elements: !231)
!231 = !{!232, !233, !234}
!232 = !DIEnumerator(name: "KURA", value: 0, isUnsigned: true)
!233 = !DIEnumerator(name: "KANI", value: 1, isUnsigned: true)
!234 = !DIEnumerator(name: "IKA", value: 2, isUnsigned: true)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !227, file: !12, line: 12, baseType: !126, size: 64, align: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !227, file: !12, line: 13, baseType: !93, size: 160, align: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !227, file: !12, line: 14, baseType: !131, size: 8, align: 8, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "alien_lasers", scope: !83, file: !12, line: 36, baseType: !239, size: 320, align: 64, offset: 2368)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "LaserList", scope: !12, file: !12, line: 16, baseType: !137, align: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "spaceship", scope: !83, file: !12, line: 37, baseType: !122, size: 1024, align: 64, offset: 2688)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mysteryship", scope: !83, file: !12, line: 38, baseType: !242, size: 288, align: 32, offset: 3712)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "MysteryShip", scope: !83, file: !12, line: 5, size: 288, align: 32, elements: !243, identifier: "game.MysteryShip")
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !242, file: !12, line: 6, baseType: !93, size: 160, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !242, file: !12, line: 7, baseType: !126, size: 64, align: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !242, file: !12, line: 8, baseType: !99, size: 32, align: 32, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !242, file: !12, line: 9, baseType: !131, size: 8, align: 8, offset: 256)
!248 = !{!249, !250, !251, !252, !253, !254}
!249 = !DIEnumerator(name: "IDLE", value: 0)
!250 = !DIEnumerator(name: "RUNNING", value: 1)
!251 = !DIEnumerator(name: "GAME_OVER", value: 2)
!252 = !DIEnumerator(name: "LEVEL_UP", value: 3)
!253 = !DIEnumerator(name: "PAUSED", value: 4)
!254 = !DIEnumerator(name: "QUIT", value: 5)
!255 = !{!0, !8, !18, !20, !22, !24, !27, !29, !31, !33, !35, !37}
!256 = distinct !DISubprogram(name: "free", linkageName: "game.Block.free", scope: !47, file: !47, line: 18, type: !257, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !215}
!259 = !{}
!260 = !DILocalVariable(name: "self", arg: 1, scope: !256, file: !47, line: 18, type: !215)
!261 = !DILocation(line: 18, column: 20, scope: !256)
!262 = !DILocation(line: 19, column: 5, scope: !256)
!263 = distinct !DISubprogram(name: "draw", linkageName: "game.Block.draw", scope: !47, file: !47, line: 22, type: !257, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!264 = !DILocalVariable(name: "self", arg: 1, scope: !263, file: !47, line: 22, type: !215)
!265 = !DILocation(line: 22, column: 20, scope: !263)
!266 = !DILocation(line: 23, column: 29, scope: !263)
!267 = !DILocation(line: 23, column: 2, scope: !263)
!268 = distinct !DISubprogram(name: "get_rect", linkageName: "game.Block.get_rect", scope: !47, file: !47, line: 26, type: !269, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!269 = !DISubroutineType(types: !270)
!270 = !{!96, !215}
!271 = !DILocalVariable(name: "self", arg: 1, scope: !268, file: !47, line: 26, type: !215)
!272 = !DILocation(line: 26, column: 37, scope: !268)
!273 = !DILocation(line: 28, column: 8, scope: !268)
!274 = !DILocation(line: 29, column: 8, scope: !268)
!275 = !DILocation(line: 30, column: 13, scope: !268)
!276 = !DILocation(line: 31, column: 13, scope: !268)
!277 = distinct !DISubprogram(name: "disable", linkageName: "game.Block.disable", scope: !47, file: !47, line: 35, type: !257, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!278 = !DILocalVariable(name: "self", arg: 1, scope: !277, file: !47, line: 35, type: !215)
!279 = !DILocation(line: 35, column: 23, scope: !277)
!280 = !DILocation(line: 36, column: 5, scope: !277)
!281 = distinct !DISubprogram(name: "is_disabled", linkageName: "game.Block.is_disabled", scope: !47, file: !47, line: 39, type: !282, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!282 = !DISubroutineType(types: !283)
!283 = !{!131, !215}
!284 = !DILocalVariable(name: "self", arg: 1, scope: !281, file: !47, line: 39, type: !215)
!285 = !DILocation(line: 39, column: 27, scope: !281)
!286 = !DILocation(line: 40, column: 13, scope: !281)
!287 = distinct !DISubprogram(name: "new_block", linkageName: "game.new_block", scope: !47, file: !47, line: 9, type: !288, scopeLine: 9, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !290)
!288 = !DISubroutineType(types: !289)
!289 = !{!215, !99, !99}
!290 = !{!291}
!291 = !DILocalVariable(name: "block", scope: !287, file: !47, line: 10, type: !215, align: 8)
!292 = !DILocalVariable(name: "posx", arg: 1, scope: !287, file: !47, line: 9, type: !99)
!293 = !DILocation(line: 9, column: 27, scope: !287)
!294 = !DILocalVariable(name: "posy", arg: 2, scope: !287, file: !47, line: 9, type: !99)
!295 = !DILocation(line: 9, column: 39, scope: !287)
!296 = !DILocation(line: 10, column: 12, scope: !287)
!297 = !DILocation(line: 10, column: 20, scope: !287)
!298 = !DILocation(line: 12, column: 22, scope: !287)
!299 = !DILocation(line: 12, column: 28, scope: !287)
!300 = !DILocation(line: 13, column: 20, scope: !287)
!301 = !DILocation(line: 11, column: 6, scope: !287)
!302 = !DILocation(line: 15, column: 12, scope: !287)
!303 = distinct !DISubprogram(name: "free", linkageName: "game.Laser.free", scope: !154, file: !154, line: 20, type: !304, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !152}
!306 = !DILocalVariable(name: "self", arg: 1, scope: !303, file: !154, line: 20, type: !152)
!307 = !DILocation(line: 20, column: 20, scope: !303)
!308 = !DILocation(line: 21, column: 5, scope: !303)
!309 = distinct !DISubprogram(name: "collided_with", linkageName: "game.Laser.collided_with", scope: !154, file: !154, line: 24, type: !310, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!310 = !DISubroutineType(types: !311)
!311 = !{!131, !152, !312}
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Collideable", size: 128, align: 64, elements: !313, identifier: "Collideable")
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !312, baseType: !115, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, baseType: !148, size: 64, align: 64, offset: 64)
!316 = !DILocalVariable(name: "self", arg: 1, scope: !309, file: !154, line: 24, type: !152)
!317 = !DILocation(line: 24, column: 29, scope: !309)
!318 = !DILocalVariable(name: "other", arg: 2, scope: !309, file: !154, line: 24, type: !312)
!319 = !DILocation(line: 24, column: 48, scope: !309)
!320 = !DILocation(line: 25, column: 39, scope: !309)
!321 = !DILocation(line: 25, column: 56, scope: !309)
!322 = !DILocation(line: 25, column: 10, scope: !309)
!323 = distinct !DISubprogram(name: "update", linkageName: "game.Laser.update", scope: !154, file: !154, line: 28, type: !304, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !324)
!324 = !{!325}
!325 = !DILocalVariable(name: "screen_height", scope: !326, file: !154, line: 31, type: !99, align: 4)
!326 = distinct !DILexicalBlock(scope: !323, file: !154, line: 29, column: 21)
!327 = !DILocalVariable(name: "self", arg: 1, scope: !323, file: !154, line: 28, type: !152)
!328 = !DILocation(line: 28, column: 22, scope: !323)
!329 = !DILocation(line: 29, column: 7, scope: !323)
!330 = !DILocation(line: 30, column: 5, scope: !326)
!331 = !DILocation(line: 30, column: 24, scope: !326)
!332 = !DILocation(line: 31, column: 11, scope: !326)
!333 = !DILocation(line: 31, column: 27, scope: !326)
!334 = !DILocation(line: 32, column: 9, scope: !326)
!335 = !DILocation(line: 32, column: 27, scope: !326)
!336 = !DILocation(line: 32, column: 51, scope: !326)
!337 = !DILocation(line: 33, column: 7, scope: !338)
!338 = distinct !DILexicalBlock(scope: !326, file: !154, line: 32, column: 74)
!339 = distinct !DISubprogram(name: "draw", linkageName: "game.Laser.draw", scope: !154, file: !154, line: 38, type: !304, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!340 = !DILocalVariable(name: "self", arg: 1, scope: !339, file: !154, line: 38, type: !152)
!341 = !DILocation(line: 38, column: 20, scope: !339)
!342 = !DILocation(line: 39, column: 7, scope: !339)
!343 = !DILocation(line: 40, column: 32, scope: !344)
!344 = distinct !DILexicalBlock(scope: !339, file: !154, line: 39, column: 21)
!345 = !DILocation(line: 40, column: 5, scope: !344)
!346 = distinct !DISubprogram(name: "get_rect", linkageName: "game.Laser.get_rect", scope: !154, file: !154, line: 44, type: !347, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!347 = !DISubroutineType(types: !348)
!348 = !{!96, !152}
!349 = !DILocalVariable(name: "self", arg: 1, scope: !346, file: !154, line: 44, type: !152)
!350 = !DILocation(line: 44, column: 37, scope: !346)
!351 = !DILocation(line: 46, column: 12, scope: !346)
!352 = !DILocation(line: 47, column: 12, scope: !346)
!353 = !DILocation(line: 48, column: 16, scope: !346)
!354 = !DILocation(line: 49, column: 17, scope: !346)
!355 = distinct !DISubprogram(name: "disable", linkageName: "game.Laser.disable", scope: !154, file: !154, line: 53, type: !304, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!356 = !DILocalVariable(name: "self", arg: 1, scope: !355, file: !154, line: 53, type: !152)
!357 = !DILocation(line: 53, column: 23, scope: !355)
!358 = !DILocation(line: 53, column: 41, scope: !355)
!359 = distinct !DISubprogram(name: "is_disabled", linkageName: "game.Laser.is_disabled", scope: !154, file: !154, line: 55, type: !360, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!360 = !DISubroutineType(types: !361)
!361 = !{!131, !152}
!362 = !DILocalVariable(name: "self", arg: 1, scope: !359, file: !154, line: 55, type: !152)
!363 = !DILocation(line: 55, column: 27, scope: !359)
!364 = !DILocation(line: 55, column: 53, scope: !359)
!365 = distinct !DISubprogram(name: "new_laser", linkageName: "game.new_laser", scope: !154, file: !154, line: 10, type: !366, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !368)
!366 = !DISubroutineType(types: !367)
!367 = !{!152, !126, !99}
!368 = !{!369}
!369 = !DILocalVariable(name: "laser", scope: !365, file: !154, line: 11, type: !152, align: 8)
!370 = !DILocalVariable(name: "position", arg: 1, scope: !365, file: !154, line: 10, type: !126)
!371 = !DILocation(line: 10, column: 29, scope: !365)
!372 = !DILocalVariable(name: "speed", arg: 2, scope: !365, file: !154, line: 10, type: !99)
!373 = !DILocation(line: 10, column: 45, scope: !365)
!374 = !DILocation(line: 11, column: 12, scope: !365)
!375 = !DILocation(line: 11, column: 20, scope: !365)
!376 = !DILocation(line: 13, column: 21, scope: !365)
!377 = !DILocation(line: 14, column: 18, scope: !365)
!378 = !DILocation(line: 15, column: 20, scope: !365)
!379 = !DILocation(line: 12, column: 6, scope: !365)
!380 = !DILocation(line: 17, column: 12, scope: !365)
!381 = distinct !DISubprogram(name: "free", linkageName: "game.Spaceship.free", scope: !50, file: !50, line: 29, type: !382, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !385)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Spaceship*", baseType: !122, size: 64, align: 64, dwarfAddressSpace: 0)
!385 = !{!386, !388}
!386 = !DILocalVariable(name: ".temp", scope: !387, file: !50, line: 30, type: !140, align: 8)
!387 = distinct !DILexicalBlock(scope: !381, file: !50, line: 30, column: 5)
!388 = !DILocalVariable(name: "laser", scope: !389, file: !50, line: 30, type: !151, align: 8)
!389 = distinct !DILexicalBlock(scope: !387, file: !50, line: 30, column: 36)
!390 = !DILocalVariable(name: "self", arg: 1, scope: !381, file: !50, line: 29, type: !384)
!391 = !DILocation(line: 29, column: 24, scope: !381)
!392 = !DILocation(line: 30, column: 23, scope: !387)
!393 = !DILocation(line: 30, column: 15, scope: !389)
!394 = !DILocation(line: 393, column: 26, scope: !395, inlinedAt: !393)
!395 = distinct !DILexicalBlock(scope: !397, file: !396, line: 394, column: 1)
!396 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/collections")
!397 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !396, file: !396, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46)
!398 = !DILocation(line: 391, column: 11, scope: !395, inlinedAt: !393)
!399 = !DILocation(line: 391, column: 19, scope: !395, inlinedAt: !393)
!400 = !DILocation(line: 30, column: 15, scope: !395, inlinedAt: !393)
!401 = !DILocation(line: 395, column: 9, scope: !397, inlinedAt: !393)
!402 = !DILocation(line: 395, column: 22, scope: !397, inlinedAt: !393)
!403 = !DILocation(line: 31, column: 9, scope: !404)
!404 = distinct !DILexicalBlock(scope: !389, file: !50, line: 30, column: 36)
!405 = !DILocation(line: 33, column: 2, scope: !381)
!406 = !DILocation(line: 34, column: 5, scope: !381)
!407 = !DILocation(line: 35, column: 26, scope: !381)
!408 = !DILocation(line: 35, column: 5, scope: !381)
!409 = !DILocation(line: 36, column: 5, scope: !381)
!410 = distinct !DISubprogram(name: "get_rect", linkageName: "game.Spaceship.get_rect", scope: !50, file: !50, line: 39, type: !411, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!411 = !DISubroutineType(types: !412)
!412 = !{!96, !384}
!413 = !DILocalVariable(name: "self", arg: 1, scope: !410, file: !50, line: 39, type: !384)
!414 = !DILocation(line: 39, column: 41, scope: !410)
!415 = !DILocation(line: 41, column: 8, scope: !410)
!416 = !DILocation(line: 42, column: 8, scope: !410)
!417 = !DILocation(line: 43, column: 20, scope: !410)
!418 = !DILocation(line: 44, column: 21, scope: !410)
!419 = distinct !DISubprogram(name: "reset", linkageName: "game.Spaceship.reset", scope: !50, file: !50, line: 48, type: !382, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!420 = !DILocalVariable(name: "self", arg: 1, scope: !419, file: !50, line: 48, type: !384)
!421 = !DILocation(line: 48, column: 25, scope: !419)
!422 = !DILocation(line: 49, column: 29, scope: !419)
!423 = !DILocation(line: 49, column: 58, scope: !419)
!424 = !DILocation(line: 49, column: 20, scope: !419)
!425 = !DILocation(line: 49, column: 2, scope: !419)
!426 = !DILocation(line: 50, column: 29, scope: !419)
!427 = !DILocation(line: 50, column: 59, scope: !419)
!428 = !DILocation(line: 50, column: 20, scope: !419)
!429 = !DILocation(line: 50, column: 2, scope: !419)
!430 = !DILocation(line: 51, column: 2, scope: !419)
!431 = distinct !DISubprogram(name: "clear_lasers", linkageName: "game.Spaceship.clear_lasers", scope: !50, file: !50, line: 55, type: !382, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !432)
!432 = !{!433, !435}
!433 = !DILocalVariable(name: ".temp", scope: !434, file: !50, line: 56, type: !140, align: 8)
!434 = distinct !DILexicalBlock(scope: !431, file: !50, line: 56, column: 2)
!435 = !DILocalVariable(name: "laser", scope: !436, file: !50, line: 56, type: !151, align: 8)
!436 = distinct !DILexicalBlock(scope: !434, file: !50, line: 56, column: 31)
!437 = !DILocalVariable(name: "self", arg: 1, scope: !431, file: !50, line: 55, type: !384)
!438 = !DILocation(line: 55, column: 32, scope: !431)
!439 = !DILocation(line: 56, column: 18, scope: !434)
!440 = !DILocation(line: 56, column: 10, scope: !436)
!441 = !DILocation(line: 393, column: 26, scope: !442, inlinedAt: !440)
!442 = distinct !DILexicalBlock(scope: !443, file: !396, line: 394, column: 1)
!443 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !396, file: !396, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46)
!444 = !DILocation(line: 391, column: 11, scope: !442, inlinedAt: !440)
!445 = !DILocation(line: 391, column: 19, scope: !442, inlinedAt: !440)
!446 = !DILocation(line: 56, column: 10, scope: !442, inlinedAt: !440)
!447 = !DILocation(line: 395, column: 9, scope: !443, inlinedAt: !440)
!448 = !DILocation(line: 395, column: 22, scope: !443, inlinedAt: !440)
!449 = !DILocation(line: 57, column: 3, scope: !450)
!450 = distinct !DILexicalBlock(scope: !436, file: !50, line: 56, column: 31)
!451 = !DILocation(line: 59, column: 2, scope: !431)
!452 = distinct !DISubprogram(name: "fire_laser", linkageName: "game.Spaceship.fire_laser", scope: !50, file: !50, line: 62, type: !382, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !453)
!453 = !{!454}
!454 = !DILocalVariable(name: "pos", scope: !455, file: !50, line: 67, type: !126, align: 4)
!455 = distinct !DILexicalBlock(scope: !452, file: !50, line: 63, column: 56)
!456 = !DILocalVariable(name: "self", arg: 1, scope: !452, file: !50, line: 62, type: !384)
!457 = !DILocation(line: 62, column: 30, scope: !452)
!458 = !DILocation(line: 63, column: 6, scope: !452)
!459 = !DILocation(line: 63, column: 27, scope: !452)
!460 = !DILocation(line: 64, column: 8, scope: !455)
!461 = !DILocation(line: 65, column: 23, scope: !462)
!462 = distinct !DILexicalBlock(scope: !455, file: !50, line: 64, column: 19)
!463 = !DILocation(line: 65, column: 4, scope: !462)
!464 = !DILocation(line: 67, column: 17, scope: !455)
!465 = !DILocation(line: 68, column: 18, scope: !455)
!466 = !DILocation(line: 68, column: 44, scope: !455)
!467 = !DILocation(line: 68, column: 36, scope: !455)
!468 = !DILocation(line: 69, column: 18, scope: !455)
!469 = !DILocation(line: 71, column: 3, scope: !455)
!470 = !DILocation(line: 71, column: 35, scope: !455)
!471 = !DILocation(line: 71, column: 20, scope: !455)
!472 = !DILocation(line: 72, column: 25, scope: !455)
!473 = !DILocation(line: 72, column: 3, scope: !455)
!474 = distinct !DISubprogram(name: "update", linkageName: "game.Spaceship.update", scope: !50, file: !50, line: 76, type: !382, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !475)
!475 = !{!476, !478}
!476 = !DILocalVariable(name: ".temp", scope: !477, file: !50, line: 81, type: !140, align: 8)
!477 = distinct !DILexicalBlock(scope: !474, file: !50, line: 81, column: 2)
!478 = !DILocalVariable(name: "laser", scope: !479, file: !50, line: 81, type: !151, align: 8)
!479 = distinct !DILexicalBlock(scope: !477, file: !50, line: 81, column: 33)
!480 = !DILocalVariable(name: "self", arg: 1, scope: !474, file: !50, line: 76, type: !384)
!481 = !DILocation(line: 76, column: 26, scope: !474)
!482 = !DILocation(line: 78, column: 5, scope: !474)
!483 = !DILocation(line: 81, column: 20, scope: !477)
!484 = !DILocation(line: 81, column: 12, scope: !479)
!485 = !DILocation(line: 393, column: 26, scope: !486, inlinedAt: !484)
!486 = distinct !DILexicalBlock(scope: !487, file: !396, line: 394, column: 1)
!487 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !396, file: !396, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46)
!488 = !DILocation(line: 391, column: 11, scope: !486, inlinedAt: !484)
!489 = !DILocation(line: 391, column: 19, scope: !486, inlinedAt: !484)
!490 = !DILocation(line: 81, column: 12, scope: !486, inlinedAt: !484)
!491 = !DILocation(line: 395, column: 9, scope: !487, inlinedAt: !484)
!492 = !DILocation(line: 395, column: 22, scope: !487, inlinedAt: !484)
!493 = !DILocation(line: 82, column: 3, scope: !494)
!494 = distinct !DILexicalBlock(scope: !479, file: !50, line: 81, column: 33)
!495 = distinct !DISubprogram(name: "draw", linkageName: "game.Spaceship.draw", scope: !50, file: !50, line: 86, type: !496, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !122}
!498 = !{!499, !501}
!499 = !DILocalVariable(name: ".temp", scope: !500, file: !50, line: 88, type: !140, align: 8)
!500 = distinct !DILexicalBlock(scope: !495, file: !50, line: 88, column: 2)
!501 = !DILocalVariable(name: "laser", scope: !502, file: !50, line: 88, type: !151, align: 8)
!502 = distinct !DILexicalBlock(scope: !500, file: !50, line: 88, column: 33)
!503 = !DILocalVariable(name: "self", arg: 1, scope: !495, file: !50, line: 86, type: !122)
!504 = !DILocation(line: 86, column: 24, scope: !495)
!505 = !DILocation(line: 87, column: 39, scope: !495)
!506 = !DILocation(line: 87, column: 2, scope: !495)
!507 = !DILocation(line: 88, column: 20, scope: !500)
!508 = !DILocation(line: 88, column: 12, scope: !502)
!509 = !DILocation(line: 393, column: 26, scope: !510, inlinedAt: !508)
!510 = distinct !DILexicalBlock(scope: !511, file: !396, line: 394, column: 1)
!511 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !396, file: !396, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46)
!512 = !DILocation(line: 391, column: 11, scope: !510, inlinedAt: !508)
!513 = !DILocation(line: 391, column: 19, scope: !510, inlinedAt: !508)
!514 = !DILocation(line: 88, column: 12, scope: !510, inlinedAt: !508)
!515 = !DILocation(line: 395, column: 9, scope: !511, inlinedAt: !508)
!516 = !DILocation(line: 395, column: 22, scope: !511, inlinedAt: !508)
!517 = !DILocation(line: 89, column: 3, scope: !518)
!518 = distinct !DILexicalBlock(scope: !502, file: !50, line: 88, column: 33)
!519 = distinct !DISubprogram(name: "draw_at", linkageName: "game.Spaceship.draw_at", scope: !50, file: !50, line: 93, type: !520, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !122, !26, !26}
!522 = !{!523}
!523 = !DILocalVariable(name: "position", scope: !519, file: !50, line: 94, type: !126, align: 4)
!524 = !DILocalVariable(name: "self", arg: 1, scope: !519, file: !50, line: 93, type: !122)
!525 = !DILocation(line: 93, column: 27, scope: !519)
!526 = !DILocalVariable(name: "xpos", arg: 2, scope: !519, file: !50, line: 93, type: !26)
!527 = !DILocation(line: 93, column: 37, scope: !519)
!528 = !DILocalVariable(name: "ypos", arg: 3, scope: !519, file: !50, line: 93, type: !26)
!529 = !DILocation(line: 93, column: 47, scope: !519)
!530 = !DILocation(line: 94, column: 10, scope: !519)
!531 = !DILocation(line: 94, column: 23, scope: !519)
!532 = !DILocation(line: 94, column: 37, scope: !519)
!533 = !DILocation(line: 95, column: 2, scope: !519)
!534 = distinct !DISubprogram(name: "move_left", linkageName: "game.Spaceship.move_left", scope: !50, file: !50, line: 98, type: !382, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!535 = !DILocalVariable(name: "self", arg: 1, scope: !534, file: !50, line: 98, type: !384)
!536 = !DILocation(line: 98, column: 29, scope: !534)
!537 = !DILocation(line: 99, column: 38, scope: !534)
!538 = !DILocation(line: 381, column: 19, scope: !539, inlinedAt: !541)
!539 = distinct !DISubprogram(name: "max", linkageName: "max", scope: !540, file: !540, line: 378, scopeLine: 378, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46)
!540 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/math")
!541 = !DILocation(line: 99, column: 23, scope: !534)
!542 = !DILocation(line: 99, column: 5, scope: !534)
!543 = distinct !DISubprogram(name: "move_right", linkageName: "game.Spaceship.move_right", scope: !50, file: !50, line: 102, type: !382, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!544 = !DILocalVariable(name: "self", arg: 1, scope: !543, file: !50, line: 102, type: !384)
!545 = !DILocation(line: 102, column: 30, scope: !543)
!546 = !DILocation(line: 103, column: 41, scope: !543)
!547 = !DILocation(line: 103, column: 70, scope: !543)
!548 = !DILocation(line: 103, column: 33, scope: !543)
!549 = !DILocation(line: 103, column: 97, scope: !543)
!550 = !DILocation(line: 398, column: 19, scope: !551, inlinedAt: !552)
!551 = distinct !DISubprogram(name: "min", linkageName: "min", scope: !540, file: !540, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46)
!552 = !DILocation(line: 103, column: 23, scope: !543)
!553 = !DILocation(line: 103, column: 5, scope: !543)
!554 = distinct !DISubprogram(name: "new_spaceship", linkageName: "game.new_spaceship", scope: !50, file: !50, line: 15, type: !555, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!122}
!557 = !{!558, !559, !560}
!558 = !DILocalVariable(name: "texture", scope: !554, file: !50, line: 16, type: !93, align: 4)
!559 = !DILocalVariable(name: "xpos", scope: !554, file: !50, line: 17, type: !99, align: 4)
!560 = !DILocalVariable(name: "ypos", scope: !554, file: !50, line: 18, type: !99, align: 4)
!561 = !DILocation(line: 16, column: 15, scope: !554)
!562 = !DILocation(line: 16, column: 25, scope: !554)
!563 = !DILocation(line: 17, column: 8, scope: !554)
!564 = !DILocation(line: 17, column: 24, scope: !554)
!565 = !DILocation(line: 17, column: 53, scope: !554)
!566 = !DILocation(line: 17, column: 15, scope: !554)
!567 = !DILocation(line: 18, column: 8, scope: !554)
!568 = !DILocation(line: 18, column: 24, scope: !554)
!569 = !DILocation(line: 18, column: 54, scope: !554)
!570 = !DILocation(line: 18, column: 15, scope: !554)
!571 = !DILocation(line: 20, column: 14, scope: !554)
!572 = !DILocation(line: 21, column: 17, scope: !554)
!573 = !DILocation(line: 21, column: 23, scope: !554)
!574 = !DILocation(line: 23, column: 21, scope: !554)
!575 = !DILocation(line: 24, column: 18, scope: !554)
!576 = !DILocation(line: 25, column: 11, scope: !554)
!577 = distinct !DISubprogram(name: "game.update$lambda1", linkageName: "game.update$lambda1", scope: !50, file: !50, line: 78, type: !578, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !259)
!578 = !DISubroutineType(types: !579)
!579 = !{!131, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Laser**", baseType: !152, size: 64, align: 64, dwarfAddressSpace: 0)
!581 = !DILocalVariable(name: "l", arg: 1, scope: !577, file: !50, line: 78, type: !580)
!582 = !DILocation(line: 78, column: 44, scope: !577)
!583 = !DILocation(line: 78, column: 52, scope: !577)
!584 = !DILocation(line: 78, column: 50, scope: !577)
!585 = distinct !DISubprogram(name: "text_at", linkageName: "game.Game.text_at", scope: !12, file: !12, line: 4, type: !586, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !604)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !588, !99, !99, !589, !595}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Game*", baseType: !83, size: 64, align: 64, dwarfAddressSpace: 0)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !590)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !591, identifier: "char[]")
!591 = !{!592, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !590, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !590, baseType: !140, size: 64, align: 64, offset: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !596, identifier: "any[]")
!596 = !{!597, !603}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !595, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !599, size: 64, align: 64, dwarfAddressSpace: 0)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !600, identifier: "any")
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !599, baseType: !115, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, baseType: !148, size: 64, align: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !595, baseType: !140, size: 64, align: 64, offset: 64)
!604 = !{!605}
!605 = !DILocalVariable(name: "dtext", scope: !585, file: !12, line: 5, type: !606, align: 8)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !12, file: !12, line: 7, baseType: !607, align: 8)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !608, size: 64, align: 64, dwarfAddressSpace: 0)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !12, file: !12, line: 8, baseType: null, align: 1)
!609 = !DILocalVariable(name: "self", arg: 1, scope: !585, file: !12, line: 4, type: !588)
!610 = !DILocation(line: 4, column: 22, scope: !585)
!611 = !DILocalVariable(name: "posx", arg: 2, scope: !585, file: !12, line: 4, type: !99)
!612 = !DILocation(line: 4, column: 35, scope: !585)
!613 = !DILocalVariable(name: "posy", arg: 3, scope: !585, file: !12, line: 4, type: !99)
!614 = !DILocation(line: 4, column: 47, scope: !585)
!615 = !DILocalVariable(name: "fmt", arg: 4, scope: !585, file: !12, line: 4, type: !589)
!616 = !DILocation(line: 4, column: 60, scope: !585)
!617 = !DILocalVariable(name: "args", arg: 5, scope: !585, file: !12, line: 4, type: !595)
!618 = !DILocation(line: 4, column: 65, scope: !585)
!619 = !DILocation(line: 5, column: 13, scope: !585)
!620 = !DILocation(line: 6, column: 9, scope: !585)
!621 = !DILocation(line: 7, column: 9, scope: !622)
!622 = distinct !DILexicalBlock(scope: !585, file: !12, line: 6, column: 23)
!623 = !DILocation(line: 395, column: 27, scope: !624, inlinedAt: !627)
!624 = distinct !DILexicalBlock(scope: !626, file: !625, line: 396, column: 1)
!625 = !DIFile(filename: "dstring.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!626 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !625, file: !625, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46)
!627 = !DILocation(line: 9, column: 9, scope: !628)
!628 = distinct !DILexicalBlock(scope: !585, file: !12, line: 8, column: 12)
!629 = !DILocation(line: 405, column: 22, scope: !626, inlinedAt: !627)
!630 = !DILocation(line: 405, column: 4, scope: !626, inlinedAt: !627)
!631 = !DILocation(line: 395, column: 27, scope: !632, inlinedAt: !634)
!632 = distinct !DILexicalBlock(scope: !633, file: !625, line: 396, column: 1)
!633 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !625, file: !625, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46)
!634 = !DILocation(line: 11, column: 5, scope: !585)
!635 = !DILocation(line: 405, column: 4, scope: !633, inlinedAt: !634)
!636 = !DILocation(line: 12, column: 26, scope: !585)
!637 = !DILocation(line: 12, column: 37, scope: !585)
!638 = !DILocation(line: 12, column: 56, scope: !585)
!639 = !DILocation(line: 12, column: 61, scope: !585)
!640 = !DILocation(line: 12, column: 5, scope: !585)
!641 = !DILocation(line: 13, column: 5, scope: !585)
!642 = distinct !DISubprogram(name: "center_text_at", linkageName: "game.center_text_at", scope: !12, file: !12, line: 16, type: !643, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !46, retainedNodes: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !99, !99, !99, !87, !589, !595}
!645 = !{!646, !647}
!646 = !DILocalVariable(name: "dtext", scope: !642, file: !12, line: 17, type: !606, align: 8)
!647 = !DILocalVariable(name: "text_width", scope: !642, file: !12, line: 24, type: !99, align: 4)
!648 = !DILocalVariable(name: "x", arg: 1, scope: !642, file: !12, line: 16, type: !99)
!649 = !DILocation(line: 16, column: 30, scope: !642)
!650 = !DILocalVariable(name: "y", arg: 2, scope: !642, file: !12, line: 16, type: !99)
!651 = !DILocation(line: 16, column: 39, scope: !642)
!652 = !DILocalVariable(name: "width", arg: 3, scope: !642, file: !12, line: 16, type: !99)
!653 = !DILocation(line: 16, column: 48, scope: !642)
