; ModuleID = 'std::compression::qoi'
source_filename = "std::compression::qoi"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.462 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any.464 = type { ptr, i64 }
%"char[].461" = type { ptr, i64 }
%"any[].465" = type { ptr, i64 }
%Header.466 = type <{ i32, i32, i32, i8, i8 }>
%OpRGBA = type { i8, i8, i8, i8, i8 }
%OpRGB = type { i8, i8, i8, i8 }

@"$ct.std.compression.qoi.QOIDesc" = linkonce global %.introspect.462 { i8 10, i64 0, ptr null, i64 12, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"$ct.std.compression.qoi.QOIColorspace" = linkonce global %.introspect.462 { i8 9, i64 0, ptr null, i64 1, i64 ptrtoint (ptr @"$ct.char" to i64), i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.char" = linkonce global %.introspect.462 { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.compression.qoi.QOIChannels" = linkonce global %.introspect.462 { i8 9, i64 0, ptr null, i64 1, i64 ptrtoint (ptr @"$ct.char" to i64), i64 3, [0 x i64] zeroinitializer }, align 8
@"$ct.std.compression.qoi.Header" = linkonce global %.introspect.462 { i8 10, i64 0, ptr null, i64 14, i64 0, i64 5, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PIXELS_MAX", linkageName: "std.compression.qoi.PIXELS_MAX", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "qoi.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/compression")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OP_RGB", linkageName: "std.compression.qoi.OP_RGB", scope: !2, file: !2, line: 386, type: !3, isLocal: true, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "OP_RGBA", linkageName: "std.compression.qoi.OP_RGBA", scope: !2, file: !2, line: 387, type: !3, isLocal: true, isDefinition: true, align: 4)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "OP_INDEX", linkageName: "std.compression.qoi.OP_INDEX", scope: !2, file: !2, line: 389, type: !3, isLocal: true, isDefinition: true, align: 4)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "OP_DIFF", linkageName: "std.compression.qoi.OP_DIFF", scope: !2, file: !2, line: 390, type: !3, isLocal: true, isDefinition: true, align: 4)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "OP_LUMA", linkageName: "std.compression.qoi.OP_LUMA", scope: !2, file: !2, line: 391, type: !3, isLocal: true, isDefinition: true, align: 4)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "OP_RUN", linkageName: "std.compression.qoi.OP_RUN", scope: !2, file: !2, line: 392, type: !3, isLocal: true, isDefinition: true, align: 4)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "END_OF_STREAM", linkageName: "std.compression.qoi.END_OF_STREAM", scope: !2, file: !2, line: 410, type: !18, isLocal: true, isDefinition: true, align: 1)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, align: 8, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !{!21}
!21 = !DISubrange(count: 8, lowerBound: 0)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 2, !"wchar_size", i32 4}
!25 = !{i32 4, !"PIC Level", i32 2}
!26 = !{i32 1, !"uwtable", i32 1}
!27 = !{i32 2, !"frame-pointer", i32 1}
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, globals: !39, splitDebugInlining: false)
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIChannels", scope: !31, file: !2, line: 24, baseType: !19, size: 8, align: 8, elements: !38)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QOIDesc", scope: !2, file: !2, line: 35, size: 96, align: 32, elements: !32, identifier: "std.compression.qoi.QOIDesc")
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !31, file: !2, line: 37, baseType: !3, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !31, file: !2, line: 38, baseType: !3, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !31, file: !2, line: 39, baseType: !30, size: 8, align: 8, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !31, file: !2, line: 40, baseType: !37, size: 8, align: 8, offset: 72)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIColorspace", scope: !31, file: !2, line: 10, baseType: !19, size: 8, align: 8, elements: !38)
!38 = !{}
!39 = !{!0, !4, !6, !8, !10, !12, !14, !16}
!40 = distinct !DISubprogram(name: "write", linkageName: "std.compression.qoi.write", scope: !2, file: !2, line: 68, type: !41, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !28, retainedNodes: !52)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !45, !51}
!43 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !46, identifier: "char[]")
!46 = !{!47, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !45, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !43)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QOIDesc*", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !{!53}
!53 = !DILocalVariable(name: "output", scope: !54, file: !2, line: 71, type: !45, align: 8)
!54 = distinct !DILexicalBlock(scope: !40, file: !2, line: 69, column: 1)
!55 = !DILocalVariable(name: "filename", arg: 1, scope: !40, file: !2, line: 68, type: !44)
!56 = !DILocation(line: 68, column: 22, scope: !40)
!57 = !DILocalVariable(name: "input", arg: 2, scope: !40, file: !2, line: 68, type: !45)
!58 = !DILocation(line: 68, column: 39, scope: !40)
!59 = !DILocalVariable(name: "desc", arg: 3, scope: !40, file: !2, line: 68, type: !51)
!60 = !DILocation(line: 68, column: 55, scope: !40)
!61 = !DILocalVariable(name: "state", scope: !62, file: !2, line: 648, type: !65, align: 8)
!62 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !63, file: !63, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !64)
!63 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!64 = !{!61}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 420, baseType: !66, align: 8)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !68, identifier: "std.core.mem.allocator.TempAllocator")
!68 = !{!69, !76, !88, !89, !91, !92, !93, !94, !95, !96, !97}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !67, file: !2, line: 33, baseType: !70, size: 128, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !71, identifier: "Allocator")
!71 = !{!72, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !70, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !67, file: !2, line: 34, baseType: !77, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !79, identifier: "std.core.mem.allocator.TempAllocatorPage")
!79 = !{!80, !81, !82, !83, !84}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !78, file: !2, line: 56, baseType: !77, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !78, file: !2, line: 57, baseType: !73, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !78, file: !2, line: 58, baseType: !50, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !78, file: !2, line: 59, baseType: !50, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !2, line: 60, baseType: !85, align: 8, offset: 256)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 0, lowerBound: 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !67, file: !2, line: 35, baseType: !66, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !67, file: !2, line: 36, baseType: !90, size: 8, align: 8, offset: 256)
!90 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !67, file: !2, line: 37, baseType: !50, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !67, file: !2, line: 38, baseType: !50, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !67, file: !2, line: 39, baseType: !50, size: 64, align: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !67, file: !2, line: 40, baseType: !50, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !67, file: !2, line: 41, baseType: !50, size: 64, align: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !67, file: !2, line: 42, baseType: !50, size: 64, align: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !2, line: 43, baseType: !85, align: 8, offset: 704)
!98 = !DILocation(line: 648, column: 12, scope: !62, inlinedAt: !99)
!99 = !DILocation(line: 68, column: 64, scope: !40)
!100 = !DILocation(line: 648, column: 20, scope: !62, inlinedAt: !99)
!101 = !DILocation(line: 71, column: 9, scope: !54)
!102 = !DILocation(line: 71, column: 25, scope: !54)
!103 = !DILocation(line: 71, column: 18, scope: !54)
!104 = !DILocation(line: 651, column: 23, scope: !105, inlinedAt: !99)
!105 = distinct !DILexicalBlock(scope: !62, file: !63, line: 650, column: 2)
!106 = !DILocation(line: 651, column: 3, scope: !105, inlinedAt: !99)
!107 = !DILocation(line: 73, column: 23, scope: !54)
!108 = !DILocation(line: 73, column: 2, scope: !54)
!109 = !DILocation(line: 651, column: 23, scope: !110, inlinedAt: !99)
!110 = distinct !DILexicalBlock(scope: !62, file: !63, line: 650, column: 2)
!111 = !DILocation(line: 651, column: 3, scope: !110, inlinedAt: !99)
!112 = !DILocation(line: 74, column: 9, scope: !54)
!113 = !DILocation(line: 651, column: 23, scope: !114, inlinedAt: !99)
!114 = distinct !DILexicalBlock(scope: !62, file: !63, line: 650, column: 2)
!115 = !DILocation(line: 651, column: 3, scope: !114, inlinedAt: !99)
!116 = distinct !DISubprogram(name: "read", linkageName: "std.compression.qoi.read", scope: !2, file: !2, line: 100, type: !117, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !28, retainedNodes: !119)
!117 = !DISubroutineType(types: !118)
!118 = !{!45, !70, !44, !51, !30}
!119 = !{!120}
!120 = !DILocalVariable(name: "data", scope: !121, file: !2, line: 103, type: !45, align: 8)
!121 = distinct !DILexicalBlock(scope: !116, file: !2, line: 101, column: 1)
!122 = !DILocalVariable(name: "allocator", arg: 1, scope: !116, file: !2, line: 100, type: !70)
!123 = !DILocation(line: 100, column: 27, scope: !116)
!124 = !DILocalVariable(name: "filename", arg: 2, scope: !116, file: !2, line: 100, type: !44)
!125 = !DILocation(line: 100, column: 45, scope: !116)
!126 = !DILocalVariable(name: "desc", arg: 3, scope: !116, file: !2, line: 100, type: !51)
!127 = !DILocation(line: 100, column: 64, scope: !116)
!128 = !DILocalVariable(name: "channels", arg: 4, scope: !116, file: !2, line: 100, type: !30)
!129 = !DILocation(line: 100, column: 82, scope: !116)
!130 = !DILocalVariable(name: "state", scope: !131, file: !2, line: 648, type: !65, align: 8)
!131 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !63, file: !63, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !132)
!132 = !{!130}
!133 = !DILocation(line: 648, column: 12, scope: !131, inlinedAt: !134)
!134 = !DILocation(line: 100, column: 102, scope: !116)
!135 = !DILocation(line: 648, column: 20, scope: !131, inlinedAt: !134)
!136 = !DILocation(line: 103, column: 9, scope: !121)
!137 = !DILocation(line: 103, column: 16, scope: !121)
!138 = !DILocation(line: 103, column: 45, scope: !121)
!139 = !DILocation(line: 651, column: 23, scope: !140, inlinedAt: !134)
!140 = distinct !DILexicalBlock(scope: !131, file: !63, line: 650, column: 2)
!141 = !DILocation(line: 651, column: 3, scope: !140, inlinedAt: !134)
!142 = !DILocation(line: 105, column: 9, scope: !121)
!143 = !DILocation(line: 651, column: 23, scope: !144, inlinedAt: !134)
!144 = distinct !DILexicalBlock(scope: !131, file: !63, line: 650, column: 2)
!145 = !DILocation(line: 651, column: 3, scope: !144, inlinedAt: !134)
!146 = !DILocation(line: 651, column: 23, scope: !147, inlinedAt: !134)
!147 = distinct !DILexicalBlock(scope: !131, file: !63, line: 650, column: 2)
!148 = !DILocation(line: 651, column: 3, scope: !147, inlinedAt: !134)
!149 = distinct !DISubprogram(name: "encode", linkageName: "std.compression.qoi.encode", scope: !2, file: !2, line: 128, type: !150, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !28, retainedNodes: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{!45, !70, !45, !51}
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !169, !170, !171, !176}
!153 = !DILocalVariable(name: "pixels", scope: !149, file: !2, line: 133, type: !3, align: 4)
!154 = !DILocalVariable(name: "image_size", scope: !149, file: !2, line: 137, type: !3, align: 4)
!155 = !DILocalVariable(name: "max_size", scope: !149, file: !2, line: 142, type: !3, align: 4)
!156 = !DILocalVariable(name: "output", scope: !149, file: !2, line: 143, type: !45, align: 8)
!157 = !DILocalVariable(name: "pos", scope: !149, file: !2, line: 155, type: !3, align: 4)
!158 = !DILocalVariable(name: "loc", scope: !149, file: !2, line: 156, type: !3, align: 4)
!159 = !DILocalVariable(name: "loc_end", scope: !149, file: !2, line: 157, type: !3, align: 4)
!160 = !DILocalVariable(name: "run_length", scope: !149, file: !2, line: 158, type: !19, align: 1)
!161 = !DILocalVariable(name: "palette", scope: !149, file: !2, line: 160, type: !162, align: 4)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 2048, align: 32, elements: !167)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", scope: !2, file: !2, line: 412, baseType: !164, align: 4)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, align: 8, flags: DIFlagVector, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 4, lowerBound: 0)
!167 = !{!168}
!168 = !DISubrange(count: 64, lowerBound: 0)
!169 = !DILocalVariable(name: "prev", scope: !149, file: !2, line: 161, type: !163, align: 4)
!170 = !DILocalVariable(name: "p", scope: !149, file: !2, line: 162, type: !163, align: 4)
!171 = !DILocalVariable(name: "diff", scope: !149, file: !2, line: 164, type: !172, align: 4)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 24, align: 8, flags: DIFlagVector, elements: !174)
!173 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!174 = !{!175}
!175 = !DISubrange(count: 3, lowerBound: 0)
!176 = !DILocalVariable(name: "luma", scope: !149, file: !2, line: 165, type: !172, align: 4)
!177 = !DILocalVariable(name: "allocator", arg: 1, scope: !149, file: !2, line: 128, type: !70)
!178 = !DILocation(line: 128, column: 29, scope: !149)
!179 = !DILocalVariable(name: "input", arg: 2, scope: !149, file: !2, line: 128, type: !45)
!180 = !DILocation(line: 128, column: 47, scope: !149)
!181 = !DILocalVariable(name: "desc", arg: 3, scope: !149, file: !2, line: 128, type: !51)
!182 = !DILocation(line: 128, column: 63, scope: !149)
!183 = !DILocation(line: 131, column: 6, scope: !149)
!184 = !DILocation(line: 131, column: 25, scope: !149)
!185 = !DILocation(line: 131, column: 50, scope: !149)
!186 = !DILocation(line: 132, column: 6, scope: !149)
!187 = !DILocation(line: 132, column: 36, scope: !149)
!188 = !DILocation(line: 133, column: 7, scope: !149)
!189 = !DILocation(line: 133, column: 16, scope: !149)
!190 = !DILocation(line: 133, column: 29, scope: !149)
!191 = !DILocation(line: 134, column: 6, scope: !149)
!192 = !DILocation(line: 134, column: 34, scope: !149)
!193 = !DILocation(line: 137, column: 7, scope: !149)
!194 = !DILocation(line: 137, column: 20, scope: !149)
!195 = !DILocation(line: 137, column: 29, scope: !149)
!196 = !DILocation(line: 138, column: 6, scope: !149)
!197 = !DILocation(line: 138, column: 20, scope: !149)
!198 = !DILocation(line: 138, column: 38, scope: !149)
!199 = !DILocation(line: 142, column: 7, scope: !149)
!200 = !DILocation(line: 142, column: 34, scope: !149)
!201 = !DILocation(line: 142, column: 18, scope: !149)
!202 = !DILocation(line: 142, column: 43, scope: !149)
!203 = !DILocation(line: 143, column: 9, scope: !149)
!204 = !DILocation(line: 143, column: 58, scope: !149)
!205 = !DILocation(line: 304, column: 40, scope: !206, inlinedAt: !208)
!206 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !207, file: !207, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!207 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!208 = !DILocation(line: 287, column: 9, scope: !209, inlinedAt: !210)
!209 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !207, file: !207, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!210 = !DILocation(line: 143, column: 18, scope: !149)
!211 = !DILocation(line: 80, column: 6, scope: !212, inlinedAt: !213)
!212 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !207, file: !207, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!213 = !DILocation(line: 304, column: 18, scope: !206, inlinedAt: !208)
!214 = !DILocation(line: 80, column: 20, scope: !212, inlinedAt: !213)
!215 = !DILocation(line: 43, column: 71, scope: !216, inlinedAt: !217)
!216 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !207, file: !207, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!217 = !DILocation(line: 86, column: 10, scope: !212, inlinedAt: !213)
!218 = !DILocation(line: 304, column: 67, scope: !206, inlinedAt: !208)
!219 = !DILocation(line: 11, column: 36, scope: !220, inlinedAt: !222)
!220 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !221, file: !221, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!221 = !DIFile(filename: "bits.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std")
!222 = !DILocation(line: 148, column: 15, scope: !149)
!223 = !DILocation(line: 11, column: 36, scope: !224, inlinedAt: !225)
!224 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !221, file: !221, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!225 = !DILocation(line: 149, column: 15, scope: !149)
!226 = !DILocation(line: 150, column: 22, scope: !149)
!227 = !DILocation(line: 11, column: 36, scope: !228, inlinedAt: !229)
!228 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !221, file: !221, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!229 = !DILocation(line: 150, column: 16, scope: !149)
!230 = !DILocation(line: 151, column: 15, scope: !149)
!231 = !DILocation(line: 152, column: 17, scope: !149)
!232 = !DILocation(line: 147, column: 12, scope: !149)
!233 = !DILocation(line: 155, column: 7, scope: !149)
!234 = !DILocation(line: 155, column: 13, scope: !149)
!235 = !DILocation(line: 156, column: 7, scope: !149)
!236 = !DILocation(line: 157, column: 7, scope: !149)
!237 = !DILocation(line: 157, column: 17, scope: !149)
!238 = !DILocation(line: 157, column: 30, scope: !149)
!239 = !DILocation(line: 158, column: 7, scope: !149)
!240 = !DILocation(line: 158, column: 20, scope: !149)
!241 = !DILocation(line: 160, column: 12, scope: !149)
!242 = !DILocation(line: 161, column: 8, scope: !149)
!243 = !DILocation(line: 161, column: 15, scope: !149)
!244 = !DILocation(line: 162, column: 8, scope: !149)
!245 = !DILocation(line: 162, column: 12, scope: !149)
!246 = !DILocation(line: 164, column: 13, scope: !149)
!247 = !DILocation(line: 165, column: 13, scope: !149)
!248 = !DILocation(line: 168, column: 13, scope: !249)
!249 = distinct !DILexicalBlock(scope: !149, file: !2, line: 168, column: 2)
!250 = !DILocation(line: 168, column: 16, scope: !249)
!251 = !DILocation(line: 168, column: 22, scope: !249)
!252 = !DILocation(line: 171, column: 10, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !2, line: 169, column: 2)
!254 = !DILocation(line: 174, column: 11, scope: !253)
!255 = !DILocation(line: 174, column: 17, scope: !253)
!256 = !DILocation(line: 174, column: 3, scope: !253)
!257 = !DILocation(line: 175, column: 7, scope: !253)
!258 = !DILocation(line: 175, column: 30, scope: !253)
!259 = !DILocation(line: 175, column: 36, scope: !253)
!260 = !DILocation(line: 175, column: 42, scope: !253)
!261 = !DILocation(line: 178, column: 7, scope: !253)
!262 = !DILocation(line: 178, column: 15, scope: !253)
!263 = !DILocation(line: 180, column: 4, scope: !264)
!264 = distinct !DILexicalBlock(scope: !253, file: !2, line: 179, column: 3)
!265 = !DILocation(line: 181, column: 8, scope: !264)
!266 = !DILocation(line: 181, column: 28, scope: !264)
!267 = !DILocation(line: 181, column: 35, scope: !264)
!268 = !DILocation(line: 183, column: 48, scope: !269)
!269 = distinct !DILexicalBlock(scope: !264, file: !2, line: 182, column: 4)
!270 = !DILocalVariable(name: "chunk", scope: !271, file: !2, line: 463, type: !273, align: 8)
!271 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !272)
!272 = !{!270}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRun*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!274 = !DILocation(line: 463, column: 9, scope: !271, inlinedAt: !275)
!275 = !DILocation(line: 183, column: 6, scope: !269)
!276 = !DILocation(line: 463, column: 25, scope: !271, inlinedAt: !275)
!277 = !DILocation(line: 463, column: 31, scope: !271, inlinedAt: !275)
!278 = !DILocation(line: 464, column: 3, scope: !271, inlinedAt: !275)
!279 = !DILocation(line: 464, column: 2, scope: !271, inlinedAt: !275)
!280 = !DILocation(line: 465, column: 9, scope: !271, inlinedAt: !275)
!281 = !DILocation(line: 184, column: 18, scope: !269)
!282 = !DILocation(line: 186, column: 4, scope: !264)
!283 = !DILocation(line: 189, column: 7, scope: !253)
!284 = !DILocation(line: 191, column: 47, scope: !285)
!285 = distinct !DILexicalBlock(scope: !253, file: !2, line: 190, column: 3)
!286 = !DILocalVariable(name: "chunk", scope: !287, file: !2, line: 463, type: !273, align: 8)
!287 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !288)
!288 = !{!286}
!289 = !DILocation(line: 463, column: 9, scope: !287, inlinedAt: !290)
!290 = !DILocation(line: 191, column: 5, scope: !285)
!291 = !DILocation(line: 463, column: 25, scope: !287, inlinedAt: !290)
!292 = !DILocation(line: 463, column: 31, scope: !287, inlinedAt: !290)
!293 = !DILocation(line: 464, column: 3, scope: !287, inlinedAt: !290)
!294 = !DILocation(line: 464, column: 2, scope: !287, inlinedAt: !290)
!295 = !DILocation(line: 465, column: 9, scope: !287, inlinedAt: !290)
!296 = !DILocation(line: 192, column: 17, scope: !285)
!297 = !DILocation(line: 415, column: 10, scope: !298, inlinedAt: !299)
!298 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!299 = !DILocation(line: 198, column: 18, scope: !300)
!300 = distinct !DILexicalBlock(scope: !253, file: !2, line: 195, column: 3)
!301 = !DILocation(line: 415, column: 20, scope: !298, inlinedAt: !299)
!302 = !DILocation(line: 415, column: 30, scope: !298, inlinedAt: !299)
!303 = !DILocation(line: 415, column: 40, scope: !298, inlinedAt: !299)
!304 = !DILocation(line: 415, column: 9, scope: !298, inlinedAt: !299)
!305 = !DILocation(line: 198, column: 31, scope: !300)
!306 = !DILocation(line: 198, column: 10, scope: !300)
!307 = !DILocation(line: 415, column: 10, scope: !308, inlinedAt: !309)
!308 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!309 = !DILocation(line: 201, column: 6, scope: !310)
!310 = distinct !DILexicalBlock(scope: !300, file: !2, line: 199, column: 5)
!311 = !DILocation(line: 415, column: 20, scope: !308, inlinedAt: !309)
!312 = !DILocation(line: 415, column: 30, scope: !308, inlinedAt: !309)
!313 = !DILocation(line: 415, column: 40, scope: !308, inlinedAt: !309)
!314 = !DILocation(line: 415, column: 9, scope: !308, inlinedAt: !309)
!315 = !DILocalVariable(name: "chunk", scope: !316, file: !2, line: 463, type: !318, align: 8)
!316 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !317)
!317 = !{!315}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpIndex*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!319 = !DILocation(line: 463, column: 9, scope: !316, inlinedAt: !320)
!320 = !DILocation(line: 199, column: 6, scope: !310)
!321 = !DILocation(line: 463, column: 25, scope: !316, inlinedAt: !320)
!322 = !DILocation(line: 463, column: 31, scope: !316, inlinedAt: !320)
!323 = !DILocation(line: 464, column: 3, scope: !316, inlinedAt: !320)
!324 = !DILocation(line: 464, column: 2, scope: !316, inlinedAt: !320)
!325 = !DILocation(line: 465, column: 9, scope: !316, inlinedAt: !320)
!326 = !DILocation(line: 205, column: 10, scope: !300)
!327 = !DILocation(line: 205, column: 18, scope: !300)
!328 = !DILocation(line: 205, column: 23, scope: !300)
!329 = !DILocation(line: 205, column: 33, scope: !300)
!330 = !DILocation(line: 207, column: 12, scope: !331)
!331 = distinct !DILexicalBlock(scope: !300, file: !2, line: 207, column: 5)
!332 = !DILocation(line: 207, column: 20, scope: !331)
!333 = !DILocation(line: 208, column: 9, scope: !331)
!334 = !DILocation(line: 208, column: 24, scope: !331)
!335 = !DILocation(line: 209, column: 9, scope: !331)
!336 = !DILocation(line: 209, column: 24, scope: !331)
!337 = !DILocation(line: 210, column: 9, scope: !331)
!338 = !DILocation(line: 210, column: 24, scope: !331)
!339 = !DILocation(line: 214, column: 13, scope: !340)
!340 = distinct !DILexicalBlock(scope: !331, file: !2, line: 211, column: 5)
!341 = !DILocation(line: 214, column: 7, scope: !340)
!342 = !DILocation(line: 215, column: 13, scope: !340)
!343 = !DILocation(line: 215, column: 7, scope: !340)
!344 = !DILocation(line: 216, column: 13, scope: !340)
!345 = !DILocation(line: 216, column: 7, scope: !340)
!346 = !DILocalVariable(name: "chunk", scope: !347, file: !2, line: 463, type: !349, align: 8)
!347 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !348)
!348 = !{!346}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpDiff*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!350 = !DILocation(line: 463, column: 9, scope: !347, inlinedAt: !351)
!351 = !DILocation(line: 212, column: 7, scope: !340)
!352 = !DILocation(line: 463, column: 25, scope: !347, inlinedAt: !351)
!353 = !DILocation(line: 463, column: 31, scope: !347, inlinedAt: !351)
!354 = !DILocation(line: 464, column: 3, scope: !347, inlinedAt: !351)
!355 = !DILocation(line: 464, column: 2, scope: !347, inlinedAt: !351)
!356 = !DILocation(line: 465, column: 9, scope: !347, inlinedAt: !351)
!357 = !DILocation(line: 415, column: 10, scope: !358, inlinedAt: !359)
!358 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!359 = !DILocation(line: 218, column: 14, scope: !340)
!360 = !DILocation(line: 415, column: 20, scope: !358, inlinedAt: !359)
!361 = !DILocation(line: 415, column: 30, scope: !358, inlinedAt: !359)
!362 = !DILocation(line: 415, column: 40, scope: !358, inlinedAt: !359)
!363 = !DILocation(line: 415, column: 9, scope: !358, inlinedAt: !359)
!364 = !DILocation(line: 219, column: 6, scope: !340)
!365 = !DILocation(line: 222, column: 14, scope: !331)
!366 = !DILocation(line: 222, column: 23, scope: !331)
!367 = !DILocation(line: 222, column: 31, scope: !331)
!368 = !DILocation(line: 222, column: 39, scope: !331)
!369 = !DILocation(line: 222, column: 48, scope: !331)
!370 = !DILocation(line: 223, column: 9, scope: !331)
!371 = !DILocation(line: 223, column: 25, scope: !331)
!372 = !DILocation(line: 224, column: 9, scope: !331)
!373 = !DILocation(line: 224, column: 26, scope: !331)
!374 = !DILocation(line: 225, column: 9, scope: !331)
!375 = !DILocation(line: 225, column: 25, scope: !331)
!376 = !DILocation(line: 229, column: 13, scope: !377)
!377 = distinct !DILexicalBlock(scope: !331, file: !2, line: 226, column: 5)
!378 = !DILocation(line: 229, column: 7, scope: !377)
!379 = !DILocation(line: 230, column: 13, scope: !377)
!380 = !DILocation(line: 230, column: 7, scope: !377)
!381 = !DILocation(line: 231, column: 13, scope: !377)
!382 = !DILocation(line: 231, column: 7, scope: !377)
!383 = !DILocalVariable(name: "chunk", scope: !384, file: !2, line: 463, type: !386, align: 8)
!384 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !385)
!385 = !{!383}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpLuma*", baseType: !387, size: 64, align: 64, dwarfAddressSpace: 0)
!387 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!388 = !DILocation(line: 463, column: 9, scope: !384, inlinedAt: !389)
!389 = !DILocation(line: 227, column: 7, scope: !377)
!390 = !DILocation(line: 463, column: 25, scope: !384, inlinedAt: !389)
!391 = !DILocation(line: 463, column: 31, scope: !384, inlinedAt: !389)
!392 = !DILocation(line: 464, column: 3, scope: !384, inlinedAt: !389)
!393 = !DILocation(line: 464, column: 2, scope: !384, inlinedAt: !389)
!394 = !DILocation(line: 465, column: 9, scope: !384, inlinedAt: !389)
!395 = !DILocation(line: 415, column: 10, scope: !396, inlinedAt: !397)
!396 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!397 = !DILocation(line: 233, column: 14, scope: !377)
!398 = !DILocation(line: 415, column: 20, scope: !396, inlinedAt: !397)
!399 = !DILocation(line: 415, column: 30, scope: !396, inlinedAt: !397)
!400 = !DILocation(line: 415, column: 40, scope: !396, inlinedAt: !397)
!401 = !DILocation(line: 415, column: 9, scope: !396, inlinedAt: !397)
!402 = !DILocation(line: 234, column: 6, scope: !377)
!403 = !DILocation(line: 236, column: 5, scope: !331)
!404 = !DILocation(line: 240, column: 9, scope: !405)
!405 = distinct !DILexicalBlock(scope: !300, file: !2, line: 240, column: 5)
!406 = !DILocation(line: 240, column: 19, scope: !405)
!407 = !DILocation(line: 242, column: 42, scope: !408)
!408 = distinct !DILexicalBlock(scope: !405, file: !2, line: 241, column: 5)
!409 = !DILocation(line: 242, column: 51, scope: !408)
!410 = !DILocation(line: 242, column: 56, scope: !408)
!411 = !DILocation(line: 242, column: 61, scope: !408)
!412 = !DILocation(line: 242, column: 66, scope: !408)
!413 = !DILocalVariable(name: "chunk", scope: !414, file: !2, line: 463, type: !416, align: 8)
!414 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !415)
!415 = !{!413}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGBA*", baseType: !417, size: 64, align: 64, dwarfAddressSpace: 0)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGBA", scope: !2, file: !2, line: 425, size: 40, align: 8, elements: !418, identifier: "std.compression.qoi.OpRGBA")
!418 = !{!419, !420, !421, !422, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !417, file: !2, line: 427, baseType: !19, size: 8, align: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !417, file: !2, line: 428, baseType: !19, size: 8, align: 8, offset: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !417, file: !2, line: 429, baseType: !19, size: 8, align: 8, offset: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !417, file: !2, line: 430, baseType: !19, size: 8, align: 8, offset: 24)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !417, file: !2, line: 431, baseType: !19, size: 8, align: 8, offset: 32)
!424 = !DILocation(line: 463, column: 9, scope: !414, inlinedAt: !425)
!425 = !DILocation(line: 242, column: 7, scope: !408)
!426 = !DILocation(line: 463, column: 25, scope: !414, inlinedAt: !425)
!427 = !DILocation(line: 463, column: 31, scope: !414, inlinedAt: !425)
!428 = !DILocation(line: 464, column: 3, scope: !414, inlinedAt: !425)
!429 = !DILocation(line: 464, column: 2, scope: !414, inlinedAt: !425)
!430 = !DILocation(line: 465, column: 9, scope: !414, inlinedAt: !425)
!431 = !DILocation(line: 246, column: 41, scope: !432)
!432 = distinct !DILexicalBlock(scope: !405, file: !2, line: 245, column: 5)
!433 = !DILocation(line: 246, column: 49, scope: !432)
!434 = !DILocation(line: 246, column: 54, scope: !432)
!435 = !DILocation(line: 246, column: 59, scope: !432)
!436 = !DILocalVariable(name: "chunk", scope: !437, file: !2, line: 463, type: !439, align: 8)
!437 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !438)
!438 = !{!436}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGB*", baseType: !440, size: 64, align: 64, dwarfAddressSpace: 0)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGB", scope: !2, file: !2, line: 418, size: 32, align: 8, elements: !441, identifier: "std.compression.qoi.OpRGB")
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !440, file: !2, line: 420, baseType: !19, size: 8, align: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !440, file: !2, line: 421, baseType: !19, size: 8, align: 8, offset: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !440, file: !2, line: 422, baseType: !19, size: 8, align: 8, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !440, file: !2, line: 423, baseType: !19, size: 8, align: 8, offset: 24)
!446 = !DILocation(line: 463, column: 9, scope: !437, inlinedAt: !447)
!447 = !DILocation(line: 246, column: 7, scope: !432)
!448 = !DILocation(line: 463, column: 25, scope: !437, inlinedAt: !447)
!449 = !DILocation(line: 463, column: 31, scope: !437, inlinedAt: !447)
!450 = !DILocation(line: 464, column: 3, scope: !437, inlinedAt: !447)
!451 = !DILocation(line: 464, column: 2, scope: !437, inlinedAt: !447)
!452 = !DILocation(line: 465, column: 9, scope: !437, inlinedAt: !447)
!453 = !DILocation(line: 415, column: 10, scope: !454, inlinedAt: !455)
!454 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!455 = !DILocation(line: 248, column: 13, scope: !405)
!456 = !DILocation(line: 415, column: 20, scope: !454, inlinedAt: !455)
!457 = !DILocation(line: 415, column: 30, scope: !454, inlinedAt: !455)
!458 = !DILocation(line: 415, column: 40, scope: !454, inlinedAt: !455)
!459 = !DILocation(line: 415, column: 9, scope: !454, inlinedAt: !455)
!460 = !DILocation(line: 168, column: 34, scope: !249)
!461 = !DILocation(line: 168, column: 41, scope: !249)
!462 = !DILocation(line: 253, column: 2, scope: !149)
!463 = !DILocation(line: 253, column: 9, scope: !149)
!464 = !DILocation(line: 254, column: 2, scope: !149)
!465 = !DILocation(line: 256, column: 9, scope: !149)
!466 = !DILocation(line: 256, column: 17, scope: !149)
!467 = distinct !DISubprogram(name: "decode", linkageName: "std.compression.qoi.decode", scope: !2, file: !2, line: 283, type: !468, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !28, retainedNodes: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{!45, !70, !45, !51, !30}
!470 = !{!471, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !494, !496, !498, !500, !502, !504}
!471 = !DILocalVariable(name: "header", scope: !467, file: !2, line: 289, type: !472, align: 8)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Header*", baseType: !473, size: 64, align: 64, dwarfAddressSpace: 0)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", scope: !2, file: !2, line: 394, size: 112, align: 8, elements: !474, identifier: "std.compression.qoi.Header")
!474 = !{!475, !476, !477, !478, !479}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "be_magic", scope: !473, file: !2, line: 397, baseType: !3, size: 32, align: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "be_width", scope: !473, file: !2, line: 399, baseType: !3, size: 32, align: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "be_height", scope: !473, file: !2, line: 401, baseType: !3, size: 32, align: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !473, file: !2, line: 405, baseType: !30, size: 8, align: 8, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !473, file: !2, line: 407, baseType: !37, size: 8, align: 8, offset: 104)
!480 = !DILocalVariable(name: "pixels", scope: !467, file: !2, line: 305, type: !43, align: 8)
!481 = !DILocalVariable(name: "pos", scope: !467, file: !2, line: 308, type: !3, align: 4)
!482 = !DILocalVariable(name: "loc", scope: !467, file: !2, line: 309, type: !3, align: 4)
!483 = !DILocalVariable(name: "run_length", scope: !467, file: !2, line: 310, type: !19, align: 1)
!484 = !DILocalVariable(name: "tag", scope: !467, file: !2, line: 311, type: !19, align: 1)
!485 = !DILocalVariable(name: "palette", scope: !467, file: !2, line: 313, type: !162, align: 4)
!486 = !DILocalVariable(name: "p", scope: !467, file: !2, line: 314, type: !163, align: 4)
!487 = !DILocalVariable(name: "image_size", scope: !467, file: !2, line: 319, type: !50, align: 8)
!488 = !DILocalVariable(name: "image", scope: !467, file: !2, line: 320, type: !45, align: 8)
!489 = !DILocalVariable(name: "op", scope: !490, file: !2, line: 335, type: !439, align: 8)
!490 = distinct !DILexicalBlock(scope: !491, file: !2, line: 335, column: 5)
!491 = distinct !DILexicalBlock(scope: !492, file: !2, line: 329, column: 3)
!492 = distinct !DILexicalBlock(scope: !493, file: !2, line: 324, column: 2)
!493 = distinct !DILexicalBlock(scope: !467, file: !2, line: 323, column: 2)
!494 = !DILocalVariable(name: "op", scope: !495, file: !2, line: 340, type: !416, align: 8)
!495 = distinct !DILexicalBlock(scope: !491, file: !2, line: 340, column: 5)
!496 = !DILocalVariable(name: "op", scope: !497, file: !2, line: 345, type: !318, align: 8)
!497 = distinct !DILexicalBlock(scope: !491, file: !2, line: 345, column: 5)
!498 = !DILocalVariable(name: "op", scope: !499, file: !2, line: 349, type: !349, align: 8)
!499 = distinct !DILexicalBlock(scope: !491, file: !2, line: 349, column: 5)
!500 = !DILocalVariable(name: "op", scope: !501, file: !2, line: 356, type: !386, align: 8)
!501 = distinct !DILexicalBlock(scope: !491, file: !2, line: 356, column: 5)
!502 = !DILocalVariable(name: "diff_green", scope: !501, file: !2, line: 357, type: !503, align: 4)
!503 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!504 = !DILocalVariable(name: "op", scope: !505, file: !2, line: 364, type: !273, align: 8)
!505 = distinct !DILexicalBlock(scope: !491, file: !2, line: 364, column: 5)
!506 = !DILocalVariable(name: "allocator", arg: 1, scope: !467, file: !2, line: 283, type: !70)
!507 = !DILocation(line: 283, column: 29, scope: !467)
!508 = !DILocalVariable(name: "data", arg: 2, scope: !467, file: !2, line: 283, type: !45)
!509 = !DILocation(line: 283, column: 47, scope: !467)
!510 = !DILocalVariable(name: "desc", arg: 3, scope: !467, file: !2, line: 283, type: !51)
!511 = !DILocation(line: 283, column: 62, scope: !467)
!512 = !DILocalVariable(name: "channels", arg: 4, scope: !467, file: !2, line: 283, type: !30)
!513 = !DILocation(line: 283, column: 80, scope: !467)
!514 = !DILocation(line: 286, column: 6, scope: !467)
!515 = !DILocation(line: 286, column: 59, scope: !467)
!516 = !DILocation(line: 289, column: 10, scope: !467)
!517 = !DILocation(line: 289, column: 28, scope: !467)
!518 = !DILocation(line: 292, column: 12, scope: !467)
!519 = !DILocation(line: 11, column: 36, scope: !520, inlinedAt: !521)
!520 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !221, file: !221, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!521 = !DILocation(line: 292, column: 6, scope: !467)
!522 = !DILocation(line: 292, column: 47, scope: !467)
!523 = !DILocation(line: 295, column: 21, scope: !467)
!524 = !DILocation(line: 11, column: 36, scope: !525, inlinedAt: !526)
!525 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !221, file: !221, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!526 = !DILocation(line: 295, column: 15, scope: !467)
