; ModuleID = 'std::thread::threadpool'
source_filename = "std::thread::threadpool"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.455 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any.458 = type { ptr, i64 }
%"char[].454" = type { ptr, i64 }
%FixedThreadPool = type { %NativeMutex.457, %"QueueItem[]", i64, i64, i8, %"NativeThread[]", [6 x i64] }
%NativeMutex.457 = type { [8 x i64], i8 }
%"QueueItem[]" = type { ptr, i64 }
%"NativeThread[]" = type { ptr, i64 }
%"any[].459" = type { ptr, i64 }
%NativeThread.460 = type { ptr, ptr, ptr }
%QueueItem = type { ptr, %"any[].459" }

@"$ct.std.thread.threadpool.FixedThreadPool" = linkonce global %.introspect.455 { i8 10, i64 0, ptr null, i64 176, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@"$ct.std.thread.threadpool.QueueItem" = linkonce global %.introspect.455 { i8 10, i64 0, ptr null, i64 24, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.fault" = linkonce global %.introspect.455 { i8 6, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.panic_msg = internal constant [37 x i8] c"Unexpected fault '%s' was unwrapped!\00", align 1
@.file = internal constant [14 x i8] c"fixed_pool.c3\00", align 1
@.func = internal constant [13 x i8] c"process_work\00", align 1
@std.core.mem.allocator.thread_allocator = extern_weak thread_local global %any.458, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "fixed_pool.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/threads")
!8 = distinct !DISubprogram(name: "init", linkageName: "std.thread.threadpool.FixedThreadPool.init", scope: !7, file: !7, line: 37, type: !9, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !81)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11, !21, !21}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedThreadPool*", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedThreadPool", scope: !7, file: !7, line: 11, size: 1408, align: 64, elements: !13, identifier: "std.thread.threadpool.FixedThreadPool")
!13 = !{!14, !26, !52, !53, !54, !56, !75}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !12, file: !7, line: 13, baseType: !15, size: 576, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mutex", scope: !7, file: !7, line: 11, baseType: !16, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeMutex", scope: !7, file: !7, line: 4, size: 576, align: 64, elements: !17, identifier: "std.thread.os.NativeMutex")
!17 = !{!18, !24}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !16, file: !7, line: 6, baseType: !19, size: 512, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_mutex_t", scope: !7, file: !7, line: 96, baseType: !20, align: 8)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 64, elements: !22)
!21 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!22 = !{!23}
!23 = !DISubrange(count: 8, lowerBound: 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !16, file: !7, line: 7, baseType: !25, size: 8, align: 8, offset: 512)
!25 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !12, file: !7, line: 14, baseType: !27, size: 128, align: 64, offset: 576)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem[]", size: 128, align: 64, elements: !28, identifier: "QueueItem[]")
!28 = !{!29, !51}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QueueItem*", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem", scope: !7, file: !7, line: 26, size: 192, align: 64, elements: !32, identifier: "std.thread.threadpool.QueueItem")
!32 = !{!33, !50}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !31, file: !7, line: 28, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolFn", scope: !7, file: !7, line: 9, baseType: !35, align: 8)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadPoolFn", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !39, identifier: "any[]")
!39 = !{!40, !48}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !43, identifier: "any")
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !21)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !31, file: !7, line: 29, baseType: !38, size: 128, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !27, baseType: !49, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "qindex", scope: !12, file: !7, line: 15, baseType: !49, size: 64, align: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !12, file: !7, line: 16, baseType: !49, size: 64, align: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_member, scope: !12, file: !7, line: 17, baseType: !55, size: 8, align: 8, offset: 832)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !12, file: !7, line: 22, baseType: !57, size: 128, align: 64, offset: 896)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread[]", size: 128, align: 64, elements: !58, identifier: "Thread[]")
!58 = !{!59, !74}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !57, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Thread*", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", scope: !7, file: !7, line: 16, baseType: !62, align: 8)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeThread", scope: !7, file: !7, line: 14, size: 192, align: 64, elements: !63, identifier: "std.thread.os.NativeThread")
!63 = !{!64, !66, !73}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pthread", scope: !62, file: !7, line: 16, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_t", scope: !7, file: !7, line: 10, baseType: !45, align: 8)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "thread_fn", scope: !62, file: !7, line: 17, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFn", scope: !7, file: !7, line: 20, baseType: !68, align: 8)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadFn", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !45}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !7, file: !7, line: 23, baseType: !72, align: 4)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !62, file: !7, line: 18, baseType: !45, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !57, baseType: !49, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !12, file: !7, line: 23, baseType: !76, size: 384, align: 64, offset: 1024)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", scope: !7, file: !7, line: 15, baseType: !77, align: 8)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_cond_t", scope: !7, file: !7, line: 93, baseType: !78, align: 8)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 384, align: 64, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 6, lowerBound: 0)
!81 = !{!82, !84}
!82 = !DILocalVariable(name: ".temp", scope: !83, file: !7, line: 50, type: !49, align: 8)
!83 = distinct !DILexicalBlock(scope: !8, file: !7, line: 50, column: 2)
!84 = !DILocalVariable(name: "thread", scope: !85, file: !7, line: 50, type: !60, align: 8)
!85 = distinct !DILexicalBlock(scope: !83, file: !7, line: 51, column: 2)
!86 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 37, type: !11)
!87 = !DILocation(line: 37, column: 31, scope: !8)
!88 = !DILocalVariable(name: "threads", arg: 2, scope: !8, file: !7, line: 37, type: !49)
!89 = !DILocation(line: 37, column: 42, scope: !8)
!90 = !DILocalVariable(name: "queue_size", arg: 3, scope: !8, file: !7, line: 37, type: !49)
!91 = !DILocation(line: 37, column: 55, scope: !8)
!92 = !DILocation(line: 33, column: 12, scope: !93)
!93 = distinct !DILexicalBlock(scope: !8, file: !7, line: 38, column: 1)
!94 = !DILocation(line: 33, column: 11, scope: !93)
!95 = !DILocation(line: 34, column: 11, scope: !93)
!96 = !DILocation(line: 34, column: 26, scope: !93)
!97 = !DILocation(line: 35, column: 11, scope: !93)
!98 = !DILocation(line: 39, column: 6, scope: !8)
!99 = !DILocation(line: 39, column: 36, scope: !8)
!100 = !DILocation(line: 41, column: 9, scope: !8)
!101 = !DILocation(line: 43, column: 18, scope: !8)
!102 = !DILocation(line: 44, column: 18, scope: !8)
!103 = !DILocation(line: 912, column: 32, scope: !104, inlinedAt: !106)
!104 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !105, file: !105, line: 910, scopeLine: 910, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!105 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!106 = !DILocation(line: 45, column: 12, scope: !8)
!107 = !DILocation(line: 304, column: 55, scope: !108, inlinedAt: !110)
!108 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !109, file: !109, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!109 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!110 = !DILocation(line: 287, column: 9, scope: !111, inlinedAt: !112)
!111 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !109, file: !109, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!112 = !DILocation(line: 912, column: 9, scope: !104, inlinedAt: !106)
!113 = !DILocation(line: 304, column: 40, scope: !108, inlinedAt: !110)
!114 = !DILocation(line: 80, column: 6, scope: !115, inlinedAt: !116)
!115 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !109, file: !109, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!116 = !DILocation(line: 304, column: 18, scope: !108, inlinedAt: !110)
!117 = !DILocation(line: 80, column: 20, scope: !115, inlinedAt: !116)
!118 = !DILocation(line: 43, column: 71, scope: !119, inlinedAt: !120)
!119 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !109, file: !109, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!120 = !DILocation(line: 86, column: 10, scope: !115, inlinedAt: !116)
!121 = !DILocation(line: 304, column: 67, scope: !108, inlinedAt: !110)
!122 = !DILocation(line: 895, column: 30, scope: !123, inlinedAt: !124)
