; ModuleID = 'std::crypto::aes'
source_filename = "std::crypto::aes"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.68 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].67" = type { ptr, i64 }
%AesKey = type { i64, i32, i32, i64, i64 }
%any.70 = type { ptr, i64 }
%Aes = type { %AesKey, i32, [16 x i8], [256 x i8], [4 x [4 x i8]] }
%"any[].71" = type { ptr, i64 }

@"$ct.std.crypto.aes.AesKey" = linkonce global %.introspect.68 { i8 10, i64 0, ptr null, i64 32, i64 0, i64 5, [0 x i64] zeroinitializer }, align 8
@"$ct.std.crypto.aes.Aes" = linkonce global %.introspect.68 { i8 10, i64 0, ptr null, i64 328, i64 0, i64 5, [0 x i64] zeroinitializer }, align 8
@.enum.ECB = internal constant [4 x i8] c"ECB\00", align 1
@.enum.CBC = internal constant [4 x i8] c"CBC\00", align 1
@.enum.CTR = internal constant [4 x i8] c"CTR\00", align 1
@"$ct.int" = linkonce global %.introspect.68 { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.crypto.aes.BlockMode" = linkonce global { i8, i64, ptr, i64, i64, i64, [3 x %"char[].67"] } { i8 8, i64 0, ptr null, i64 4, i64 ptrtoint (ptr @"$ct.int" to i64), i64 3, [3 x %"char[].67"] [%"char[].67" { ptr @.enum.ECB, i64 3 }, %"char[].67" { ptr @.enum.CBC, i64 3 }, %"char[].67" { ptr @.enum.CTR, i64 3 }] }, align 8
@.enum.AES128 = internal constant [7 x i8] c"AES128\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BLOCKLEN", linkageName: "std.crypto.aes.BLOCKLEN", scope: !2, file: !2, line: 38, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "aes.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/crypto")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "COLNUM", linkageName: "std.crypto.aes.COLNUM", scope: !2, file: !2, line: 41, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "SBOX", linkageName: "std.crypto.aes.SBOX", scope: !2, file: !2, line: 379, type: !8, isLocal: true, isDefinition: true, align: 1)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, align: 8, elements: !10)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !{!11}
!11 = !DISubrange(count: 256, lowerBound: 0)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "RSBOX", linkageName: "std.crypto.aes.RSBOX", scope: !2, file: !2, line: 397, type: !8, isLocal: true, isDefinition: true, align: 1)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "RCON", linkageName: "std.crypto.aes.RCON", scope: !2, file: !2, line: 415, type: !16, isLocal: true, isDefinition: true, align: 1)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 88, align: 8, elements: !17)
!17 = !{!18}
!18 = !DISubrange(count: 11, lowerBound: 0)
!19 = !{i32 2, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 2, !"wchar_size", i32 4}
!22 = !{i32 4, !"PIC Level", i32 2}
!23 = !{i32 1, !"uwtable", i32 1}
!24 = !{i32 2, !"frame-pointer", i32 1}
!25 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !26, globals: !60, splitDebugInlining: false)
!26 = !{!27, !55}
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockMode", scope: !28, file: !2, line: 49, baseType: !3, size: 32, align: 32, elements: !51)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Aes", scope: !2, file: !2, line: 78, size: 2624, align: 64, elements: !29, identifier: "std.crypto.aes.Aes")
!29 = !{!30, !40, !41, !45, !46}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !2, line: 81, baseType: !31, size: 256, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "AesKey", scope: !28, file: !2, line: 64, size: 256, align: 64, elements: !32, identifier: "std.crypto.aes.AesKey")
!32 = !{!33, !36, !37, !38, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !31, file: !2, line: 67, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !35)
!35 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !31, file: !2, line: 69, baseType: !3, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "key_exp_size", scope: !31, file: !2, line: 71, baseType: !3, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !31, file: !2, line: 73, baseType: !34, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !31, file: !2, line: 75, baseType: !34, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !28, file: !2, line: 83, baseType: !27, size: 32, align: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !28, file: !2, line: 85, baseType: !42, size: 128, align: 8, offset: 288)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, align: 8, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 16, lowerBound: 0)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "round_key", scope: !28, file: !2, line: 87, baseType: !8, size: 2048, align: 8, offset: 416)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !28, file: !2, line: 89, baseType: !47, size: 128, align: 8, offset: 2464)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "AesState", scope: !2, file: !2, line: 91, baseType: !48, align: 1)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, align: 8, elements: !49)
!49 = !{!50, !50}
!50 = !DISubrange(count: 4, lowerBound: 0)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "ECB", value: 0)
!53 = !DIEnumerator(name: "CBC", value: 1)
!54 = !DIEnumerator(name: "CTR", value: 2)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AesType", scope: !2, file: !2, line: 57, baseType: !3, size: 32, align: 32, elements: !56)
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "AES128", value: 0)
!58 = !DIEnumerator(name: "AES192", value: 1)
!59 = !DIEnumerator(name: "AES256", value: 2)
!60 = !{!0, !4, !6, !12, !14}
!61 = distinct !DISubprogram(name: "init", linkageName: "std.crypto.aes.Aes.init", scope: !2, file: !2, line: 104, type: !62, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !70)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !64, !55, !65, !42, !27}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Aes*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !66, identifier: "char[]")
!66 = !{!67, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !65, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, baseType: !34, size: 64, align: 64, offset: 64)
!70 = !{}
!71 = !DILocalVariable(name: "self", arg: 1, scope: !61, file: !2, line: 104, type: !64)
!72 = !DILocation(line: 104, column: 18, scope: !61)
!73 = !DILocalVariable(name: "type", arg: 2, scope: !61, file: !2, line: 104, type: !55)
!74 = !DILocation(line: 104, column: 33, scope: !61)
!75 = !DILocalVariable(name: "key", arg: 3, scope: !61, file: !2, line: 104, type: !65)
!76 = !DILocation(line: 104, column: 46, scope: !61)
!77 = !DILocalVariable(name: "iv", arg: 4, scope: !61, file: !2, line: 104, type: !42)
!78 = !DILocation(line: 104, column: 66, scope: !61)
!79 = !DILocalVariable(name: "mode", arg: 5, scope: !61, file: !2, line: 104, type: !27)
!80 = !DILocation(line: 104, column: 80, scope: !61)
!81 = !DILocation(line: 102, column: 11, scope: !82)
!82 = distinct !DILexicalBlock(scope: !61, file: !2, line: 105, column: 1)
!83 = !DILocation(line: 102, column: 22, scope: !82)
!84 = !DILocation(line: 106, column: 20, scope: !61)
!85 = !DILocation(line: 106, column: 38, scope: !61)
!86 = !DILocation(line: 106, column: 50, scope: !61)
!87 = !DILocation(line: 106, column: 3, scope: !61)
!88 = !DILocation(line: 107, column: 28, scope: !61)
!89 = !DILocation(line: 107, column: 2, scope: !61)
!90 = !DILocation(line: 108, column: 9, scope: !61)
!91 = distinct !DISubprogram(name: "destroy", linkageName: "std.crypto.aes.Aes.destroy", scope: !2, file: !2, line: 114, type: !92, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !70)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !64}
!94 = !DILocalVariable(name: "self", arg: 1, scope: !91, file: !2, line: 114, type: !64)
!95 = !DILocation(line: 114, column: 21, scope: !91)
!96 = !DILocation(line: 116, column: 3, scope: !91)
!97 = distinct !DISubprogram(name: "encrypt_buffer", linkageName: "std.crypto.aes.Aes.encrypt_buffer", scope: !2, file: !2, line: 140, type: !98, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !70)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !64, !65, !65}
!100 = !DILocalVariable(name: "self", arg: 1, scope: !97, file: !2, line: 140, type: !64)
!101 = !DILocation(line: 140, column: 28, scope: !97)
!102 = !DILocalVariable(name: "in", arg: 2, scope: !97, file: !2, line: 140, type: !65)
!103 = !DILocation(line: 140, column: 42, scope: !97)
!104 = !DILocalVariable(name: "out", arg: 3, scope: !97, file: !2, line: 140, type: !65)
!105 = !DILocation(line: 140, column: 53, scope: !97)
!106 = !DILocation(line: 138, column: 11, scope: !107)
!107 = distinct !DILexicalBlock(scope: !97, file: !2, line: 141, column: 1)
!108 = !DILocation(line: 138, column: 22, scope: !107)
!109 = !DILocation(line: 142, column: 10, scope: !110)
!110 = distinct !DILexicalBlock(scope: !97, file: !2, line: 142, column: 2)
!111 = !DILocation(line: 144, column: 41, scope: !112)
!112 = distinct !DILexicalBlock(scope: !110, file: !2, line: 144, column: 13)
!113 = !DILocation(line: 144, column: 13, scope: !112)
!114 = !DILocation(line: 145, column: 42, scope: !115)
!115 = distinct !DILexicalBlock(scope: !110, file: !2, line: 145, column: 13)
!116 = !DILocation(line: 145, column: 13, scope: !115)
!117 = !DILocation(line: 146, column: 42, scope: !118)
!118 = distinct !DILexicalBlock(scope: !110, file: !2, line: 146, column: 13)
!119 = !DILocation(line: 146, column: 13, scope: !118)
!120 = distinct !DISubprogram(name: "decrypt_buffer", linkageName: "std.crypto.aes.Aes.decrypt_buffer", scope: !2, file: !2, line: 156, type: !98, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !70)
!121 = !DILocalVariable(name: "self", arg: 1, scope: !120, file: !2, line: 156, type: !64)
!122 = !DILocation(line: 156, column: 28, scope: !120)
!123 = !DILocalVariable(name: "in", arg: 2, scope: !120, file: !2, line: 156, type: !65)
!124 = !DILocation(line: 156, column: 42, scope: !120)
!125 = !DILocalVariable(name: "out", arg: 3, scope: !120, file: !2, line: 156, type: !65)
!126 = !DILocation(line: 156, column: 53, scope: !120)
!127 = !DILocation(line: 154, column: 11, scope: !128)
!128 = distinct !DILexicalBlock(scope: !120, file: !2, line: 157, column: 1)
!129 = !DILocation(line: 154, column: 22, scope: !128)
!130 = !DILocation(line: 158, column: 10, scope: !131)
!131 = distinct !DILexicalBlock(scope: !120, file: !2, line: 158, column: 2)
!132 = !DILocation(line: 160, column: 42, scope: !133)
!133 = distinct !DILexicalBlock(scope: !131, file: !2, line: 160, column: 13)
!134 = !DILocation(line: 160, column: 13, scope: !133)
!135 = !DILocation(line: 161, column: 42, scope: !136)
!136 = distinct !DILexicalBlock(scope: !131, file: !2, line: 161, column: 13)
!137 = !DILocation(line: 161, column: 13, scope: !136)
!138 = !DILocation(line: 162, column: 41, scope: !139)
!139 = distinct !DILexicalBlock(scope: !131, file: !2, line: 162, column: 13)
!140 = !DILocation(line: 162, column: 13, scope: !139)
!141 = distinct !DISubprogram(name: "encrypt", linkageName: "std.crypto.aes.Aes.encrypt", scope: !2, file: !2, line: 173, type: !142, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !150)
!142 = !DISubroutineType(types: !143)
!143 = !{!65, !64, !144, !65}
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !145, identifier: "Allocator")
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !144, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!150 = !{!151}
!151 = !DILocalVariable(name: "out", scope: !141, file: !2, line: 175, type: !65, align: 8)
!152 = !DILocalVariable(name: "self", arg: 1, scope: !141, file: !2, line: 173, type: !64)
!153 = !DILocation(line: 173, column: 23, scope: !141)
!154 = !DILocalVariable(name: "allocator", arg: 2, scope: !141, file: !2, line: 173, type: !144)
!155 = !DILocation(line: 173, column: 40, scope: !141)
!156 = !DILocalVariable(name: "in", arg: 3, scope: !141, file: !2, line: 173, type: !65)
!157 = !DILocation(line: 173, column: 58, scope: !141)
!158 = !DILocation(line: 175, column: 9, scope: !141)
!159 = !DILocation(line: 175, column: 55, scope: !141)
!160 = !DILocation(line: 304, column: 55, scope: !161, inlinedAt: !163)
!161 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !162, file: !162, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!162 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!163 = !DILocation(line: 287, column: 9, scope: !164, inlinedAt: !165)
!164 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !162, file: !162, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!165 = !DILocation(line: 175, column: 15, scope: !141)
!166 = !DILocation(line: 304, column: 40, scope: !161, inlinedAt: !163)
!167 = !DILocation(line: 80, column: 6, scope: !168, inlinedAt: !169)
!168 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !162, file: !162, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!169 = !DILocation(line: 304, column: 18, scope: !161, inlinedAt: !163)
!170 = !DILocation(line: 80, column: 20, scope: !168, inlinedAt: !169)
!171 = !DILocation(line: 43, column: 71, scope: !172, inlinedAt: !173)
!172 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !162, file: !162, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!173 = !DILocation(line: 86, column: 10, scope: !168, inlinedAt: !169)
!174 = !DILocation(line: 304, column: 67, scope: !161, inlinedAt: !163)
!175 = !DILocation(line: 176, column: 26, scope: !141)
!176 = !DILocation(line: 176, column: 2, scope: !141)
!177 = !DILocation(line: 177, column: 9, scope: !141)
!178 = distinct !DISubprogram(name: "tencrypt", linkageName: "std.crypto.aes.Aes.tencrypt", scope: !2, file: !2, line: 186, type: !179, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !70)
!179 = !DISubroutineType(types: !180)
!180 = !{!65, !64, !65}
!181 = !DILocalVariable(name: "self", arg: 1, scope: !178, file: !2, line: 186, type: !64)
!182 = !DILocation(line: 186, column: 24, scope: !178)
!183 = !DILocalVariable(name: "in", arg: 2, scope: !178, file: !2, line: 186, type: !65)
!184 = !DILocation(line: 186, column: 38, scope: !178)
!185 = !DILocation(line: 188, column: 22, scope: !178)
!186 = !DILocation(line: 188, column: 28, scope: !178)
!187 = !DILocation(line: 188, column: 9, scope: !178)
!188 = distinct !DISubprogram(name: "decrypt", linkageName: "std.crypto.aes.Aes.decrypt", scope: !2, file: !2, line: 198, type: !142, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !189)
!189 = !{!190}
!190 = !DILocalVariable(name: "out", scope: !188, file: !2, line: 200, type: !65, align: 8)
!191 = !DILocalVariable(name: "self", arg: 1, scope: !188, file: !2, line: 198, type: !64)
!192 = !DILocation(line: 198, column: 23, scope: !188)
!193 = !DILocalVariable(name: "allocator", arg: 2, scope: !188, file: !2, line: 198, type: !144)
