; ModuleID = 'std::collections::object'
source_filename = "std::collections::object"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.540 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any.543 = type { ptr, i64 }
%Object.542 = type { i64, %any.543, %.anon.544 }
%.anon.544 = type { i128, [32 x i8] }
%"char[].539" = type { ptr, i64 }
%"any[].545" = type { ptr, i64 }
%OnStackAllocator.547 = type { %any.543, %"char[].539", i64, ptr }
%"char[][].548" = type { ptr, i64 }
%HashMap.549 = type { %"Entry*[].550", %any.543, i32, i32, float }
%"Entry*[].550" = type { ptr, i64 }

@"$ct.std.collections.object.Object.$anon" = linkonce global %.introspect.540 { i8 11, i64 0, ptr null, i64 48, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@"$ct.std.collections.object.Object" = linkonce global %.introspect.540 { i8 10, i64 0, ptr null, i64 80, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@"$ct.bool" = linkonce global %.introspect.540 { i8 1, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@std.collections.object.TRUE_OBJECT = weak constant { i64, %any.543, [8 x i8], { i8, [47 x i8] } } { i64 ptrtoint (ptr @"$ct.bool" to i64), %any.543 zeroinitializer, [8 x i8] undef, { i8, [47 x i8] } { i8 1, [47 x i8] undef } }, align 16, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TRUE_OBJECT", linkageName: "std.collections.object.TRUE_OBJECT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 16)
!2 = !DIFile(filename: "object.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/collections")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !4, identifier: "std.collections.object.Object")
!4 = !{!5, !7, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3, file: !2, line: 13, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 14, baseType: !8, size: 128, align: 64, offset: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !6, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, scope: !3, file: !2, line: 15, baseType: !14, size: 384, align: 128, offset: 256)
!14 = !DICompositeType(tag: DW_TAG_union_type, scope: !3, file: !2, line: 15, size: 384, align: 128, elements: !15)
!15 = !{!16, !18, !20, !22, !32, !33, !44}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !14, file: !2, line: 17, baseType: !17, size: 128, align: 128)
!17 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !2, line: 18, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !14, file: !2, line: 19, baseType: !21, size: 8, align: 8)
!21 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !2, line: 20, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!31 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !14, file: !2, line: 21, baseType: !11, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !14, file: !2, line: 22, baseType: !34, size: 320, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 466, baseType: !35, align: 8)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !36, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, line: 20, baseType: !30, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !35, file: !2, line: 21, baseType: !30, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !35, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !35, file: !2, line: 23, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 466, baseType: !43, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !2, line: 23, baseType: !45, size: 384, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 465, baseType: !46, align: 8)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !47, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!47 = !{!48, !64, !65, !66, !67}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !2, line: 31, baseType: !49, size: 128, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !50, identifier: "Entry*[]")
!50 = !{!51, !63}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !55, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!55 = !{!56, !58, !60, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !54, file: !2, line: 23, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !54, file: !2, line: 24, baseType: !59, size: 128, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 465, baseType: !23, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !54, file: !2, line: 25, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 465, baseType: !43, align: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !2, line: 26, baseType: !53, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !30, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !46, file: !2, line: 32, baseType: !8, size: 128, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !2, line: 34, baseType: !57, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !46, file: !2, line: 36, baseType: !57, size: 32, align: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !46, file: !2, line: 37, baseType: !68, size: 32, align: 32, offset: 320)
!68 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "FALSE_OBJECT", linkageName: "std.collections.object.FALSE_OBJECT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 16)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "NULL_OBJECT", linkageName: "std.collections.object.NULL_OBJECT", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 16)
!73 = !{i32 2, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 2, !"wchar_size", i32 4}
!76 = !{i32 4, !"PIC Level", i32 2}
!77 = !{i32 1, !"uwtable", i32 1}
!78 = !{i32 2, !"frame-pointer", i32 1}
!79 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !80, splitDebugInlining: false)
!80 = !{!0, !69, !71}
!81 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.object.Object.to_format", scope: !2, file: !2, line: 28, type: !82, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !102)
!82 = !DISubroutineType(types: !83)
!83 = !{!31, !43, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !86, identifier: "std.io.Formatter")
!86 = !{!87, !88, !93}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !85, file: !2, line: 66, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !90, align: 8)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !11, !28}
!93 = !DIDerivedType(tag: DW_TAG_member, scope: !85, file: !2, line: 67, baseType: !94, size: 192, align: 64, offset: 128)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !85, file: !2, line: 67, size: 192, align: 64, elements: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !2, line: 69, baseType: !57, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !94, file: !2, line: 70, baseType: !57, size: 32, align: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !94, file: !2, line: 71, baseType: !57, size: 32, align: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !94, file: !2, line: 72, baseType: !100, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !101)
!101 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!102 = !{!103, !106, !108, !110, !111, !113, !114, !117, !119}
!103 = !DILocalVariable(name: "n", scope: !104, file: !2, line: 41, type: !30, align: 8)
!104 = distinct !DILexicalBlock(scope: !105, file: !2, line: 41, column: 4)
!105 = distinct !DILexicalBlock(scope: !81, file: !2, line: 30, column: 2)
!106 = !DILocalVariable(name: ".temp", scope: !107, file: !2, line: 42, type: !30, align: 8)
!107 = distinct !DILexicalBlock(scope: !104, file: !2, line: 42, column: 4)
!108 = !DILocalVariable(name: "i", scope: !109, file: !2, line: 42, type: !30, align: 8)
!109 = distinct !DILexicalBlock(scope: !107, file: !2, line: 43, column: 4)
!110 = !DILocalVariable(name: "ol", scope: !109, file: !2, line: 42, type: !42, align: 8)
!111 = !DILocalVariable(name: "n", scope: !112, file: !2, line: 50, type: !30, align: 8)
!112 = distinct !DILexicalBlock(scope: !105, file: !2, line: 50, column: 4)
!113 = !DILocalVariable(name: "mem", scope: !112, file: !2, line: 51, type: !8, align: 8)
!114 = !DILocalVariable(name: ".temp", scope: !115, file: !2, line: 53, type: !30, align: 8)
!115 = distinct !DILexicalBlock(scope: !116, file: !2, line: 53, column: 5)
!116 = distinct !DILexicalBlock(scope: !112, file: !2, line: 52, column: 4)
!117 = !DILocalVariable(name: "i", scope: !118, file: !2, line: 53, type: !30, align: 8)
!118 = distinct !DILexicalBlock(scope: !115, file: !2, line: 54, column: 5)
!119 = !DILocalVariable(name: "key", scope: !118, file: !2, line: 53, type: !59, align: 8)
!120 = !DILocalVariable(name: "self", arg: 1, scope: !81, file: !2, line: 28, type: !43)
!121 = !DILocation(line: 28, column: 26, scope: !81)
!122 = !DILocalVariable(name: "formatter", arg: 2, scope: !81, file: !2, line: 28, type: !84)
!123 = !DILocation(line: 28, column: 44, scope: !81)
!124 = !DILocation(line: 32, column: 8, scope: !105)
!125 = !DILocation(line: 33, column: 11, scope: !126)
!126 = distinct !DILexicalBlock(scope: !105, file: !2, line: 33, column: 4)
!127 = !DILocation(line: 34, column: 8, scope: !105)
!128 = !DILocation(line: 35, column: 11, scope: !129)
!129 = distinct !DILexicalBlock(scope: !105, file: !2, line: 35, column: 4)
!130 = !DILocation(line: 36, column: 8, scope: !105)
!131 = !DILocation(line: 37, column: 36, scope: !132)
!132 = distinct !DILexicalBlock(scope: !105, file: !2, line: 37, column: 4)
!133 = !DILocation(line: 37, column: 11, scope: !132)
!134 = !DILocation(line: 38, column: 8, scope: !105)
!135 = !DILocation(line: 39, column: 28, scope: !136)
!136 = distinct !DILexicalBlock(scope: !105, file: !2, line: 39, column: 4)
!137 = !DILocation(line: 39, column: 46, scope: !136)
!138 = !DILocation(line: 39, column: 11, scope: !136)
!139 = !DILocation(line: 40, column: 8, scope: !105)
!140 = !DILocation(line: 41, column: 8, scope: !104)
!141 = !DILocation(line: 41, column: 12, scope: !104)
!142 = !DILocation(line: 42, column: 21, scope: !107)
!143 = !DILocation(line: 42, column: 13, scope: !107)
!144 = !DILocation(line: 42, column: 13, scope: !109)
!145 = !DILocation(line: 42, column: 16, scope: !109)
!146 = !DILocation(line: 393, column: 26, scope: !147, inlinedAt: !145)
!147 = distinct !DILexicalBlock(scope: !149, file: !148, line: 394, column: 1)
!148 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/collections")
!149 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !148, file: !148, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79)
!150 = !DILocation(line: 391, column: 11, scope: !147, inlinedAt: !145)
!151 = !DILocation(line: 391, column: 19, scope: !147, inlinedAt: !145)
!152 = !DILocation(line: 42, column: 16, scope: !147, inlinedAt: !145)
!153 = !DILocation(line: 395, column: 9, scope: !149, inlinedAt: !145)
!154 = !DILocation(line: 395, column: 22, scope: !149, inlinedAt: !145)
!155 = !DILocation(line: 44, column: 9, scope: !156)
!156 = distinct !DILexicalBlock(scope: !109, file: !2, line: 43, column: 4)
!157 = !DILocation(line: 44, column: 16, scope: !156)
!158 = !DILocation(line: 44, column: 21, scope: !156)
!159 = !DILocation(line: 45, column: 5, scope: !156)
!160 = !DILocation(line: 45, column: 10, scope: !156)
!161 = !DILocation(line: 47, column: 4, scope: !104)
!162 = !DILocation(line: 47, column: 9, scope: !104)
!163 = !DILocation(line: 48, column: 11, scope: !104)
!164 = !DILocation(line: 49, column: 8, scope: !105)
!165 = !DILocation(line: 50, column: 8, scope: !112)
!166 = !DILocation(line: 50, column: 12, scope: !112)
!167 = !DILocalVariable(name: "buffer", scope: !168, file: !2, line: 579, type: !184, align: 1)
!168 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !169, file: !169, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !170)
!169 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!170 = !{!167, !171}
!171 = !DILocalVariable(name: "allocator", scope: !168, file: !2, line: 580, type: !172, align: 8)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !173, identifier: "std.core.mem.allocator.OnStackAllocator")
!173 = !{!174, !175, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !172, file: !2, line: 14, baseType: !8, size: 128, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !2, line: 15, baseType: !24, size: 128, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !172, file: !2, line: 16, baseType: !30, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !172, file: !2, line: 17, baseType: !178, size: 64, align: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !180, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.9581")
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !179, file: !2, line: 22, baseType: !21, size: 8, align: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !2, line: 23, baseType: !178, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !2, line: 24, baseType: !11, size: 64, align: 64, offset: 128)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 8, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 1024, lowerBound: 0)
!187 = !DILocation(line: 579, column: 14, scope: !168, inlinedAt: !188)
!188 = !DILocation(line: 51, column: 4, scope: !112)
!189 = !DILocation(line: 580, column: 19, scope: !168, inlinedAt: !188)
!190 = !DILocation(line: 581, column: 18, scope: !168, inlinedAt: !188)
!191 = !DILocation(line: 581, column: 26, scope: !168, inlinedAt: !188)
!192 = !DILocation(line: 581, column: 2, scope: !168, inlinedAt: !188)
!193 = !DILocation(line: 51, column: 31, scope: !112)
!194 = !DILocation(line: 583, column: 8, scope: !195, inlinedAt: !188)
!195 = distinct !DILexicalBlock(scope: !168, file: !169, line: 583, column: 2)
!196 = !DILocation(line: 53, column: 23, scope: !115)
!197 = !DILocation(line: 53, column: 37, scope: !115)
!198 = !DILocation(line: 53, column: 14, scope: !115)
!199 = !DILocation(line: 53, column: 14, scope: !118)
!200 = !DILocation(line: 53, column: 17, scope: !118)
!201 = !DILocation(line: 53, column: 23, scope: !118)
!202 = !DILocation(line: 55, column: 10, scope: !203)
!203 = distinct !DILexicalBlock(scope: !118, file: !2, line: 54, column: 5)
!204 = !DILocation(line: 55, column: 17, scope: !203)
!205 = !DILocation(line: 55, column: 22, scope: !203)
!206 = !DILocation(line: 582, column: 8, scope: !207, inlinedAt: !188)
!207 = distinct !DILexicalBlock(scope: !168, file: !169, line: 582, column: 8)
!208 = !DILocation(line: 56, column: 6, scope: !203)
!209 = !DILocation(line: 56, column: 37, scope: !203)
!210 = !DILocation(line: 56, column: 11, scope: !203)
!211 = !DILocation(line: 582, column: 8, scope: !212, inlinedAt: !188)
!212 = distinct !DILexicalBlock(scope: !168, file: !169, line: 582, column: 8)
!213 = !DILocation(line: 57, column: 6, scope: !203)
!214 = !DILocation(line: 57, column: 11, scope: !203)
!215 = !DILocation(line: 582, column: 8, scope: !216, inlinedAt: !188)
!216 = distinct !DILexicalBlock(scope: !168, file: !169, line: 582, column: 8)
!217 = !DILocation(line: 582, column: 8, scope: !218, inlinedAt: !188)
!218 = distinct !DILexicalBlock(scope: !168, file: !169, line: 582, column: 8)
!219 = !DILocation(line: 60, column: 4, scope: !112)
!220 = !DILocation(line: 60, column: 9, scope: !112)
!221 = !DILocation(line: 61, column: 11, scope: !112)
!222 = !DILocation(line: 63, column: 12, scope: !223)
!223 = distinct !DILexicalBlock(scope: !224, file: !2, line: 63, column: 4)
!224 = distinct !DILexicalBlock(scope: !105, file: !2, line: 63, column: 4)
!225 = !DILocation(line: 66, column: 44, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !2, line: 66, column: 6)
!227 = !DILocation(line: 66, column: 36, scope: !226)
!228 = !DILocation(line: 66, column: 13, scope: !226)
!229 = !DILocation(line: 68, column: 45, scope: !230)
!230 = distinct !DILexicalBlock(scope: !223, file: !2, line: 68, column: 6)
!231 = !DILocation(line: 68, column: 36, scope: !230)
!232 = !DILocation(line: 68, column: 13, scope: !230)
!233 = !DILocation(line: 70, column: 36, scope: !234)
!234 = distinct !DILexicalBlock(scope: !223, file: !2, line: 70, column: 6)
!235 = !DILocation(line: 70, column: 13, scope: !234)
!236 = !DILocation(line: 72, column: 36, scope: !237)
!237 = distinct !DILexicalBlock(scope: !223, file: !2, line: 72, column: 6)
!238 = !DILocation(line: 72, column: 13, scope: !237)
!239 = !DILocation(line: 74, column: 13, scope: !240)
!240 = distinct !DILexicalBlock(scope: !223, file: !2, line: 74, column: 6)
!241 = distinct !DISubprogram(name: "free", linkageName: "std.collections.object.Object.free", scope: !2, file: !2, line: 115, type: !242, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !244)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !43}
