; ModuleID = 'std::core::machoruntime'
source_filename = "std::core::machoruntime"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.203 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].202" = type { ptr, i64 }
%"DynamicMethod[]" = type { ptr, i64 }
%"Callback[]" = type { ptr, i64 }

@"$ct.std.core.machoruntime.SegmentCommand64" = linkonce global %.introspect.203 { i8 10, i64 0, ptr null, i64 72, i64 0, i64 11, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.LoadCommand" = linkonce global %.introspect.203 { i8 10, i64 0, ptr null, i64 8, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.Section64" = linkonce global %.introspect.203 { i8 10, i64 0, ptr null, i64 80, i64 0, i64 12, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.MachHeader" = linkonce global %.introspect.203 { i8 10, i64 0, ptr null, i64 28, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.MachHeader64" = linkonce global %.introspect.203 { i8 10, i64 ptrtoint (ptr @"$ct.std.core.machoruntime.MachHeader" to i64), ptr null, i64 32, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.DlInfo" = linkonce global %.introspect.203 { i8 10, i64 0, ptr null, i64 32, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LC_SEGMENT_64", linkageName: "std.core.machoruntime.LC_SEGMENT_64", scope: !2, file: !2, line: 57, type: !3, isLocal: true, isDefinition: true, align: 4)
!2 = !DIFile(filename: "macho_runtime.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core/private")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "runtime_state", linkageName: "std.core.machoruntime.runtime_state", scope: !2, file: !2, line: 155, type: !6, isLocal: true, isDefinition: true, align: 4)
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "StartupState", scope: !2, file: !2, line: 144, baseType: !7, size: 32, align: 32, elements: !8)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "NOT_STARTED", value: 0)
!10 = !DIEnumerator(name: "INIT", value: 1)
!11 = !DIEnumerator(name: "RUN_CTORS", value: 2)
!12 = !DIEnumerator(name: "READ_DYLIB", value: 3)
!13 = !DIEnumerator(name: "RUN_DYLIB_CTORS", value: 4)
!14 = !DIEnumerator(name: "RUN_DTORS", value: 5)
!15 = !DIEnumerator(name: "SHUTDOWN", value: 6)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "ctor_first", linkageName: "std.core.machoruntime.ctor_first", scope: !2, file: !2, line: 157, type: !18, isLocal: true, isDefinition: true, align: 8)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Callback*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Callback", scope: !2, file: !2, line: 127, size: 192, align: 64, elements: !20, identifier: "std.core.machoruntime.Callback")
!20 = !{!21, !22, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !19, file: !2, line: 129, baseType: !3, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "xtor", scope: !19, file: !2, line: 130, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallbackFn", scope: !2, file: !2, line: 126, baseType: !24, align: 8)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CallbackFn", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DISubroutineType(types: !26)
!26 = !{null}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !2, line: 131, baseType: !18, size: 64, align: 64, offset: 128)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "dtor_first", linkageName: "std.core.machoruntime.dtor_first", scope: !2, file: !2, line: 158, type: !18, isLocal: true, isDefinition: true, align: 8)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"wchar_size", i32 4}
!33 = !{i32 4, !"PIC Level", i32 2}
!34 = !{i32 1, !"uwtable", i32 1}
!35 = !{i32 2, !"frame-pointer", i32 1}
!36 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, globals: !38, splitDebugInlining: false)
!37 = !{!6}
!38 = !{!0, !4, !16, !28}
!39 = distinct !DISubprogram(name: "name_cmp", linkageName: "std.core.machoruntime.name_cmp", scope: !2, file: !2, line: 60, type: !40, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !49)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43, !45}
!42 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[16]*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, align: 8, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 16, lowerBound: 0)
!49 = !{!50}
!50 = !DILocalVariable(name: "i", scope: !51, file: !2, line: 62, type: !52, align: 8)
!51 = distinct !DILexicalBlock(scope: !39, file: !2, line: 62, column: 2)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !53)
!53 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!54 = !DILocalVariable(name: "a", arg: 1, scope: !39, file: !2, line: 60, type: !43)
!55 = !DILocation(line: 60, column: 24, scope: !39)
!56 = !DILocalVariable(name: "b", arg: 2, scope: !39, file: !2, line: 60, type: !45)
!57 = !DILocation(line: 60, column: 37, scope: !39)
!58 = !DILocation(line: 62, column: 11, scope: !51)
!59 = !DILocation(line: 62, column: 15, scope: !51)
!60 = !DILocation(line: 62, column: 18, scope: !51)
!61 = !DILocation(line: 64, column: 9, scope: !62)
!62 = distinct !DILexicalBlock(scope: !51, file: !2, line: 63, column: 2)
!63 = !DILocation(line: 64, column: 20, scope: !62)
!64 = !DILocation(line: 64, column: 7, scope: !62)
!65 = !DILocation(line: 64, column: 31, scope: !62)
!66 = !DILocation(line: 65, column: 9, scope: !62)
!67 = !DILocation(line: 65, column: 7, scope: !62)
!68 = !DILocation(line: 65, column: 28, scope: !62)
!69 = !DILocation(line: 62, column: 26, scope: !51)
!70 = !DILocation(line: 67, column: 9, scope: !39)
!71 = distinct !DISubprogram(name: "find_segment", linkageName: "std.core.machoruntime.find_segment", scope: !2, file: !2, line: 70, type: !72, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !98)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !88, !43}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SegmentCommand64*", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentCommand64", scope: !2, file: !2, line: 3, size: 576, align: 64, elements: !76, identifier: "std.core.machoruntime.SegmentCommand64")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !75, file: !2, line: 5, baseType: !3, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !75, file: !2, line: 6, baseType: !3, size: 32, align: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !75, file: !2, line: 7, baseType: !46, size: 128, align: 8, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "vmaddr", scope: !75, file: !2, line: 8, baseType: !53, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "vmsize", scope: !75, file: !2, line: 9, baseType: !53, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "fileoff", scope: !75, file: !2, line: 10, baseType: !53, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !75, file: !2, line: 11, baseType: !53, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "maxprot", scope: !75, file: !2, line: 12, baseType: !3, size: 32, align: 32, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "initprot", scope: !75, file: !2, line: 13, baseType: !3, size: 32, align: 32, offset: 480)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nsects", scope: !75, file: !2, line: 14, baseType: !3, size: 32, align: 32, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !2, line: 15, baseType: !3, size: 32, align: 32, offset: 544)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MachHeader*", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "MachHeader", scope: !2, file: !2, line: 40, size: 224, align: 32, elements: !90, identifier: "std.core.machoruntime.MachHeader")
!90 = !{!91, !92, !93, !94, !95, !96, !97}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !89, file: !2, line: 42, baseType: !3, size: 32, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cputype", scope: !89, file: !2, line: 43, baseType: !3, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cpusubtype", scope: !89, file: !2, line: 44, baseType: !3, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !89, file: !2, line: 45, baseType: !3, size: 32, align: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ncmds", scope: !89, file: !2, line: 46, baseType: !3, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sizeofcmds", scope: !89, file: !2, line: 47, baseType: !3, size: 32, align: 32, offset: 160)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !89, file: !2, line: 48, baseType: !3, size: 32, align: 32, offset: 192)
!98 = !{!99, !105, !107}
!99 = !DILocalVariable(name: "command", scope: !71, file: !2, line: 72, type: !100, align: 8)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "LoadCommand*", baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "LoadCommand", scope: !2, file: !2, line: 18, size: 64, align: 32, elements: !102, identifier: "std.core.machoruntime.LoadCommand")
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !101, file: !2, line: 20, baseType: !3, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !101, file: !2, line: 21, baseType: !3, size: 32, align: 32, offset: 32)
!105 = !DILocalVariable(name: "i", scope: !106, file: !2, line: 73, type: !3, align: 4)
!106 = distinct !DILexicalBlock(scope: !71, file: !2, line: 73, column: 2)
!107 = !DILocalVariable(name: "segment", scope: !108, file: !2, line: 77, type: !74, align: 8)
!108 = distinct !DILexicalBlock(scope: !109, file: !2, line: 76, column: 3)
!109 = distinct !DILexicalBlock(scope: !106, file: !2, line: 74, column: 2)
!110 = !DILocalVariable(name: "header", arg: 1, scope: !71, file: !2, line: 70, type: !88)
!111 = !DILocation(line: 70, column: 48, scope: !71)
!112 = !DILocalVariable(name: "segname", arg: 2, scope: !71, file: !2, line: 70, type: !43)
!113 = !DILocation(line: 70, column: 62, scope: !71)
!114 = !DILocation(line: 72, column: 15, scope: !71)
!115 = !DILocation(line: 72, column: 41, scope: !71)
!116 = !DILocation(line: 73, column: 12, scope: !106)
!117 = !DILocation(line: 73, column: 16, scope: !106)
!118 = !DILocation(line: 73, column: 19, scope: !106)
!119 = !DILocation(line: 73, column: 23, scope: !106)
!120 = !DILocation(line: 75, column: 7, scope: !109)
!121 = !DILocation(line: 77, column: 22, scope: !108)
!122 = !DILocation(line: 77, column: 51, scope: !108)
!123 = !DILocation(line: 78, column: 27, scope: !108)
!124 = !DILocation(line: 78, column: 8, scope: !108)
!125 = !DILocation(line: 78, column: 52, scope: !108)
!126 = !DILocation(line: 80, column: 20, scope: !109)
!127 = !DILocation(line: 80, column: 30, scope: !109)
!128 = !DILocation(line: 73, column: 37, scope: !106)
!129 = !DILocation(line: 82, column: 9, scope: !71)
!130 = distinct !DISubprogram(name: "find_section", linkageName: "std.core.machoruntime.find_section", scope: !2, file: !2, line: 84, type: !131, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !148)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !74, !43}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Section64*", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Section64", scope: !2, file: !2, line: 24, size: 640, align: 64, elements: !135, identifier: "std.core.machoruntime.Section64")
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "sectname", scope: !134, file: !2, line: 26, baseType: !46, size: 128, align: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !134, file: !2, line: 27, baseType: !46, size: 128, align: 8, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !134, file: !2, line: 28, baseType: !53, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !134, file: !2, line: 29, baseType: !53, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !134, file: !2, line: 30, baseType: !3, size: 32, align: 32, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !134, file: !2, line: 31, baseType: !3, size: 32, align: 32, offset: 416)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reloff", scope: !134, file: !2, line: 32, baseType: !3, size: 32, align: 32, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nreloc", scope: !134, file: !2, line: 33, baseType: !3, size: 32, align: 32, offset: 480)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !2, line: 34, baseType: !3, size: 32, align: 32, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !134, file: !2, line: 35, baseType: !3, size: 32, align: 32, offset: 544)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !134, file: !2, line: 36, baseType: !3, size: 32, align: 32, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !134, file: !2, line: 37, baseType: !3, size: 32, align: 32, offset: 608)
!148 = !{!149, !150}
!149 = !DILocalVariable(name: "section", scope: !130, file: !2, line: 86, type: !133, align: 8)
!150 = !DILocalVariable(name: "i", scope: !151, file: !2, line: 87, type: !3, align: 4)
!151 = distinct !DILexicalBlock(scope: !130, file: !2, line: 87, column: 2)
!152 = !DILocalVariable(name: "command", arg: 1, scope: !130, file: !2, line: 84, type: !74)
!153 = !DILocation(line: 84, column: 47, scope: !130)
!154 = !DILocalVariable(name: "sectname", arg: 2, scope: !130, file: !2, line: 84, type: !43)
!155 = !DILocation(line: 84, column: 62, scope: !130)
!156 = !DILocation(line: 86, column: 13, scope: !130)
!157 = !DILocation(line: 86, column: 40, scope: !130)
!158 = !DILocation(line: 87, column: 12, scope: !151)
!159 = !DILocation(line: 87, column: 16, scope: !151)
!160 = !DILocation(line: 87, column: 19, scope: !151)
!161 = !DILocation(line: 87, column: 23, scope: !151)
!162 = !DILocation(line: 89, column: 27, scope: !163)
!163 = distinct !DILexicalBlock(scope: !151, file: !2, line: 88, column: 2)
!164 = !DILocation(line: 89, column: 7, scope: !163)
!165 = !DILocation(line: 89, column: 53, scope: !163)
!166 = !DILocation(line: 90, column: 3, scope: !163)
!167 = !DILocation(line: 87, column: 39, scope: !151)
!168 = !DILocation(line: 92, column: 9, scope: !130)
!169 = distinct !DISubprogram(name: "runtime_startup", linkageName: "__c3_runtime_startup", scope: !2, file: !2, line: 160, type: !25, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !170)
!170 = !{!171}
!171 = !DILocalVariable(name: "ctor", scope: !169, file: !2, line: 167, type: !18, align: 8)
!172 = !DILocation(line: 162, column: 6, scope: !169)
!173 = !DILocation(line: 162, column: 42, scope: !169)
!174 = !DILocation(line: 163, column: 18, scope: !169)
!175 = !DILocation(line: 164, column: 2, scope: !169)
!176 = !DILocation(line: 165, column: 9, scope: !169)
!177 = !DILocation(line: 166, column: 18, scope: !169)
!178 = !DILocation(line: 167, column: 12, scope: !169)
!179 = !DILocation(line: 167, column: 19, scope: !169)
!180 = !DILocation(line: 168, column: 2, scope: !169)
!181 = !DILocation(line: 168, column: 9, scope: !182)
!182 = distinct !DILexicalBlock(scope: !169, file: !2, line: 168, column: 2)
!183 = !DILocation(line: 170, column: 3, scope: !184)
!184 = distinct !DILexicalBlock(scope: !182, file: !2, line: 169, column: 2)
!185 = !DILocation(line: 171, column: 10, scope: !184)
!186 = !DILocation(line: 173, column: 9, scope: !169)
!187 = !DILocation(line: 174, column: 18, scope: !169)
!188 = !DILocation(line: 175, column: 15, scope: !169)
!189 = distinct !DISubprogram(name: "runtime_finalize", linkageName: "__c3_runtime_finalize", scope: !2, file: !2, line: 178, type: !25, scopeLine: 178, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !190)
!190 = !{!191}
!191 = !DILocalVariable(name: "dtor", scope: !189, file: !2, line: 182, type: !18, align: 8)
!192 = !DILocation(line: 180, column: 6, scope: !189)
!193 = !DILocation(line: 180, column: 41, scope: !189)
!194 = !DILocation(line: 181, column: 18, scope: !189)
!195 = !DILocation(line: 182, column: 12, scope: !189)
!196 = !DILocation(line: 182, column: 19, scope: !189)
!197 = !DILocation(line: 183, column: 2, scope: !189)
!198 = !DILocation(line: 183, column: 9, scope: !199)
!199 = distinct !DILexicalBlock(scope: !189, file: !2, line: 183, column: 2)
!200 = !DILocation(line: 185, column: 3, scope: !201)
!201 = distinct !DILexicalBlock(scope: !199, file: !2, line: 184, column: 2)
!202 = !DILocation(line: 186, column: 10, scope: !201)
!203 = !DILocation(line: 188, column: 9, scope: !189)
!204 = !DILocation(line: 189, column: 18, scope: !189)
!205 = distinct !DISubprogram(name: "append_xxlizer", linkageName: "std.core.machoruntime.append_xxlizer", scope: !2, file: !2, line: 192, type: !206, scopeLine: 192, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !209)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !208, !18}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Callback**", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!209 = !{!210}
!210 = !DILocalVariable(name: "current", scope: !211, file: !2, line: 194, type: !18, align: 8)
!211 = distinct !DILexicalBlock(scope: !205, file: !2, line: 194, column: 2)
!212 = !DILocalVariable(name: "ref", arg: 1, scope: !205, file: !2, line: 192, type: !208)
!213 = !DILocation(line: 192, column: 35, scope: !205)
!214 = !DILocalVariable(name: "cb", arg: 2, scope: !205, file: !2, line: 192, type: !18)
!215 = !DILocation(line: 192, column: 50, scope: !205)
!216 = !DILocation(line: 194, column: 2, scope: !205)
!217 = !DILocation(line: 194, column: 19, scope: !211)
!218 = !DILocation(line: 194, column: 30, scope: !211)
!219 = !DILocation(line: 194, column: 35, scope: !211)
!220 = !DILocation(line: 196, column: 7, scope: !221)
!221 = distinct !DILexicalBlock(scope: !211, file: !2, line: 195, column: 2)
!222 = !DILocation(line: 196, column: 26, scope: !221)
!223 = !DILocation(line: 198, column: 4, scope: !224)
!224 = distinct !DILexicalBlock(scope: !221, file: !2, line: 197, column: 3)
!225 = !DILocation(line: 199, column: 4, scope: !224)
!226 = !DILocation(line: 201, column: 10, scope: !221)
!227 = !DILocation(line: 203, column: 3, scope: !205)
!228 = distinct !DISubprogram(name: "dl_reg_callback", linkageName: "std.core.machoruntime.dl_reg_callback", scope: !2, file: !2, line: 217, type: !229, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !232)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !88, !231}
!231 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!232 = !{!233, !234, !236, !263, !265, !266, !268, !270, !272, !274}
!233 = !DILocalVariable(name: "size", scope: !228, file: !2, line: 219, type: !52, align: 8)
!234 = !DILocalVariable(name: ".temp", scope: !235, file: !2, line: 221, type: !52, align: 8)
!235 = distinct !DILexicalBlock(scope: !228, file: !2, line: 221, column: 2)
!236 = !DILocalVariable(name: "dm", scope: !237, file: !2, line: 221, type: !238, align: 8)
!237 = distinct !DILexicalBlock(scope: !235, file: !2, line: 222, column: 2)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DynamicMethod*", baseType: !239, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicMethod", scope: !2, file: !2, line: 133, size: 192, align: 64, elements: !240, identifier: "std.core.machoruntime.DynamicMethod")
!240 = !{!241, !243, !244}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fn_ptr", scope: !239, file: !2, line: 135, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !239, file: !2, line: 136, baseType: !43, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !239, file: !2, line: 137, baseType: !245, size: 64, align: 64, offset: 128)
!245 = !DICompositeType(tag: DW_TAG_union_type, scope: !239, file: !2, line: 137, size: 64, align: 64, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !2, line: 139, baseType: !238, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !2, line: 140, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TypeId*", baseType: !250, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !2, file: !2, line: 206, size: 384, align: 64, elements: !251, identifier: "std.core.machoruntime.TypeId")
!251 = !{!252, !253, !254, !255, !256, !257, !258}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !250, file: !2, line: 208, baseType: !44, size: 8, align: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parentof", scope: !250, file: !2, line: 209, baseType: !249, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dtable", scope: !250, file: !2, line: 210, baseType: !238, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sizeof", scope: !250, file: !2, line: 211, baseType: !52, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !250, file: !2, line: 212, baseType: !249, size: 64, align: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !2, line: 213, baseType: !52, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "additional", scope: !250, file: !2, line: 214, baseType: !259, align: 64, offset: 384)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, align: 64, elements: !261)
!260 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!261 = !{!262}
!262 = !DISubrange(count: 0, lowerBound: 0)
!263 = !DILocalVariable(name: "type", scope: !264, file: !2, line: 223, type: !249, align: 8)
!264 = distinct !DILexicalBlock(scope: !237, file: !2, line: 222, column: 2)
!265 = !DILocalVariable(name: "m", scope: !264, file: !2, line: 226, type: !238, align: 8)
!266 = !DILocalVariable(name: ".temp", scope: !267, file: !2, line: 232, type: !52, align: 8)
!267 = distinct !DILexicalBlock(scope: !228, file: !2, line: 232, column: 2)
!268 = !DILocalVariable(name: "cb", scope: !269, file: !2, line: 232, type: !18, align: 8)
!269 = distinct !DILexicalBlock(scope: !267, file: !2, line: 233, column: 2)
!270 = !DILocalVariable(name: ".temp", scope: !271, file: !2, line: 236, type: !52, align: 8)
!271 = distinct !DILexicalBlock(scope: !228, file: !2, line: 236, column: 2)
!272 = !DILocalVariable(name: "cb", scope: !273, file: !2, line: 236, type: !18, align: 8)
!273 = distinct !DILexicalBlock(scope: !271, file: !2, line: 237, column: 2)
!274 = !DILocalVariable(name: "ctor", scope: !228, file: !2, line: 242, type: !18, align: 8)
!275 = !DILocalVariable(name: "mh", arg: 1, scope: !228, file: !2, line: 217, type: !88)
!276 = !DILocation(line: 217, column: 37, scope: !228)
!277 = !DILocalVariable(name: "vmaddr_slide", arg: 2, scope: !228, file: !2, line: 217, type: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !231)
!279 = !DILocation(line: 217, column: 45, scope: !228)
!280 = !DILocation(line: 219, column: 6, scope: !228)
!281 = !DILocation(line: 219, column: 13, scope: !228)
!282 = !DILocation(line: 220, column: 9, scope: !228)
!283 = !DILocation(line: 220, column: 34, scope: !228)
!284 = !DILocalVariable(name: "section", scope: !285, file: !2, line: 98, type: !133, align: 8)
!285 = distinct !DISubprogram(name: "find_segment_section_body", linkageName: "find_segment_section_body", scope: !2, file: !2, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36, retainedNodes: !286)
!286 = !{!284, !287}
!287 = !DILocalVariable(name: "ptr", scope: !285, file: !2, line: 103, type: !238, align: 8)
!288 = !DILocation(line: 98, column: 14, scope: !285, inlinedAt: !289)
!289 = !DILocation(line: 221, column: 17, scope: !235)
!290 = !DILocation(line: 98, column: 37, scope: !285, inlinedAt: !289)
!291 = !DILocation(line: 98, column: 24, scope: !285, inlinedAt: !289)
!292 = !DILocation(line: 99, column: 12, scope: !285, inlinedAt: !289)
!293 = !DILocation(line: 101, column: 10, scope: !294, inlinedAt: !289)
!294 = distinct !DILexicalBlock(scope: !285, file: !2, line: 100, column: 2)
!295 = !DILocation(line: 103, column: 9, scope: !285, inlinedAt: !289)
!296 = !DILocation(line: 103, column: 31, scope: !285, inlinedAt: !289)
!297 = !DILocation(line: 104, column: 9, scope: !285, inlinedAt: !289)
!298 = !DILocation(line: 104, column: 14, scope: !285, inlinedAt: !289)
!299 = !DILocation(line: 221, column: 12, scope: !237)
!300 = !DILocation(line: 221, column: 17, scope: !237)
!301 = !DILocation(line: 223, column: 11, scope: !264)
!302 = !DILocation(line: 223, column: 18, scope: !264)
!303 = !DILocation(line: 224, column: 13, scope: !264)
!304 = !DILocation(line: 224, column: 3, scope: !264)
!305 = !DILocation(line: 225, column: 3, scope: !264)
!306 = !DILocation(line: 226, column: 18, scope: !264)
!307 = !DILocation(line: 226, column: 22, scope: !264)
!308 = !DILocation(line: 227, column: 3, scope: !264)
!309 = !DILocation(line: 227, column: 10, scope: !310)
!310 = distinct !DILexicalBlock(scope: !264, file: !2, line: 227, column: 3)
!311 = !DILocation(line: 229, column: 8, scope: !312)
!312 = distinct !DILexicalBlock(scope: !310, file: !2, line: 228, column: 3)
