; ModuleID = 'std::os::posix'
source_filename = "std::os::posix"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.468 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any.470 = type { ptr, i64 }
%"char[].467" = type { ptr, i64 }
%File.471 = type { ptr }
%"any[].472" = type { ptr, i64 }

@"$ct.std.os.posix.Pthread_t" = linkonce global %.introspect.468 { i8 18, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.p$void" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.p$void" = linkonce global %.introspect.468 { i8 19, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.void" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.void" = linkonce global %.introspect.468 { i8 0, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.posix.Posix_spawn_file_actions_t" = linkonce global %.introspect.468 { i8 10, i64 0, ptr null, i64 80, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.posix.Posix_spawnattr_t" = linkonce global %.introspect.468 { i8 10, i64 0, ptr null, i64 336, i64 0, i64 1, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.posix.DIRPtr" = linkonce global %.introspect.468 { i8 18, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.p$void" to i64), i64 0, [0 x i64] zeroinitializer }, align 8

!391 = distinct !DILexicalBlock(scope: !183, file: !175, line: 914, column: 13)
!392 = !DILocation(line: 915, column: 36, scope: !393, inlinedAt: !177)
!393 = distinct !DILexicalBlock(scope: !183, file: !175, line: 915, column: 13)
!394 = !DILocation(line: 916, column: 36, scope: !395, inlinedAt: !177)
!395 = distinct !DILexicalBlock(scope: !183, file: !175, line: 916, column: 13)
!396 = !DILocation(line: 917, column: 36, scope: !397, inlinedAt: !177)
!397 = distinct !DILexicalBlock(scope: !183, file: !175, line: 917, column: 13)
!398 = !DILocation(line: 918, column: 36, scope: !399, inlinedAt: !177)
!399 = distinct !DILexicalBlock(scope: !183, file: !175, line: 918, column: 13)
!400 = !DILocation(line: 919, column: 36, scope: !401, inlinedAt: !177)
!401 = distinct !DILexicalBlock(scope: !183, file: !175, line: 919, column: 13)
!402 = !DILocation(line: 920, column: 36, scope: !403, inlinedAt: !177)
!403 = distinct !DILexicalBlock(scope: !183, file: !175, line: 920, column: 13)
!404 = !DILocation(line: 921, column: 36, scope: !405, inlinedAt: !177)
!405 = distinct !DILexicalBlock(scope: !183, file: !175, line: 921, column: 13)
!406 = !DILocation(line: 922, column: 36, scope: !407, inlinedAt: !177)
!407 = distinct !DILexicalBlock(scope: !183, file: !175, line: 922, column: 13)
!408 = !DILocation(line: 923, column: 36, scope: !409, inlinedAt: !177)
!409 = distinct !DILexicalBlock(scope: !183, file: !175, line: 923, column: 13)
!410 = !DILocation(line: 924, column: 36, scope: !411, inlinedAt: !177)
!411 = distinct !DILexicalBlock(scope: !183, file: !175, line: 924, column: 13)
!412 = !DILocation(line: 925, column: 36, scope: !413, inlinedAt: !177)
!413 = distinct !DILexicalBlock(scope: !183, file: !175, line: 925, column: 13)
!414 = !DILocation(line: 926, column: 36, scope: !415, inlinedAt: !177)
!415 = distinct !DILexicalBlock(scope: !183, file: !175, line: 926, column: 13)
!416 = !DILocation(line: 927, column: 36, scope: !417, inlinedAt: !177)
!417 = distinct !DILexicalBlock(scope: !183, file: !175, line: 927, column: 13)
!418 = !DILocation(line: 928, column: 36, scope: !419, inlinedAt: !177)
!419 = distinct !DILexicalBlock(scope: !183, file: !175, line: 928, column: 13)
!420 = !DILocation(line: 929, column: 36, scope: !421, inlinedAt: !177)
!421 = distinct !DILexicalBlock(scope: !183, file: !175, line: 929, column: 13)
!422 = !DILocation(line: 930, column: 36, scope: !423, inlinedAt: !177)
!423 = distinct !DILexicalBlock(scope: !183, file: !175, line: 930, column: 13)
!424 = !DILocation(line: 931, column: 36, scope: !425, inlinedAt: !177)
!425 = distinct !DILexicalBlock(scope: !183, file: !175, line: 931, column: 13)
!426 = !DILocation(line: 932, column: 36, scope: !427, inlinedAt: !177)
!427 = distinct !DILexicalBlock(scope: !183, file: !175, line: 932, column: 13)
!428 = !DILocation(line: 933, column: 36, scope: !429, inlinedAt: !177)
!429 = distinct !DILexicalBlock(scope: !183, file: !175, line: 933, column: 13)
!430 = !DILocation(line: 934, column: 36, scope: !431, inlinedAt: !177)
!431 = distinct !DILexicalBlock(scope: !183, file: !175, line: 934, column: 13)
!432 = !DILocation(line: 935, column: 36, scope: !433, inlinedAt: !177)
!433 = distinct !DILexicalBlock(scope: !183, file: !175, line: 935, column: 13)
!434 = !DILocation(line: 936, column: 36, scope: !435, inlinedAt: !177)
!435 = distinct !DILexicalBlock(scope: !183, file: !175, line: 936, column: 13)
!436 = !DILocation(line: 937, column: 36, scope: !437, inlinedAt: !177)
!437 = distinct !DILexicalBlock(scope: !183, file: !175, line: 937, column: 13)
!438 = !DILocation(line: 938, column: 36, scope: !439, inlinedAt: !177)
!439 = distinct !DILexicalBlock(scope: !183, file: !175, line: 938, column: 13)
!440 = !DILocation(line: 246, column: 2, scope: !441, inlinedAt: !442)
!441 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !175, file: !175, line: 241, scopeLine: 241, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !110)
!442 = !DILocation(line: 939, column: 12, scope: !443, inlinedAt: !177)
!443 = distinct !DILexicalBlock(scope: !183, file: !175, line: 939, column: 12)
!444 = !DILocation(line: 90, column: 3, scope: !171)
!445 = !DILocation(line: 90, column: 10, scope: !171)
!446 = !DILocation(line: 91, column: 8, scope: !171)
!447 = !DILocation(line: 91, column: 15, scope: !171)
!448 = !DILocation(line: 91, column: 19, scope: !171)
!449 = !DILocation(line: 87, column: 24, scope: !168)
!450 = !DILocation(line: 93, column: 29, scope: !112)
!451 = !DILocation(line: 93, column: 2, scope: !112)
!452 = !DILocation(line: 94, column: 30, scope: !112)
!453 = !DILocation(line: 94, column: 2, scope: !112)
!454 = !DILocation(line: 95, column: 29, scope: !112)
!455 = !DILocation(line: 95, column: 2, scope: !112)
!456 = !DILocation(line: 96, column: 9, scope: !112)
!457 = distinct !DISubprogram(name: "std::os::posix.backtrace$lambda1", linkageName: "std::os::posix.backtrace$lambda1", scope: !10, file: !10, line: 78, type: !125, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !458)
!458 = !{}
!459 = !DILocalVariable(name: ".anon", arg: 1, scope: !457, file: !10, line: 78, type: !9)
!460 = !DILocation(line: 78, column: 45, scope: !457)
!461 = !DILocation(line: 79, column: 3, scope: !457)
!462 = distinct !DISubprogram(name: "xdg_user_dir_lookup", linkageName: "std.os.posix.xdg_user_dir_lookup", scope: !463, file: !463, line: 4, type: !464, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !477)
!463 = !DIFile(filename: "xdg.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/os")
!464 = !DISubroutineType(types: !465)
!465 = !{!466, !471, !476}
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !467, identifier: "char[]")
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !466, baseType: !5, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !466, baseType: !470, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !472, identifier: "Allocator")
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !471, baseType: !93, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !471, baseType: !475, size: 64, align: 64, offset: 64)
!475 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !466)
!477 = !{!478, !480, !481, !482, !487, !489}
!478 = !DILocalVariable(name: "home", scope: !479, file: !463, line: 6, type: !476, align: 8)
!479 = distinct !DILexicalBlock(scope: !462, file: !463, line: 5, column: 1)
!480 = !DILocalVariable(name: "config_file", scope: !479, file: !463, line: 7, type: !476, align: 8)
!481 = !DILocalVariable(name: "config_home", scope: !479, file: !463, line: 8, type: !476, align: 8)
!482 = !DILocalVariable(name: "f", scope: !479, file: !463, line: 16, type: !483, align: 8)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !463, file: !463, line: 4, size: 64, align: 64, elements: !484, identifier: "std.io.File")
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !483, file: !463, line: 6, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !463, file: !463, line: 368, baseType: !93, align: 8)
!487 = !DILocalVariable(name: "line", scope: !488, file: !463, line: 18, type: !476, align: 8)
!488 = distinct !DILexicalBlock(scope: !479, file: !463, line: 18, column: 2)
!489 = !DILocalVariable(name: "relative", scope: !490, file: !463, line: 32, type: !72, align: 1)
!490 = distinct !DILexicalBlock(scope: !488, file: !463, line: 19, column: 2)
!491 = !DILocalVariable(name: "allocator", arg: 1, scope: !462, file: !463, line: 4, type: !471)
!492 = !DILocation(line: 4, column: 42, scope: !462)
!493 = !DILocalVariable(name: "type", arg: 2, scope: !462, file: !463, line: 4, type: !476)
!494 = !DILocation(line: 4, column: 60, scope: !462)
!495 = !DILocalVariable(name: "state", scope: !496, file: !463, line: 648, type: !499, align: 8)
!496 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !497, file: !497, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !110, retainedNodes: !498)
!497 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!498 = !{!495}
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !463, file: !463, line: 420, baseType: !500, align: 8)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !501, size: 64, align: 64, dwarfAddressSpace: 0)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !463, file: !463, line: 31, size: 704, align: 64, elements: !502, identifier: "std.core.mem.allocator.TempAllocator")
!502 = !{!503, !504, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !501, file: !463, line: 33, baseType: !471, size: 128, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !501, file: !463, line: 34, baseType: !505, size: 64, align: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !506, size: 64, align: 64, dwarfAddressSpace: 0)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !463, file: !463, line: 54, size: 256, align: 64, elements: !507, identifier: "std.core.mem.allocator.TempAllocatorPage")
!507 = !{!508, !509, !510, !511, !512}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !506, file: !463, line: 56, baseType: !505, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !506, file: !463, line: 57, baseType: !93, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !463, line: 58, baseType: !470, size: 64, align: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !506, file: !463, line: 59, baseType: !470, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !506, file: !463, line: 60, baseType: !513, align: 8, offset: 256)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, align: 8, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 0, lowerBound: 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !501, file: !463, line: 35, baseType: !500, size: 64, align: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !501, file: !463, line: 36, baseType: !72, size: 8, align: 8, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !501, file: !463, line: 37, baseType: !470, size: 64, align: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !501, file: !463, line: 38, baseType: !470, size: 64, align: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !501, file: !463, line: 39, baseType: !470, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !501, file: !463, line: 40, baseType: !470, size: 64, align: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !501, file: !463, line: 41, baseType: !470, size: 64, align: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !501, file: !463, line: 42, baseType: !470, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !463, line: 43, baseType: !513, align: 8, offset: 704)
!525 = !DILocation(line: 648, column: 12, scope: !496, inlinedAt: !526)
!526 = !DILocation(line: 4, column: 69, scope: !462)
!527 = !DILocation(line: 648, column: 20, scope: !496, inlinedAt: !526)
!528 = !DILocation(line: 6, column: 9, scope: !479)
!529 = !DILocation(line: 6, column: 16, scope: !479)
!530 = !DILocation(line: 651, column: 23, scope: !531, inlinedAt: !526)
!531 = distinct !DILexicalBlock(scope: !496, file: !497, line: 650, column: 2)
!532 = !DILocation(line: 651, column: 3, scope: !531, inlinedAt: !526)
!533 = !DILocation(line: 7, column: 9, scope: !479)
!534 = !DILocation(line: 8, column: 17, scope: !479)
!535 = !DILocation(line: 8, column: 31, scope: !479)
!536 = !DILocation(line: 8, column: 67, scope: !479)
!537 = !DILocation(line: 10, column: 37, scope: !538)
!538 = distinct !DILexicalBlock(scope: !479, file: !463, line: 9, column: 2)
!539 = !DILocation(line: 10, column: 17, scope: !538)
!540 = !DILocation(line: 14, column: 30, scope: !541)
!541 = distinct !DILexicalBlock(scope: !479, file: !463, line: 13, column: 2)
!542 = !DILocation(line: 14, column: 17, scope: !541)
!543 = !DILocation(line: 16, column: 7, scope: !479)
!544 = !DILocation(line: 16, column: 11, scope: !479)
!545 = !DILocation(line: 651, column: 23, scope: !546, inlinedAt: !526)
!546 = distinct !DILexicalBlock(scope: !496, file: !497, line: 650, column: 2)
!547 = !DILocation(line: 651, column: 3, scope: !546, inlinedAt: !526)
!548 = !DILocation(line: 18, column: 2, scope: !479)
!549 = !DILocation(line: 18, column: 13, scope: !488)
!550 = !DILocation(line: 86, column: 18, scope: !551, inlinedAt: !553)
!551 = distinct !DISubprogram(name: "treadline", linkageName: "treadline", scope: !552, file: !552, line: 84, scopeLine: 84, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !110)
!552 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io")
!553 = !DILocation(line: 18, column: 20, scope: !488)
!554 = !DILocation(line: 61, column: 6, scope: !555, inlinedAt: !564)
!555 = distinct !DISubprogram(name: "readline", linkageName: "readline", scope: !552, file: !552, line: 59, scopeLine: 59, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !110, retainedNodes: !556)
!556 = !{!557, !562}
!557 = !DILocalVariable(name: "str", scope: !558, file: !463, line: 63, type: !559, align: 8)
!558 = distinct !DILexicalBlock(scope: !555, file: !552, line: 62, column: 2)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !463, file: !463, line: 7, baseType: !560, align: 8)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !561, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !463, file: !463, line: 8, baseType: null, align: 1)
!562 = !DILocalVariable(name: "str", scope: !563, file: !463, line: 69, type: !559, align: 8)
!563 = distinct !DILexicalBlock(scope: !555, file: !552, line: 68, column: 2)
!564 = !DILocation(line: 86, column: 9, scope: !551, inlinedAt: !553)
!565 = !DILocation(line: 61, column: 19, scope: !555, inlinedAt: !564)
!566 = !DILocation(line: 63, column: 11, scope: !558, inlinedAt: !564)
!567 = !DILocation(line: 63, column: 17, scope: !558, inlinedAt: !564)
!568 = !DILocalVariable(name: "val", scope: !569, file: !463, line: 107, type: !6, align: 1)
!569 = distinct !DISubprogram(name: "readline_to_stream", linkageName: "readline_to_stream", scope: !552, file: !552, line: 100, scopeLine: 100, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !110, retainedNodes: !570)
!570 = !{!568, !571, !572, !575}
!571 = !DILocalVariable(name: "len", scope: !569, file: !463, line: 115, type: !470, align: 8)
!572 = !DILocalVariable(name: "c", scope: !573, file: !463, line: 130, type: !6, align: 1)
!573 = distinct !DILexicalBlock(scope: !574, file: !552, line: 126, column: 2)
