; ModuleID = 'std::net::url'
source_filename = "std::net::url"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.97 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].96" = type { ptr, i64 }
%any.99 = type { ptr, i64 }
%OnStackAllocator = type { %any.99, %"char[].96", i64, ptr }
%"any[].101" = type { ptr, i64 }
%List.100 = type { i64, i64, %any.99, ptr }
%"char[][]" = type { ptr, i64 }
%HashMap = type { %"Entry*[]", %any.99, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }
%Url = type { %"char[].96", %"char[].96", i32, %"char[].96", %"char[].96", %"char[].96", %"char[].96", %"char[].96", %any.99 }
%UrlQueryValues = type { %HashMap, %List.100 }
%Splitter = type { %"char[].96", %"char[].96", i64, i32, i32 }

@.enum.UNRESERVED = internal constant [11 x i8] c"UNRESERVED\00", align 1
@.enum.PATH = internal constant [5 x i8] c"PATH\00", align 1
@.enum.HOST = internal constant [5 x i8] c"HOST\00", align 1
@.enum.USERPASS = internal constant [9 x i8] c"USERPASS\00", align 1
@.enum.QUERY = internal constant [6 x i8] c"QUERY\00", align 1
@.enum.FRAGMENT = internal constant [9 x i8] c"FRAGMENT\00", align 1
@"$ct.char" = linkonce global %.introspect.97 { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "url_encoding.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/net")
!8 = !{!9, !18}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UrlEncodingMode", scope: !7, file: !7, line: 8, baseType: !10, size: 8, align: 8, elements: !11)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DIEnumerator(name: "UNRESERVED", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "PATH", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "HOST", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "USERPASS", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "QUERY", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "FRAGMENT", value: 5, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SplitterType", scope: !20, file: !19, line: 1167, baseType: !35, size: 32, align: 32, elements: !36)
!19 = !DIFile(filename: "url.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/net")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Splitter", scope: !19, file: !19, line: 1177, size: 384, align: 64, elements: !21, identifier: "std.core.string.Splitter")
!21 = !{!22, !31, !32, !33, !34}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !20, file: !19, line: 1179, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !30)
!30 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !20, file: !19, line: 1180, baseType: !23, size: 128, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !20, file: !19, line: 1181, baseType: !29, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !19, line: 1182, baseType: !18, size: 32, align: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last_index", scope: !20, file: !19, line: 1183, baseType: !35, size: 32, align: 32, offset: 352)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "TOKENIZE", value: 0)
!38 = !DIEnumerator(name: "TOKENIZE_ALL", value: 1)
!39 = !DIEnumerator(name: "TOKENIZE_ALL_SKIP_LAST", value: 2)
!40 = distinct !DISubprogram(name: "should_encode", linkageName: "std.net.url.should_encode", scope: !7, file: !7, line: 26, type: !41, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !44)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !10, !9}
!43 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!44 = !{}
!45 = !DILocalVariable(name: "c", arg: 1, scope: !40, file: !7, line: 26, type: !10)
!46 = !DILocation(line: 26, column: 28, scope: !40)
!47 = !DILocalVariable(name: "mode", arg: 2, scope: !40, file: !7, line: 26, type: !9)
!48 = !DILocation(line: 26, column: 47, scope: !40)
!49 = !DILocation(line: 17, column: 42, scope: !50, inlinedAt: !52)
!50 = distinct !DISubprogram(name: "@is_alnum", linkageName: "@is_alnum", scope: !51, file: !51, line: 17, scopeLine: 17, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!51 = !DIFile(filename: "ascii.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!52 = !DILocation(line: 52, column: 38, scope: !53, inlinedAt: !54)
!53 = distinct !DISubprogram(name: "is_alnum", linkageName: "is_alnum", scope: !51, file: !51, line: 52, scopeLine: 52, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!54 = !DILocation(line: 29, column: 6, scope: !40)
!55 = !DILocation(line: 29, column: 27, scope: !40)
!56 = !DILocation(line: 32, column: 10, scope: !40)
!57 = !DILocation(line: 32, column: 70, scope: !40)
!58 = !DILocation(line: 35, column: 10, scope: !40)
!59 = !DILocation(line: 35, column: 48, scope: !40)
!60 = !DILocation(line: 38, column: 9, scope: !40)
!61 = distinct !DISubprogram(name: "encode_len", linkageName: "std.net.url.encode_len", scope: !7, file: !7, line: 44, type: !62, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !64)
!62 = !DISubroutineType(types: !63)
!63 = !{!29, !23, !9}
!64 = !{!65, !66, !68}
!65 = !DILocalVariable(name: "n", scope: !61, file: !7, line: 46, type: !29, align: 8)
!66 = !DILocalVariable(name: ".temp", scope: !67, file: !7, line: 47, type: !29, align: 8)
!67 = distinct !DILexicalBlock(scope: !61, file: !7, line: 47, column: 2)
!68 = !DILocalVariable(name: "c", scope: !69, file: !7, line: 47, type: !10, align: 1)
!69 = distinct !DILexicalBlock(scope: !67, file: !7, line: 48, column: 2)
!70 = !DILocalVariable(name: "s", arg: 1, scope: !61, file: !7, line: 44, type: !23)
!71 = !DILocation(line: 44, column: 26, scope: !61)
!72 = !DILocalVariable(name: "mode", arg: 2, scope: !61, file: !7, line: 44, type: !9)
!73 = !DILocation(line: 44, column: 45, scope: !61)
!74 = !DILocation(line: 46, column: 6, scope: !61)
!75 = !DILocation(line: 47, column: 14, scope: !67)
!76 = !DILocation(line: 47, column: 11, scope: !69)
!77 = !DILocation(line: 47, column: 14, scope: !69)
!78 = !DILocation(line: 49, column: 25, scope: !79)
!79 = distinct !DILexicalBlock(scope: !69, file: !7, line: 48, column: 2)
!80 = !DILocation(line: 49, column: 8, scope: !79)
!81 = !DILocation(line: 49, column: 32, scope: !79)
!82 = !DILocation(line: 50, column: 7, scope: !79)
!83 = !DILocation(line: 50, column: 19, scope: !79)
!84 = !DILocation(line: 52, column: 4, scope: !85)
!85 = distinct !DILexicalBlock(scope: !79, file: !7, line: 51, column: 3)
!86 = !DILocation(line: 55, column: 9, scope: !61)
!87 = !DILocation(line: 55, column: 21, scope: !61)
!88 = !DILocation(line: 55, column: 17, scope: !61)
!89 = distinct !DISubprogram(name: "encode", linkageName: "std.net.url.encode", scope: !7, file: !7, line: 67, type: !90, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !98)
!90 = !DISubroutineType(types: !91)
!91 = !{!23, !92, !23, !9}
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !93, identifier: "Allocator")
!93 = !{!94, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !92, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!98 = !{!99, !101, !105, !107, !109, !110}
!99 = !DILocalVariable(name: "n", scope: !100, file: !7, line: 69, type: !29, align: 8)
!100 = distinct !DILexicalBlock(scope: !89, file: !7, line: 68, column: 1)
!101 = !DILocalVariable(name: "builder", scope: !100, file: !7, line: 70, type: !102, align: 8)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !7, file: !7, line: 7, baseType: !103, align: 8)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !7, file: !7, line: 8, baseType: null, align: 1)
!105 = !DILocalVariable(name: ".temp", scope: !106, file: !7, line: 72, type: !29, align: 8)
!106 = distinct !DILexicalBlock(scope: !100, file: !7, line: 72, column: 2)
!107 = !DILocalVariable(name: "i", scope: !108, file: !7, line: 72, type: !29, align: 8)
!108 = distinct !DILexicalBlock(scope: !106, file: !7, line: 73, column: 2)
!109 = !DILocalVariable(name: "c", scope: !108, file: !7, line: 72, type: !10, align: 1)
!110 = !DILocalVariable(name: "hex", scope: !111, file: !7, line: 83, type: !23, align: 8)
!111 = distinct !DILexicalBlock(scope: !112, file: !7, line: 82, column: 5)
!112 = distinct !DILexicalBlock(scope: !113, file: !7, line: 74, column: 3)
!113 = distinct !DILexicalBlock(scope: !108, file: !7, line: 73, column: 2)
!114 = !DILocalVariable(name: "allocator", arg: 1, scope: !89, file: !7, line: 67, type: !92)
!115 = !DILocation(line: 67, column: 28, scope: !89)
!116 = !DILocalVariable(name: "s", arg: 2, scope: !89, file: !7, line: 67, type: !23)
!117 = !DILocation(line: 67, column: 46, scope: !89)
!118 = !DILocalVariable(name: "mode", arg: 3, scope: !89, file: !7, line: 67, type: !9)
!119 = !DILocation(line: 67, column: 65, scope: !89)
!120 = !DILocalVariable(name: "state", scope: !121, file: !7, line: 648, type: !124, align: 8)
!121 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !122, file: !122, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !123)
!122 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!123 = !{!120}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 420, baseType: !125, align: 8)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !126, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !127, identifier: "std.core.mem.allocator.TempAllocator")
!127 = !{!128, !129, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !126, file: !7, line: 33, baseType: !92, size: 128, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !126, file: !7, line: 34, baseType: !130, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !132, identifier: "std.core.mem.allocator.TempAllocatorPage")
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !131, file: !7, line: 56, baseType: !130, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !131, file: !7, line: 57, baseType: !95, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !131, file: !7, line: 58, baseType: !29, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !131, file: !7, line: 59, baseType: !29, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !7, line: 60, baseType: !138, align: 8, offset: 256)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, align: 8, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 0, lowerBound: 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !126, file: !7, line: 35, baseType: !125, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !126, file: !7, line: 36, baseType: !43, size: 8, align: 8, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !126, file: !7, line: 37, baseType: !29, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !126, file: !7, line: 38, baseType: !29, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !126, file: !7, line: 39, baseType: !29, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !126, file: !7, line: 40, baseType: !29, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !126, file: !7, line: 41, baseType: !29, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !126, file: !7, line: 42, baseType: !29, size: 64, align: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !7, line: 43, baseType: !138, align: 8, offset: 704)
!150 = !DILocation(line: 648, column: 12, scope: !121, inlinedAt: !151)
!151 = !DILocation(line: 67, column: 74, scope: !89)
!152 = !DILocation(line: 648, column: 20, scope: !121, inlinedAt: !151)
!153 = !DILocation(line: 69, column: 6, scope: !100)
!154 = !DILocation(line: 69, column: 24, scope: !100)
!155 = !DILocation(line: 69, column: 10, scope: !100)
!156 = !DILocation(line: 70, column: 10, scope: !100)
!157 = !DILocation(line: 70, column: 48, scope: !100)
!158 = !DILocation(line: 70, column: 20, scope: !100)
!159 = !DILocation(line: 72, column: 16, scope: !106)
!160 = !DILocation(line: 72, column: 10, scope: !106)
!161 = !DILocation(line: 72, column: 10, scope: !108)
!162 = !DILocation(line: 72, column: 13, scope: !108)
!163 = !DILocation(line: 72, column: 16, scope: !108)
!164 = !DILocation(line: 77, column: 9, scope: !112)
!165 = !DILocation(line: 77, column: 21, scope: !112)
!166 = !DILocation(line: 78, column: 5, scope: !167)
!167 = distinct !DILexicalBlock(scope: !112, file: !7, line: 78, column: 5)
!168 = !DILocation(line: 81, column: 26, scope: !112)
!169 = !DILocation(line: 81, column: 9, scope: !112)
!170 = !DILocation(line: 82, column: 5, scope: !111)
!171 = !DILocation(line: 83, column: 12, scope: !111)
!172 = !DILocation(line: 83, column: 31, scope: !111)
!173 = !DILocation(line: 83, column: 33, scope: !111)
!174 = !DILocation(line: 83, column: 18, scope: !111)
!175 = !DILocation(line: 84, column: 20, scope: !111)
!176 = !DILocation(line: 395, column: 27, scope: !177, inlinedAt: !180)
!177 = distinct !DILexicalBlock(scope: !179, file: !178, line: 396, column: 1)
!178 = !DIFile(filename: "dstring.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!179 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !178, file: !178, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!180 = !DILocation(line: 84, column: 5, scope: !111)
!181 = !DILocation(line: 405, column: 22, scope: !179, inlinedAt: !180)
!182 = !DILocation(line: 405, column: 4, scope: !179, inlinedAt: !180)
!183 = !DILocation(line: 88, column: 25, scope: !184)
!184 = distinct !DILexicalBlock(scope: !112, file: !7, line: 88, column: 5)
!185 = !DILocation(line: 88, column: 5, scope: !184)
!186 = !DILocation(line: 92, column: 26, scope: !100)
!187 = !DILocation(line: 92, column: 9, scope: !100)
!188 = !DILocation(line: 651, column: 23, scope: !189, inlinedAt: !151)
!189 = distinct !DILexicalBlock(scope: !121, file: !122, line: 650, column: 2)
!190 = !DILocation(line: 651, column: 3, scope: !189, inlinedAt: !151)
!191 = distinct !DISubprogram(name: "tencode", linkageName: "std.net.url.tencode", scope: !7, file: !7, line: 103, type: !192, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !44)
!192 = !DISubroutineType(types: !193)
!193 = !{!23, !23, !9}
!194 = !DILocalVariable(name: "s", arg: 1, scope: !191, file: !7, line: 103, type: !23)
!195 = !DILocation(line: 103, column: 26, scope: !191)
!196 = !DILocalVariable(name: "mode", arg: 2, scope: !191, file: !7, line: 103, type: !9)
!197 = !DILocation(line: 103, column: 45, scope: !191)
!198 = !DILocation(line: 103, column: 61, scope: !191)
!199 = !DILocation(line: 103, column: 70, scope: !191)
!200 = !DILocation(line: 103, column: 54, scope: !191)
!201 = distinct !DISubprogram(name: "decode_len", linkageName: "std.net.url.decode_len", scope: !7, file: !7, line: 110, type: !202, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !204)
!202 = !DISubroutineType(types: !203)
!203 = !{!30, !23, !9}
!204 = !{!205, !206, !208, !210}
!205 = !DILocalVariable(name: "n", scope: !201, file: !7, line: 112, type: !29, align: 8)
!206 = !DILocalVariable(name: ".temp", scope: !207, file: !7, line: 113, type: !29, align: 8)
!207 = distinct !DILexicalBlock(scope: !201, file: !7, line: 113, column: 2)
!208 = !DILocalVariable(name: "i", scope: !209, file: !7, line: 113, type: !29, align: 8)
!209 = distinct !DILexicalBlock(scope: !207, file: !7, line: 114, column: 2)
!210 = !DILocalVariable(name: "c", scope: !209, file: !7, line: 113, type: !10, align: 1)
!211 = !DILocalVariable(name: "s", arg: 1, scope: !201, file: !7, line: 110, type: !23)
!212 = !DILocation(line: 110, column: 27, scope: !201)
!213 = !DILocalVariable(name: "mode", arg: 2, scope: !201, file: !7, line: 110, type: !9)
!214 = !DILocation(line: 110, column: 46, scope: !201)
!215 = !DILocation(line: 112, column: 6, scope: !201)
!216 = !DILocation(line: 113, column: 17, scope: !207)
!217 = !DILocation(line: 113, column: 11, scope: !207)
!218 = !DILocation(line: 113, column: 11, scope: !209)
!219 = !DILocation(line: 113, column: 14, scope: !209)
!220 = !DILocation(line: 113, column: 17, scope: !209)
!221 = !DILocation(line: 115, column: 7, scope: !222)
!222 = distinct !DILexicalBlock(scope: !209, file: !7, line: 114, column: 2)
!223 = !DILocation(line: 115, column: 17, scope: !222)
!224 = !DILocation(line: 116, column: 7, scope: !222)
!225 = !DILocation(line: 116, column: 16, scope: !222)
!226 = !DILocation(line: 116, column: 26, scope: !222)
!227 = !DILocation(line: 116, column: 28, scope: !222)
!228 = !DILocation(line: 12, column: 42, scope: !229, inlinedAt: !230)
!229 = distinct !DISubprogram(name: "@is_xdigit", linkageName: "@is_xdigit", scope: !51, file: !51, line: 12, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!230 = !DILocation(line: 47, column: 38, scope: !231, inlinedAt: !226)
!231 = distinct !DISubprogram(name: "is_xdigit", linkageName: "is_xdigit", scope: !51, file: !51, line: 47, scopeLine: 47, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!232 = !DILocation(line: 116, column: 49, scope: !222)
!233 = !DILocation(line: 116, column: 51, scope: !222)
!234 = !DILocation(line: 12, column: 42, scope: !235, inlinedAt: !236)
!235 = distinct !DISubprogram(name: "@is_xdigit", linkageName: "@is_xdigit", scope: !51, file: !51, line: 12, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!236 = !DILocation(line: 47, column: 38, scope: !237, inlinedAt: !232)
!237 = distinct !DISubprogram(name: "is_xdigit", linkageName: "is_xdigit", scope: !51, file: !51, line: 47, scopeLine: 47, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!238 = !DILocation(line: 118, column: 11, scope: !239)
!239 = distinct !DILexicalBlock(scope: !222, file: !7, line: 117, column: 3)
!240 = !DILocation(line: 120, column: 3, scope: !222)
!241 = !DILocation(line: 122, column: 9, scope: !201)
!242 = !DILocation(line: 122, column: 21, scope: !201)
!243 = !DILocation(line: 122, column: 17, scope: !201)
!244 = distinct !DISubprogram(name: "decode", linkageName: "std.net.url.decode", scope: !7, file: !7, line: 134, type: !245, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !247)
!245 = !DISubroutineType(types: !246)
!246 = !{!24, !92, !23, !9}
!247 = !{!248, !250, !251, !253}
!248 = !DILocalVariable(name: "n", scope: !249, file: !7, line: 136, type: !29, align: 8)
!249 = distinct !DILexicalBlock(scope: !244, file: !7, line: 135, column: 1)
!250 = !DILocalVariable(name: "builder", scope: !249, file: !7, line: 137, type: !102, align: 8)
!251 = !DILocalVariable(name: "i", scope: !252, file: !7, line: 139, type: !29, align: 8)
!252 = distinct !DILexicalBlock(scope: !249, file: !7, line: 139, column: 2)
!253 = !DILocalVariable(name: "hex", scope: !254, file: !7, line: 145, type: !24, align: 8)
!254 = distinct !DILexicalBlock(scope: !255, file: !7, line: 145, column: 5)
!255 = distinct !DILexicalBlock(scope: !256, file: !7, line: 141, column: 3)
!256 = distinct !DILexicalBlock(scope: !252, file: !7, line: 140, column: 2)
!257 = !DILocalVariable(name: "allocator", arg: 1, scope: !244, file: !7, line: 134, type: !92)
!258 = !DILocation(line: 134, column: 29, scope: !244)
!259 = !DILocalVariable(name: "s", arg: 2, scope: !244, file: !7, line: 134, type: !23)
!260 = !DILocation(line: 134, column: 47, scope: !244)
!261 = !DILocalVariable(name: "mode", arg: 3, scope: !244, file: !7, line: 134, type: !9)
!262 = !DILocation(line: 134, column: 67, scope: !244)
!263 = !DILocalVariable(name: "state", scope: !264, file: !7, line: 648, type: !124, align: 8)
!264 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !122, file: !122, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !265)
!265 = !{!263}
!266 = !DILocation(line: 648, column: 12, scope: !264, inlinedAt: !267)
!267 = !DILocation(line: 134, column: 76, scope: !244)
!268 = !DILocation(line: 648, column: 20, scope: !264, inlinedAt: !267)
!269 = !DILocation(line: 136, column: 6, scope: !249)
!270 = !DILocation(line: 136, column: 10, scope: !249)
!271 = !DILocation(line: 651, column: 23, scope: !272, inlinedAt: !267)
!272 = distinct !DILexicalBlock(scope: !264, file: !122, line: 650, column: 2)
!273 = !DILocation(line: 651, column: 3, scope: !272, inlinedAt: !267)
!274 = !DILocation(line: 137, column: 10, scope: !249)
!275 = !DILocation(line: 137, column: 48, scope: !249)
!276 = !DILocation(line: 137, column: 20, scope: !249)
!277 = !DILocation(line: 139, column: 11, scope: !252)
!278 = !DILocation(line: 139, column: 15, scope: !252)
!279 = !DILocation(line: 139, column: 18, scope: !252)
!280 = !DILocation(line: 139, column: 22, scope: !252)
!281 = !DILocation(line: 141, column: 11, scope: !255)
!282 = !DILocation(line: 141, column: 13, scope: !255)
!283 = !DILocation(line: 145, column: 12, scope: !254)
!284 = !DILocation(line: 145, column: 31, scope: !254)
!285 = !DILocation(line: 145, column: 33, scope: !254)
!286 = !DILocation(line: 145, column: 18, scope: !254)
!287 = !DILocation(line: 651, column: 23, scope: !288, inlinedAt: !267)
!288 = distinct !DILexicalBlock(scope: !264, file: !122, line: 650, column: 2)
!289 = !DILocation(line: 651, column: 3, scope: !288, inlinedAt: !267)
!290 = !DILocation(line: 395, column: 27, scope: !291, inlinedAt: !293)
!291 = distinct !DILexicalBlock(scope: !292, file: !178, line: 396, column: 1)
!292 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !178, file: !178, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!293 = !DILocation(line: 146, column: 5, scope: !254)
!294 = !DILocation(line: 413, column: 24, scope: !292, inlinedAt: !293)
!295 = !DILocation(line: 413, column: 6, scope: !292, inlinedAt: !293)
!296 = !DILocation(line: 147, column: 5, scope: !254)
!297 = !DILocation(line: 151, column: 26, scope: !298)
!298 = distinct !DILexicalBlock(scope: !255, file: !7, line: 151, column: 5)
!299 = !DILocation(line: 151, column: 49, scope: !298)
!300 = !DILocation(line: 151, column: 5, scope: !298)
!301 = !DILocation(line: 155, column: 25, scope: !302)
!302 = distinct !DILexicalBlock(scope: !255, file: !7, line: 155, column: 5)
!303 = !DILocation(line: 155, column: 27, scope: !302)
!304 = !DILocation(line: 155, column: 5, scope: !302)
!305 = !DILocation(line: 139, column: 29, scope: !252)
!306 = !DILocation(line: 159, column: 26, scope: !249)
!307 = !DILocation(line: 159, column: 9, scope: !249)
!308 = !DILocation(line: 651, column: 23, scope: !309, inlinedAt: !267)
!309 = distinct !DILexicalBlock(scope: !264, file: !122, line: 650, column: 2)
!310 = !DILocation(line: 651, column: 3, scope: !309, inlinedAt: !267)
!311 = distinct !DISubprogram(name: "tdecode", linkageName: "std.net.url.tdecode", scope: !7, file: !7, line: 170, type: !312, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !44)
!312 = !DISubroutineType(types: !313)
!313 = !{!24, !23, !9}
!314 = !DILocalVariable(name: "s", arg: 1, scope: !311, file: !7, line: 170, type: !23)
!315 = !DILocation(line: 170, column: 27, scope: !311)
!316 = !DILocalVariable(name: "mode", arg: 2, scope: !311, file: !7, line: 170, type: !9)
!317 = !DILocation(line: 170, column: 47, scope: !311)
!318 = !DILocation(line: 170, column: 63, scope: !311)
!319 = !DILocation(line: 170, column: 56, scope: !311)
!320 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.url.Url.to_format", scope: !19, file: !19, line: 171, type: !321, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !354)
!321 = !DISubroutineType(types: !322)
!322 = !{!30, !323, !336}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Url*", baseType: !324, size: 64, align: 64, dwarfAddressSpace: 0)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "Url", scope: !19, file: !19, line: 29, size: 1088, align: 64, elements: !325, identifier: "std.net.url.Url")
!325 = !{!326, !327, !328, !330, !331, !332, !333, !334, !335}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !324, file: !19, line: 31, baseType: !23, size: 128, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !324, file: !19, line: 32, baseType: !23, size: 128, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !324, file: !19, line: 33, baseType: !329, size: 32, align: 32, offset: 256)
!329 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !324, file: !19, line: 34, baseType: !23, size: 128, align: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !324, file: !19, line: 35, baseType: !23, size: 128, align: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !324, file: !19, line: 36, baseType: !23, size: 128, align: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !324, file: !19, line: 37, baseType: !23, size: 128, align: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !324, file: !19, line: 38, baseType: !23, size: 128, align: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !324, file: !19, line: 40, baseType: !92, size: 128, align: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !337, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !19, file: !19, line: 63, size: 320, align: 64, elements: !338, identifier: "std.io.Formatter")
!338 = !{!339, !340, !345}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !337, file: !19, line: 65, baseType: !95, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !337, file: !19, line: 66, baseType: !341, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !19, file: !19, line: 16, baseType: !342, align: 8)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !343, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !95, !10}
!345 = !DIDerivedType(tag: DW_TAG_member, scope: !337, file: !19, line: 67, baseType: !346, size: 192, align: 64, offset: 128)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !337, file: !19, line: 67, size: 192, align: 64, elements: !347)
!347 = !{!348, !349, !350, !351}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !19, line: 69, baseType: !329, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !346, file: !19, line: 70, baseType: !329, size: 32, align: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !346, file: !19, line: 71, baseType: !329, size: 32, align: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !346, file: !19, line: 72, baseType: !352, size: 64, align: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !353)
!353 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!354 = !{!355, !356, !358, !360, !361, !362}
!355 = !DILocalVariable(name: "len", scope: !320, file: !19, line: 173, type: !29, align: 8)
!356 = !DILocalVariable(name: "smem", scope: !357, file: !19, line: 185, type: !92, align: 8)
!357 = distinct !DILexicalBlock(scope: !320, file: !19, line: 184, column: 2)
!358 = !DILocalVariable(name: "smem", scope: !359, file: !19, line: 192, type: !92, align: 8)
!359 = distinct !DILexicalBlock(scope: !357, file: !19, line: 190, column: 3)
!360 = !DILocalVariable(name: "smem", scope: !320, file: !19, line: 201, type: !92, align: 8)
!361 = !DILocalVariable(name: "smem", scope: !320, file: !19, line: 210, type: !92, align: 8)
!362 = !DILocalVariable(name: "smem", scope: !363, file: !19, line: 226, type: !92, align: 8)
!363 = distinct !DILexicalBlock(scope: !320, file: !19, line: 225, column: 2)
!364 = !DILocalVariable(name: "self", arg: 1, scope: !320, file: !19, line: 171, type: !323)
!365 = !DILocation(line: 171, column: 23, scope: !320)
!366 = !DILocalVariable(name: "f", arg: 2, scope: !320, file: !19, line: 171, type: !336)
!367 = !DILocation(line: 171, column: 41, scope: !320)
!368 = !DILocation(line: 173, column: 6, scope: !320)
!369 = !DILocation(line: 175, column: 6, scope: !320)
!370 = !DILocation(line: 177, column: 3, scope: !371)
!371 = distinct !DILexicalBlock(scope: !320, file: !19, line: 176, column: 2)
!372 = !DILocation(line: 177, column: 10, scope: !371)
!373 = !DILocation(line: 178, column: 3, scope: !371)
!374 = !DILocation(line: 178, column: 10, scope: !371)
!375 = !DILocation(line: 179, column: 7, scope: !371)
!376 = !DILocation(line: 179, column: 26, scope: !371)
!377 = !DILocation(line: 179, column: 33, scope: !371)
!378 = !DILocation(line: 183, column: 6, scope: !320)
!379 = !DILocalVariable(name: "buffer", scope: !380, file: !19, line: 579, type: !395, align: 1)
!380 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !122, file: !122, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !381)
!381 = !{!379, !382}
!382 = !DILocalVariable(name: "allocator", scope: !380, file: !19, line: 580, type: !383, align: 8)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !19, file: !19, line: 12, size: 384, align: 64, elements: !384, identifier: "std.core.mem.allocator.OnStackAllocator")
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !383, file: !19, line: 14, baseType: !92, size: 128, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !19, line: 15, baseType: !24, size: 128, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !383, file: !19, line: 16, baseType: !29, size: 64, align: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !383, file: !19, line: 17, baseType: !389, size: 64, align: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !390, size: 64, align: 64, dwarfAddressSpace: 0)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !19, file: !19, line: 20, size: 192, align: 64, elements: !391, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.9581")
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !390, file: !19, line: 22, baseType: !43, size: 8, align: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !390, file: !19, line: 23, baseType: !389, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !19, line: 24, baseType: !95, size: 64, align: 64, offset: 128)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 8, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 64, lowerBound: 0)
!398 = !DILocation(line: 579, column: 14, scope: !380, inlinedAt: !399)
!399 = !DILocation(line: 185, column: 3, scope: !357)
!400 = !DILocation(line: 580, column: 19, scope: !380, inlinedAt: !399)
!401 = !DILocation(line: 581, column: 18, scope: !380, inlinedAt: !399)
!402 = !DILocation(line: 581, column: 26, scope: !380, inlinedAt: !399)
!403 = !DILocation(line: 581, column: 2, scope: !380, inlinedAt: !399)
!404 = !DILocation(line: 185, column: 28, scope: !357)
!405 = !DILocation(line: 583, column: 8, scope: !406, inlinedAt: !399)
!406 = distinct !DILexicalBlock(scope: !380, file: !122, line: 583, column: 2)
!407 = !DILocation(line: 187, column: 4, scope: !408)
!408 = distinct !DILexicalBlock(scope: !357, file: !19, line: 186, column: 3)
!409 = !DILocation(line: 187, column: 32, scope: !408)
!410 = !DILocation(line: 187, column: 47, scope: !408)
!411 = !DILocation(line: 187, column: 19, scope: !408)
!412 = !DILocation(line: 187, column: 11, scope: !408)
!413 = !DILocation(line: 582, column: 8, scope: !414, inlinedAt: !399)
!414 = distinct !DILexicalBlock(scope: !380, file: !122, line: 582, column: 8)
!415 = !DILocation(line: 582, column: 8, scope: !416, inlinedAt: !399)
!416 = distinct !DILexicalBlock(scope: !380, file: !122, line: 582, column: 8)
!417 = !DILocation(line: 189, column: 7, scope: !357)
!418 = !DILocation(line: 191, column: 4, scope: !359)
!419 = !DILocation(line: 191, column: 11, scope: !359)
!420 = !DILocalVariable(name: "buffer", scope: !421, file: !19, line: 579, type: !395, align: 1)
!421 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !122, file: !122, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !422)
!422 = !{!420, !423}
!423 = !DILocalVariable(name: "allocator", scope: !421, file: !19, line: 580, type: !383, align: 8)
!424 = !DILocation(line: 579, column: 14, scope: !421, inlinedAt: !425)
!425 = !DILocation(line: 192, column: 4, scope: !359)
!426 = !DILocation(line: 580, column: 19, scope: !421, inlinedAt: !425)
!427 = !DILocation(line: 581, column: 18, scope: !421, inlinedAt: !425)
!428 = !DILocation(line: 581, column: 26, scope: !421, inlinedAt: !425)
!429 = !DILocation(line: 581, column: 2, scope: !421, inlinedAt: !425)
!430 = !DILocation(line: 192, column: 29, scope: !359)
!431 = !DILocation(line: 583, column: 8, scope: !432, inlinedAt: !425)
!432 = distinct !DILexicalBlock(scope: !421, file: !122, line: 583, column: 2)
!433 = !DILocation(line: 194, column: 5, scope: !434)
!434 = distinct !DILexicalBlock(scope: !359, file: !19, line: 193, column: 4)
!435 = !DILocation(line: 194, column: 33, scope: !434)
!436 = !DILocation(line: 194, column: 48, scope: !434)
!437 = !DILocation(line: 194, column: 20, scope: !434)
!438 = !DILocation(line: 194, column: 12, scope: !434)
!439 = !DILocation(line: 582, column: 8, scope: !440, inlinedAt: !425)
!440 = distinct !DILexicalBlock(scope: !421, file: !122, line: 582, column: 8)
!441 = !DILocation(line: 582, column: 8, scope: !442, inlinedAt: !425)
!442 = distinct !DILexicalBlock(scope: !421, file: !122, line: 582, column: 8)
!443 = !DILocation(line: 197, column: 3, scope: !357)
!444 = !DILocation(line: 197, column: 10, scope: !357)
!445 = !DILocalVariable(name: "buffer", scope: !446, file: !19, line: 579, type: !449, align: 1)
!446 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !122, file: !122, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !447)
!447 = !{!445, !448}
!448 = !DILocalVariable(name: "allocator", scope: !446, file: !19, line: 580, type: !383, align: 8)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, align: 8, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 128, lowerBound: 0)
!452 = !DILocation(line: 579, column: 14, scope: !446, inlinedAt: !453)
!453 = !DILocation(line: 201, column: 2, scope: !320)
!454 = !DILocation(line: 580, column: 19, scope: !446, inlinedAt: !453)
!455 = !DILocation(line: 581, column: 18, scope: !446, inlinedAt: !453)
!456 = !DILocation(line: 581, column: 26, scope: !446, inlinedAt: !453)
!457 = !DILocation(line: 581, column: 2, scope: !446, inlinedAt: !453)
!458 = !DILocation(line: 201, column: 28, scope: !320)
!459 = !DILocation(line: 583, column: 8, scope: !460, inlinedAt: !453)
!460 = distinct !DILexicalBlock(scope: !446, file: !122, line: 583, column: 2)
!461 = !DILocation(line: 203, column: 3, scope: !462)
!462 = distinct !DILexicalBlock(scope: !320, file: !19, line: 202, column: 2)
!463 = !DILocation(line: 203, column: 31, scope: !462)
!464 = !DILocation(line: 203, column: 42, scope: !462)
!465 = !DILocation(line: 203, column: 18, scope: !462)
!466 = !DILocation(line: 203, column: 10, scope: !462)
!467 = !DILocation(line: 582, column: 8, scope: !468, inlinedAt: !453)
!468 = distinct !DILexicalBlock(scope: !446, file: !122, line: 582, column: 8)
!469 = !DILocation(line: 582, column: 8, scope: !470, inlinedAt: !453)
!470 = distinct !DILexicalBlock(scope: !446, file: !122, line: 582, column: 8)
!471 = !DILocation(line: 207, column: 6, scope: !320)
!472 = !DILocation(line: 207, column: 17, scope: !320)
!473 = !DILocation(line: 207, column: 40, scope: !320)
!474 = !DILocation(line: 207, column: 24, scope: !320)
!475 = !DILocalVariable(name: "buffer", scope: !476, file: !19, line: 579, type: !479, align: 1)
!476 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !122, file: !122, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !477)
!477 = !{!475, !478}
!478 = !DILocalVariable(name: "allocator", scope: !476, file: !19, line: 580, type: !383, align: 8)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, align: 8, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 256, lowerBound: 0)
!482 = !DILocation(line: 579, column: 14, scope: !476, inlinedAt: !483)
!483 = !DILocation(line: 210, column: 2, scope: !320)
!484 = !DILocation(line: 580, column: 19, scope: !476, inlinedAt: !483)
!485 = !DILocation(line: 581, column: 18, scope: !476, inlinedAt: !483)
!486 = !DILocation(line: 581, column: 26, scope: !476, inlinedAt: !483)
!487 = !DILocation(line: 581, column: 2, scope: !476, inlinedAt: !483)
!488 = !DILocation(line: 210, column: 28, scope: !320)
!489 = !DILocation(line: 583, column: 8, scope: !490, inlinedAt: !483)
!490 = distinct !DILexicalBlock(scope: !476, file: !122, line: 583, column: 2)
!491 = !DILocation(line: 212, column: 3, scope: !492)
!492 = distinct !DILexicalBlock(scope: !320, file: !19, line: 211, column: 2)
!493 = !DILocation(line: 212, column: 31, scope: !492)
!494 = !DILocation(line: 212, column: 42, scope: !492)
!495 = !DILocation(line: 212, column: 18, scope: !492)
!496 = !DILocation(line: 212, column: 10, scope: !492)
!497 = !DILocation(line: 582, column: 8, scope: !498, inlinedAt: !483)
!498 = distinct !DILexicalBlock(scope: !476, file: !122, line: 582, column: 8)
!499 = !DILocation(line: 582, column: 8, scope: !500, inlinedAt: !483)
!500 = distinct !DILexicalBlock(scope: !476, file: !122, line: 582, column: 8)
!501 = !DILocation(line: 217, column: 6, scope: !320)
!502 = !DILocation(line: 219, column: 3, scope: !503)
!503 = distinct !DILexicalBlock(scope: !320, file: !19, line: 218, column: 2)
!504 = !DILocation(line: 219, column: 10, scope: !503)
!505 = !DILocation(line: 220, column: 3, scope: !503)
!506 = !DILocation(line: 220, column: 18, scope: !503)
!507 = !DILocation(line: 220, column: 10, scope: !503)
!508 = !DILocation(line: 224, column: 6, scope: !320)
!509 = !DILocalVariable(name: "buffer", scope: !510, file: !19, line: 579, type: !479, align: 1)
!510 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !122, file: !122, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !511)
!511 = !{!509, !512}
!512 = !DILocalVariable(name: "allocator", scope: !510, file: !19, line: 580, type: !383, align: 8)
!513 = !DILocation(line: 579, column: 14, scope: !510, inlinedAt: !514)
!514 = !DILocation(line: 226, column: 3, scope: !363)
!515 = !DILocation(line: 580, column: 19, scope: !510, inlinedAt: !514)
!516 = !DILocation(line: 581, column: 18, scope: !510, inlinedAt: !514)
!517 = !DILocation(line: 581, column: 26, scope: !510, inlinedAt: !514)
!518 = !DILocation(line: 581, column: 2, scope: !510, inlinedAt: !514)
!519 = !DILocation(line: 226, column: 29, scope: !363)
!520 = !DILocation(line: 583, column: 8, scope: !521, inlinedAt: !514)
!521 = distinct !DILexicalBlock(scope: !510, file: !122, line: 583, column: 2)
!522 = !DILocation(line: 228, column: 4, scope: !523)
!523 = distinct !DILexicalBlock(scope: !363, file: !19, line: 227, column: 3)
!524 = !DILocation(line: 228, column: 11, scope: !523)
!525 = !DILocation(line: 582, column: 8, scope: !526, inlinedAt: !514)
!526 = distinct !DILexicalBlock(scope: !510, file: !122, line: 582, column: 8)
!527 = !DILocation(line: 229, column: 4, scope: !523)
!528 = !DILocation(line: 229, column: 32, scope: !523)
!529 = !DILocation(line: 229, column: 47, scope: !523)
!530 = !DILocation(line: 229, column: 19, scope: !523)
!531 = !DILocation(line: 229, column: 11, scope: !523)
!532 = !DILocation(line: 582, column: 8, scope: !533, inlinedAt: !514)
!533 = distinct !DILexicalBlock(scope: !510, file: !122, line: 582, column: 8)
!534 = !DILocation(line: 582, column: 8, scope: !535, inlinedAt: !514)
!535 = distinct !DILexicalBlock(scope: !510, file: !122, line: 582, column: 8)
!536 = !DILocation(line: 232, column: 9, scope: !320)
!537 = distinct !DISubprogram(name: "to_string", linkageName: "std.net.url.Url.to_string", scope: !19, file: !19, line: 235, type: !538, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !44)
!538 = !DISubroutineType(types: !539)
!539 = !{!23, !323, !92}
!540 = !DILocalVariable(name: "self", arg: 1, scope: !537, file: !19, line: 235, type: !323)
!541 = !DILocation(line: 235, column: 25, scope: !537)
!542 = !DILocalVariable(name: "allocator", arg: 2, scope: !537, file: !19, line: 235, type: !92)
!543 = !DILocation(line: 235, column: 42, scope: !537)
!544 = !DILocation(line: 237, column: 42, scope: !537)
!545 = !DILocation(line: 237, column: 9, scope: !537)
!546 = distinct !DISubprogram(name: "add", linkageName: "std.net.url.UrlQueryValues.add", scope: !19, file: !19, line: 292, type: !547, scopeLine: 292, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !585)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !549, !23, !23}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "UrlQueryValues*", baseType: !550, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "UrlQueryValues", scope: !19, file: !19, line: 243, size: 704, align: 64, elements: !551, identifier: "std.net.url.UrlQueryValues")
!551 = !{!552, !583}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !550, file: !19, line: 245, baseType: !553, size: 384, align: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !550, file: !19, line: 29, size: 384, align: 64, elements: !554, identifier: "std_collections_map$String$std_collections_list$String$.List$.HashMap")
!554 = !{!555, !578, !579, !580, !581}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !553, file: !19, line: 31, baseType: !556, size: 128, align: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !557, identifier: "Entry*[]")
!557 = !{!558, !577}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !556, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !560, size: 64, align: 64, dwarfAddressSpace: 0)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !561, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !19, file: !19, line: 21, size: 576, align: 64, elements: !562, identifier: "std_collections_map$String$std_collections_list$String$.List$.Entry")
!562 = !{!563, !564, !566, !576}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !561, file: !19, line: 23, baseType: !329, size: 32, align: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !561, file: !19, line: 24, baseType: !565, size: 128, align: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !19, file: !19, line: 245, baseType: !23, align: 8)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !561, file: !19, line: 25, baseType: !567, size: 320, align: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !19, file: !19, line: 245, baseType: !568, align: 8)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !19, file: !19, line: 18, size: 320, align: 64, elements: !569, identifier: "std_collections_list$String$.List")
!569 = !{!570, !571, !572, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !568, file: !19, line: 20, baseType: !29, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !568, file: !19, line: 21, baseType: !29, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !568, file: !19, line: 22, baseType: !92, size: 128, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !568, file: !19, line: 23, baseType: !574, size: 64, align: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !575, size: 64, align: 64, dwarfAddressSpace: 0)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !19, file: !19, line: 241, baseType: !23, align: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !561, file: !19, line: 26, baseType: !560, size: 64, align: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !556, baseType: !29, size: 64, align: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !553, file: !19, line: 32, baseType: !92, size: 128, align: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !553, file: !19, line: 34, baseType: !329, size: 32, align: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !553, file: !19, line: 36, baseType: !329, size: 32, align: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !553, file: !19, line: 37, baseType: !582, size: 32, align: 32, offset: 320)
!582 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "key_order", scope: !550, file: !19, line: 246, baseType: !584, size: 320, align: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "UrlQueryValueList", scope: !19, file: !19, line: 241, baseType: !568, align: 8)
!585 = !{!586, !587, !589, !591}
!586 = !DILocalVariable(name: "value_copy", scope: !546, file: !19, line: 294, type: !23, align: 8)
!587 = !DILocalVariable(name: "existing", scope: !546, file: !19, line: 295, type: !588, align: 8)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Value*", baseType: !567, size: 64, align: 64, dwarfAddressSpace: 0)
!589 = !DILocalVariable(name: "new_list", scope: !590, file: !19, line: 301, type: !584, align: 8)
!590 = distinct !DILexicalBlock(scope: !546, file: !19, line: 300, column: 2)
!591 = !DILocalVariable(name: ".temp", scope: !590, file: !19, line: 303, type: !567, align: 8)
!592 = !DILocalVariable(name: "self", arg: 1, scope: !546, file: !19, line: 292, type: !549)
!593 = !DILocation(line: 292, column: 39, scope: !546)
!594 = !DILocalVariable(name: "key", arg: 2, scope: !546, file: !19, line: 292, type: !23)
!595 = !DILocation(line: 292, column: 53, scope: !546)
!596 = !DILocalVariable(name: "value", arg: 3, scope: !546, file: !19, line: 292, type: !23)
!597 = !DILocation(line: 292, column: 65, scope: !546)
!598 = !DILocation(line: 294, column: 9, scope: !546)
!599 = !DILocation(line: 294, column: 33, scope: !546)
!600 = !DILocation(line: 294, column: 22, scope: !546)
!601 = !DILocation(line: 295, column: 10, scope: !546)
!602 = !DILocation(line: 295, column: 21, scope: !546)
!603 = !DILocation(line: 297, column: 17, scope: !604)
!604 = distinct !DILexicalBlock(scope: !546, file: !19, line: 296, column: 2)
!605 = !DILocation(line: 297, column: 3, scope: !604)
!606 = !DILocation(line: 301, column: 21, scope: !590)
!607 = !DILocation(line: 302, column: 28, scope: !590)
!608 = !DILocation(line: 302, column: 46, scope: !590)
!609 = !DILocation(line: 302, column: 3, scope: !590)
!610 = !DILocation(line: 303, column: 18, scope: !590)
!611 = !DILocation(line: 303, column: 3, scope: !590)
!612 = !DILocation(line: 304, column: 3, scope: !590)
!613 = !DILocation(line: 304, column: 32, scope: !590)
!614 = !DILocation(line: 304, column: 23, scope: !590)
!615 = !DILocation(line: 306, column: 9, scope: !546)
!616 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.url.UrlQueryValues.to_format", scope: !19, file: !19, line: 311, type: !617, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!30, !549, !336}
!619 = !{!620, !621, !622, !624, !626, !628, !630, !631, !633, !635}
!620 = !DILocalVariable(name: "len", scope: !616, file: !19, line: 313, type: !29, align: 8)
!621 = !DILocalVariable(name: "i", scope: !616, file: !19, line: 314, type: !29, align: 8)
!622 = !DILocalVariable(name: ".temp", scope: !623, file: !19, line: 315, type: !29, align: 8)
!623 = distinct !DILexicalBlock(scope: !616, file: !19, line: 315, column: 2)
!624 = !DILocalVariable(name: "key", scope: !625, file: !19, line: 315, type: !575, align: 8)
!625 = distinct !DILexicalBlock(scope: !623, file: !19, line: 316, column: 2)
!626 = !DILocalVariable(name: "mem", scope: !627, file: !19, line: 317, type: !92, align: 8)
!627 = distinct !DILexicalBlock(scope: !625, file: !19, line: 316, column: 2)
!628 = !DILocalVariable(name: "encoded_key", scope: !629, file: !19, line: 319, type: !23, align: 8)
!629 = distinct !DILexicalBlock(scope: !627, file: !19, line: 318, column: 3)
!630 = !DILocalVariable(name: "values", scope: !629, file: !19, line: 320, type: !568, align: 8)
!631 = !DILocalVariable(name: ".temp", scope: !632, file: !19, line: 322, type: !29, align: 8)
!632 = distinct !DILexicalBlock(scope: !629, file: !19, line: 322, column: 4)
!633 = !DILocalVariable(name: "value", scope: !634, file: !19, line: 322, type: !575, align: 8)
!634 = distinct !DILexicalBlock(scope: !632, file: !19, line: 323, column: 4)
!635 = !DILocalVariable(name: "smem", scope: !636, file: !19, line: 327, type: !92, align: 8)
!636 = distinct !DILexicalBlock(scope: !634, file: !19, line: 323, column: 4)
!637 = !DILocalVariable(name: "self", arg: 1, scope: !616, file: !19, line: 311, type: !549)
!638 = !DILocation(line: 311, column: 34, scope: !616)
!639 = !DILocalVariable(name: "f", arg: 2, scope: !616, file: !19, line: 311, type: !336)
!640 = !DILocation(line: 311, column: 52, scope: !616)
!641 = !DILocation(line: 313, column: 6, scope: !616)
!642 = !DILocation(line: 314, column: 6, scope: !616)
!643 = !DILocation(line: 315, column: 16, scope: !623)
!644 = !DILocation(line: 315, column: 11, scope: !625)
!645 = !DILocation(line: 393, column: 26, scope: !646, inlinedAt: !644)
!646 = distinct !DILexicalBlock(scope: !648, file: !647, line: 394, column: 1)
!647 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/collections")
!648 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !647, file: !647, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!649 = !DILocation(line: 391, column: 11, scope: !646, inlinedAt: !644)
!650 = !DILocation(line: 391, column: 19, scope: !646, inlinedAt: !644)
!651 = !DILocation(line: 315, column: 11, scope: !646, inlinedAt: !644)
!652 = !DILocation(line: 395, column: 9, scope: !648, inlinedAt: !644)
!653 = !DILocation(line: 395, column: 22, scope: !648, inlinedAt: !644)
!654 = !DILocalVariable(name: "buffer", scope: !655, file: !19, line: 579, type: !449, align: 1)
!655 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !122, file: !122, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !656)
!656 = !{!654, !657}
!657 = !DILocalVariable(name: "allocator", scope: !655, file: !19, line: 580, type: !383, align: 8)
!658 = !DILocation(line: 579, column: 14, scope: !655, inlinedAt: !659)
!659 = !DILocation(line: 317, column: 3, scope: !627)
!660 = !DILocation(line: 580, column: 19, scope: !655, inlinedAt: !659)
!661 = !DILocation(line: 581, column: 18, scope: !655, inlinedAt: !659)
!662 = !DILocation(line: 581, column: 26, scope: !655, inlinedAt: !659)
!663 = !DILocation(line: 581, column: 2, scope: !655, inlinedAt: !659)
!664 = !DILocation(line: 317, column: 29, scope: !627)
!665 = !DILocation(line: 583, column: 8, scope: !666, inlinedAt: !659)
!666 = distinct !DILexicalBlock(scope: !655, file: !122, line: 583, column: 2)
!667 = !DILocation(line: 319, column: 11, scope: !629)
!668 = !DILocation(line: 319, column: 42, scope: !629)
!669 = !DILocation(line: 319, column: 25, scope: !629)
!670 = !DILocation(line: 320, column: 23, scope: !629)
!671 = !DILocation(line: 320, column: 32, scope: !629)
!672 = !DILocation(line: 321, column: 14, scope: !629)
!673 = !DILocation(line: 582, column: 8, scope: !674, inlinedAt: !659)
!674 = distinct !DILexicalBlock(scope: !655, file: !122, line: 582, column: 8)
!675 = !DILocation(line: 322, column: 21, scope: !632)
!676 = !DILocation(line: 322, column: 13, scope: !634)
!677 = !DILocation(line: 393, column: 26, scope: !678, inlinedAt: !676)
!678 = distinct !DILexicalBlock(scope: !679, file: !647, line: 394, column: 1)
!679 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !647, file: !647, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!680 = !DILocation(line: 391, column: 11, scope: !678, inlinedAt: !676)
!681 = !DILocation(line: 391, column: 19, scope: !678, inlinedAt: !676)
!682 = !DILocation(line: 322, column: 13, scope: !678, inlinedAt: !676)
!683 = !DILocation(line: 395, column: 9, scope: !679, inlinedAt: !676)
!684 = !DILocation(line: 395, column: 22, scope: !679, inlinedAt: !676)
!685 = !DILocation(line: 324, column: 9, scope: !636)
!686 = !DILocation(line: 324, column: 16, scope: !636)
!687 = !DILocation(line: 324, column: 23, scope: !636)
!688 = !DILocation(line: 582, column: 8, scope: !689, inlinedAt: !659)
!689 = distinct !DILexicalBlock(scope: !655, file: !122, line: 582, column: 8)
!690 = !DILocation(line: 325, column: 5, scope: !636)
!691 = !DILocation(line: 325, column: 12, scope: !636)
!692 = !DILocation(line: 582, column: 8, scope: !693, inlinedAt: !659)
!693 = distinct !DILexicalBlock(scope: !655, file: !122, line: 582, column: 8)
!694 = !DILocation(line: 326, column: 5, scope: !636)
!695 = !DILocation(line: 326, column: 12, scope: !636)
!696 = !DILocation(line: 582, column: 8, scope: !697, inlinedAt: !659)
!697 = distinct !DILexicalBlock(scope: !655, file: !122, line: 582, column: 8)
!698 = !DILocalVariable(name: "buffer", scope: !699, file: !19, line: 579, type: !479, align: 1)
!699 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !122, file: !122, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !700)
!700 = !{!698, !701}
!701 = !DILocalVariable(name: "allocator", scope: !699, file: !19, line: 580, type: !383, align: 8)
!702 = !DILocation(line: 579, column: 14, scope: !699, inlinedAt: !703)
!703 = !DILocation(line: 327, column: 5, scope: !636)
!704 = !DILocation(line: 580, column: 19, scope: !699, inlinedAt: !703)
!705 = !DILocation(line: 581, column: 18, scope: !699, inlinedAt: !703)
!706 = !DILocation(line: 581, column: 26, scope: !699, inlinedAt: !703)
!707 = !DILocation(line: 581, column: 2, scope: !699, inlinedAt: !703)
!708 = !DILocation(line: 327, column: 31, scope: !636)
!709 = !DILocation(line: 583, column: 8, scope: !710, inlinedAt: !703)
!710 = distinct !DILexicalBlock(scope: !699, file: !122, line: 583, column: 2)
!711 = !DILocation(line: 329, column: 6, scope: !712)
!712 = distinct !DILexicalBlock(scope: !636, file: !19, line: 328, column: 5)
!713 = !DILocation(line: 329, column: 41, scope: !712)
!714 = !DILocation(line: 329, column: 21, scope: !712)
!715 = !DILocation(line: 329, column: 13, scope: !712)
!716 = !DILocation(line: 582, column: 8, scope: !717, inlinedAt: !703)
!717 = distinct !DILexicalBlock(scope: !699, file: !122, line: 582, column: 8)
!718 = !DILocation(line: 582, column: 8, scope: !719, inlinedAt: !659)
!719 = distinct !DILexicalBlock(scope: !655, file: !122, line: 582, column: 8)
!720 = !DILocation(line: 582, column: 8, scope: !721, inlinedAt: !703)
!721 = distinct !DILexicalBlock(scope: !699, file: !122, line: 582, column: 8)
!722 = !DILocation(line: 331, column: 5, scope: !636)
!723 = !DILocation(line: 582, column: 8, scope: !724, inlinedAt: !659)
!724 = distinct !DILexicalBlock(scope: !655, file: !122, line: 582, column: 8)
!725 = !DILocation(line: 335, column: 9, scope: !616)
!726 = distinct !DISubprogram(name: "free", linkageName: "std.net.url.UrlQueryValues.free", scope: !19, file: !19, line: 339, type: !727, scopeLine: 339, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !549}
!729 = !{!730, !731, !732, !735, !737, !739}
!730 = !DILocalVariable(name: "key", scope: !726, file: !19, line: 341, type: !23, align: 8)
!731 = !DILocalVariable(name: "values", scope: !726, file: !19, line: 341, type: !584, align: 8)
!732 = !DILocalVariable(name: ".temp", scope: !733, file: !19, line: 343, type: !29, align: 8)
!733 = distinct !DILexicalBlock(scope: !734, file: !19, line: 343, column: 3)
!734 = distinct !DILexicalBlock(scope: !726, file: !19, line: 342, column: 2)
!735 = !DILocalVariable(name: "value", scope: !736, file: !19, line: 343, type: !575, align: 8)
!736 = distinct !DILexicalBlock(scope: !733, file: !19, line: 343, column: 27)
!737 = !DILocalVariable(name: ".temp", scope: !738, file: !19, line: 348, type: !29, align: 8)
!738 = distinct !DILexicalBlock(scope: !726, file: !19, line: 348, column: 2)
!739 = !DILocalVariable(name: "key", scope: !740, file: !19, line: 348, type: !574, align: 8)
!740 = distinct !DILexicalBlock(scope: !738, file: !19, line: 348, column: 33)
!741 = !DILocalVariable(name: "self", arg: 1, scope: !726, file: !19, line: 339, type: !549)
!742 = !DILocation(line: 339, column: 29, scope: !726)
!743 = !DILocation(line: 345, column: 7, scope: !744, inlinedAt: !751)
!744 = distinct !DISubprogram(name: "@each_entry", linkageName: "@each_entry", scope: !745, file: !745, line: 343, scopeLine: 343, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !746)
!745 = !DIFile(filename: "hashmap.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/collections")
!746 = !{!747, !749}
!747 = !DILocalVariable(name: ".temp", scope: !748, file: !19, line: 346, type: !29, align: 8)
!748 = distinct !DILexicalBlock(scope: !744, file: !745, line: 346, column: 2)
!749 = !DILocalVariable(name: "entry", scope: !750, file: !19, line: 346, type: !560, align: 8)
!750 = distinct !DILexicalBlock(scope: !748, file: !745, line: 347, column: 2)
!751 = !DILocation(line: 337, column: 2, scope: !752, inlinedAt: !755)
!752 = distinct !DISubprogram(name: "@each", linkageName: "@each", scope: !745, file: !745, line: 335, scopeLine: 335, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !753)
!753 = !{!754}
!754 = !DILocalVariable(name: "entry", scope: !752, file: !19, line: 337, type: !560, align: 8)
!755 = !DILocation(line: 341, column: 2, scope: !726)
!756 = !DILocation(line: 345, column: 24, scope: !744, inlinedAt: !751)
!757 = !DILocation(line: 346, column: 26, scope: !748, inlinedAt: !751)
!758 = !DILocation(line: 346, column: 18, scope: !750, inlinedAt: !751)
!759 = !DILocation(line: 346, column: 26, scope: !750, inlinedAt: !751)
!760 = !DILocation(line: 348, column: 3, scope: !761, inlinedAt: !751)
!761 = distinct !DILexicalBlock(scope: !750, file: !745, line: 347, column: 2)
!762 = !DILocation(line: 348, column: 10, scope: !763, inlinedAt: !751)
!763 = distinct !DILexicalBlock(scope: !761, file: !745, line: 348, column: 3)
!764 = !DILocation(line: 337, column: 27, scope: !752, inlinedAt: !755)
!765 = !DILocation(line: 350, column: 10, scope: !766, inlinedAt: !751)
!766 = distinct !DILexicalBlock(scope: !767, file: !745, line: 350, column: 4)
!767 = distinct !DILexicalBlock(scope: !763, file: !745, line: 349, column: 3)
!768 = !DILocation(line: 341, column: 25, scope: !726)
!769 = !DILocation(line: 341, column: 48, scope: !726)
!770 = !DILocation(line: 339, column: 9, scope: !771, inlinedAt: !755)
!771 = distinct !DILexicalBlock(scope: !772, file: !745, line: 339, column: 3)
!772 = distinct !DILexicalBlock(scope: !752, file: !745, line: 338, column: 2)
!773 = !DILocation(line: 339, column: 20, scope: !771, inlinedAt: !755)
!774 = !DILocation(line: 343, column: 19, scope: !733)
!775 = !DILocation(line: 343, column: 12, scope: !736)
!776 = !DILocation(line: 393, column: 26, scope: !777, inlinedAt: !775)
!777 = distinct !DILexicalBlock(scope: !778, file: !647, line: 394, column: 1)
!778 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !647, file: !647, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!779 = !DILocation(line: 391, column: 11, scope: !777, inlinedAt: !775)
!780 = !DILocation(line: 391, column: 19, scope: !777, inlinedAt: !775)
!781 = !DILocation(line: 343, column: 12, scope: !777, inlinedAt: !775)
!782 = !DILocation(line: 395, column: 9, scope: !778, inlinedAt: !775)
!783 = !DILocation(line: 395, column: 22, scope: !778, inlinedAt: !775)
!784 = !DILocation(line: 343, column: 38, scope: !736)
!785 = !DILocation(line: 343, column: 27, scope: !736)
!786 = !DILocation(line: 344, column: 3, scope: !734)
!787 = !DILocation(line: 351, column: 12, scope: !767, inlinedAt: !751)
!788 = !DILocation(line: 346, column: 2, scope: !726)
!789 = !DILocation(line: 348, column: 17, scope: !738)
!790 = !DILocation(line: 348, column: 12, scope: !740)
!791 = !DILocation(line: 348, column: 17, scope: !740)
!792 = !DILocation(line: 348, column: 42, scope: !740)
!793 = !DILocation(line: 348, column: 33, scope: !740)
!794 = !DILocation(line: 349, column: 2, scope: !726)
!795 = distinct !DISubprogram(name: "free", linkageName: "std.net.url.Url.free", scope: !19, file: !19, line: 357, type: !796, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !44)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !323}
!798 = !DILocalVariable(name: "self", arg: 1, scope: !795, file: !19, line: 357, type: !323)
!799 = !DILocation(line: 357, column: 18, scope: !795)
!800 = !DILocation(line: 359, column: 7, scope: !795)
!801 = !DILocation(line: 359, column: 29, scope: !795)
!802 = !DILocation(line: 360, column: 19, scope: !795)
!803 = !DILocation(line: 360, column: 2, scope: !795)
!804 = !DILocation(line: 361, column: 2, scope: !795)
!805 = !DILocation(line: 361, column: 17, scope: !795)
!806 = !DILocation(line: 362, column: 2, scope: !795)
!807 = !DILocation(line: 362, column: 21, scope: !795)
!808 = !DILocation(line: 363, column: 2, scope: !795)
!809 = !DILocation(line: 363, column: 21, scope: !795)
!810 = !DILocation(line: 364, column: 2, scope: !795)
!811 = !DILocation(line: 364, column: 17, scope: !795)
!812 = !DILocation(line: 365, column: 2, scope: !795)
!813 = !DILocation(line: 365, column: 18, scope: !795)
!814 = !DILocation(line: 366, column: 2, scope: !795)
!815 = !DILocation(line: 366, column: 21, scope: !795)
!816 = distinct !DISubprogram(name: "tparse", linkageName: "std.net.url.tparse", scope: !19, file: !19, line: 50, type: !817, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !44)
!817 = !DISubroutineType(types: !818)
!818 = !{!324, !23}
!819 = !DILocalVariable(name: "url_string", arg: 1, scope: !816, file: !19, line: 50, type: !23)
!820 = !DILocation(line: 50, column: 23, scope: !816)
!821 = !DILocation(line: 47, column: 11, scope: !822)
!822 = distinct !DILexicalBlock(scope: !816, file: !19, line: 50, column: 38)
!823 = !DILocation(line: 50, column: 44, scope: !816)
!824 = !DILocation(line: 50, column: 38, scope: !816)
!825 = distinct !DISubprogram(name: "parse", linkageName: "std.net.url.parse", scope: !19, file: !19, line: 59, type: !826, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !828)
!826 = !DISubroutineType(types: !827)
!827 = !{!324, !92, !23}
!828 = !{!829, !830, !831, !832, !834, !835, !836, !838, !839, !840, !847, !848, !850, !853, !854, !855, !857}
!829 = !DILocalVariable(name: "url", scope: !825, file: !19, line: 63, type: !324, align: 8)
!830 = !DILocalVariable(name: "pos", scope: !825, file: !19, line: 66, type: !29, align: 8)
!831 = !DILocalVariable(name: "pos", scope: !825, file: !19, line: 72, type: !29, align: 8)
!832 = !DILocalVariable(name: "authority_end", scope: !833, file: !19, line: 84, type: !29, align: 8)
!833 = distinct !DILexicalBlock(scope: !825, file: !19, line: 83, column: 2)
!834 = !DILocalVariable(name: "authority", scope: !833, file: !19, line: 85, type: !23, align: 8)
!835 = !DILocalVariable(name: "user_info_end", scope: !833, file: !19, line: 87, type: !29, align: 8)
!836 = !DILocalVariable(name: "userinfo", scope: !837, file: !19, line: 89, type: !23, align: 8)
!837 = distinct !DILexicalBlock(scope: !833, file: !19, line: 88, column: 3)
!838 = !DILocalVariable(name: "username", scope: !837, file: !19, line: 90, type: !23, align: 8)
!839 = !DILocalVariable(name: "password", scope: !837, file: !19, line: 91, type: !23, align: 8)
!840 = !DILocalVariable(name: "userpass", scope: !841, file: !19, line: 94, type: !842, align: 8)
!841 = distinct !DILexicalBlock(scope: !837, file: !19, line: 93, column: 4)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !843, identifier: "String[]")
!843 = !{!844, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !842, baseType: !845, size: 64, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !842, baseType: !29, size: 64, align: 64, offset: 64)
!847 = !DILocalVariable(name: "host", scope: !833, file: !19, line: 106, type: !23, align: 8)
!848 = !DILocalVariable(name: "ipv6_end", scope: !849, file: !19, line: 109, type: !29, align: 8)
!849 = distinct !DILexicalBlock(scope: !833, file: !19, line: 108, column: 3)
!850 = !DILocalVariable(name: "host_port", scope: !851, file: !19, line: 120, type: !842, align: 8)
!851 = distinct !DILexicalBlock(scope: !852, file: !19, line: 119, column: 4)
!852 = distinct !DILexicalBlock(scope: !833, file: !19, line: 117, column: 3)
!853 = !DILocalVariable(name: "query_index", scope: !825, file: !19, line: 137, type: !30, align: 8)
!854 = !DILocalVariable(name: "fragment_index", scope: !825, file: !19, line: 138, type: !30, align: 8)
!855 = !DILocalVariable(name: "path_end", scope: !856, file: !19, line: 142, type: !29, align: 8)
!856 = distinct !DILexicalBlock(scope: !825, file: !19, line: 141, column: 2)
!857 = !DILocalVariable(name: "index", scope: !858, file: !19, line: 158, type: !29, align: 8)
!858 = distinct !DILexicalBlock(scope: !825, file: !19, line: 157, column: 2)
!859 = !DILocalVariable(name: "allocator", arg: 1, scope: !825, file: !19, line: 59, type: !92)
!860 = !DILocation(line: 59, column: 25, scope: !825)
!861 = !DILocalVariable(name: "url_string", arg: 2, scope: !825, file: !19, line: 59, type: !23)
!862 = !DILocation(line: 59, column: 43, scope: !825)
!863 = !DILocation(line: 56, column: 11, scope: !864)
!864 = distinct !DILexicalBlock(scope: !825, file: !19, line: 60, column: 1)
!865 = !DILocation(line: 225, column: 46, scope: !866, inlinedAt: !868)
!866 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !867, file: !867, line: 225, scopeLine: 225, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!867 = !DIFile(filename: "string.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!868 = !DILocation(line: 61, column: 15, scope: !825)
!869 = !DILocation(line: 62, column: 7, scope: !825)
!870 = !DILocation(line: 62, column: 26, scope: !825)
!871 = !DILocation(line: 63, column: 6, scope: !825)
!872 = !DILocation(line: 63, column: 27, scope: !825)
!873 = !DILocation(line: 66, column: 10, scope: !825)
!874 = !DILocation(line: 66, column: 16, scope: !825)
!875 = !DILocation(line: 68, column: 7, scope: !876)
!876 = distinct !DILexicalBlock(scope: !825, file: !19, line: 67, column: 2)
!877 = !DILocation(line: 68, column: 20, scope: !876)
!878 = !DILocation(line: 69, column: 16, scope: !876)
!879 = !DILocation(line: 69, column: 28, scope: !876)
!880 = !DILocation(line: 69, column: 3, scope: !876)
!881 = !DILocation(line: 70, column: 16, scope: !876)
!882 = !DILocation(line: 70, column: 27, scope: !876)
!883 = !DILocation(line: 72, column: 15, scope: !825)
!884 = !DILocation(line: 72, column: 21, scope: !825)
!885 = !DILocation(line: 75, column: 7, scope: !886)
!886 = distinct !DILexicalBlock(scope: !825, file: !19, line: 73, column: 2)
!887 = !DILocation(line: 75, column: 20, scope: !886)
!888 = !DILocation(line: 76, column: 16, scope: !886)
!889 = !DILocation(line: 76, column: 28, scope: !886)
!890 = !DILocation(line: 76, column: 3, scope: !886)
!891 = !DILocation(line: 77, column: 32, scope: !886)
!892 = !DILocation(line: 77, column: 43, scope: !886)
!893 = !DILocation(line: 77, column: 14, scope: !886)
!894 = !DILocation(line: 77, column: 65, scope: !886)
!895 = !DILocation(line: 77, column: 3, scope: !886)
!896 = !DILocation(line: 78, column: 10, scope: !886)
!897 = !DILocation(line: 82, column: 6, scope: !825)
!898 = !DILocation(line: 84, column: 7, scope: !833)
!899 = !DILocation(line: 84, column: 23, scope: !833)
!900 = !DILocation(line: 84, column: 59, scope: !833)
!901 = !DILocation(line: 85, column: 10, scope: !833)
!902 = !DILocation(line: 85, column: 22, scope: !833)
!903 = !DILocation(line: 85, column: 34, scope: !833)
