; ModuleID = 'std::hash::md5'
source_filename = "std::hash::md5"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.252 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].251" = type { ptr, i64 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

@"$ct.std.hash.md5.Md5" = linkonce global %.introspect.252 { i8 10, i64 0, ptr null, i64 152, i64 0, i64 8, [0 x i64] zeroinitializer }, align 8
@std.hash.md5.BLOCK_BYTES = weak local_unnamed_addr constant i32 64, align 4, !dbg !0
@std.hash.md5.HASH_BYTES = weak local_unnamed_addr constant i32 16, align 4, !dbg !4

; Function Attrs: nounwind uwtable(sync)
define weak void @std.hash.md5.Md5.init(ptr %0) #0 !dbg !14 {
entry:
    #dbg_value(ptr %0, !37, !DIExpression(), !38)
  %ptradd = getelementptr inbounds i8, ptr %0, i64 8, !dbg !39
  store i32 1732584193, ptr %ptradd, align 4, !dbg !39
  %ptradd1 = getelementptr inbounds i8, ptr %0, i64 12, !dbg !40
  store i32 -271733879, ptr %ptradd1, align 4, !dbg !40
  %ptradd2 = getelementptr inbounds i8, ptr %0, i64 16, !dbg !41
  store i32 -1732584194, ptr %ptradd2, align 4, !dbg !41
  %ptradd3 = getelementptr inbounds i8, ptr %0, i64 20, !dbg !42
  store i32 271733878, ptr %ptradd3, align 4, !dbg !42
  store i32 0, ptr %0, align 4, !dbg !43
  %ptradd4 = getelementptr inbounds i8, ptr %0, i64 4, !dbg !44
  store i32 0, ptr %ptradd4, align 4, !dbg !44

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std.hash.md5.BLOCK_BYTES", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "md5.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/hash")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std.hash.md5.HASH_BYTES", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 2, !"wchar_size", i32 4}
!9 = !{i32 4, !"PIC Level", i32 2}
!10 = !{i32 1, !"uwtable", i32 1}
!11 = !{i32 2, !"frame-pointer", i32 1}
!12 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !13, splitDebugInlining: false)
!13 = !{!0, !4}
!14 = distinct !DISubprogram(name: "init", linkageName: "std.hash.md5.Md5.init", scope: !2, file: !2, line: 28, type: !15, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !36)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Md5*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !19, identifier: "std.hash.md5.Md5")
!19 = !{!20, !22, !23, !24, !25, !26, !27, !32}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !18, file: !2, line: 10, baseType: !21, size: 32, align: 32)
!21 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !18, file: !2, line: 10, baseType: !21, size: 32, align: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !18, file: !2, line: 11, baseType: !21, size: 32, align: 32, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !18, file: !2, line: 12, baseType: !28, size: 512, align: 8, offset: 192)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, align: 8, elements: !30)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !{!31}
!31 = !DISubrange(count: 64, lowerBound: 0)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !18, file: !2, line: 13, baseType: !33, size: 512, align: 32, offset: 704)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 32, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 16, lowerBound: 0)
!36 = !{}
!37 = !DILocalVariable(name: "self", arg: 1, scope: !14, file: !2, line: 28, type: !17)
!38 = !DILocation(line: 28, column: 18, scope: !14)
!39 = !DILocation(line: 30, column: 2, scope: !14)
!40 = !DILocation(line: 31, column: 2, scope: !14)
!41 = !DILocation(line: 32, column: 2, scope: !14)
!42 = !DILocation(line: 33, column: 2, scope: !14)
!43 = !DILocation(line: 35, column: 2, scope: !14)
!44 = !DILocation(line: 36, column: 2, scope: !14)
!45 = distinct !DISubprogram(name: "update", linkageName: "std.hash.md5.Md5.update", scope: !2, file: !2, line: 40, type: !46, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !55)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !17, !48}
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !49, identifier: "char[]")
!49 = !{!50, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !48, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !48, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !54)
!54 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!55 = !{!56, !57, !58}
!56 = !DILocalVariable(name: "saved_lo", scope: !45, file: !2, line: 42, type: !21, align: 4)
!57 = !DILocalVariable(name: "used", scope: !45, file: !2, line: 46, type: !53, align: 8)
!58 = !DILocalVariable(name: "available", scope: !59, file: !2, line: 50, type: !53, align: 8)
!59 = distinct !DILexicalBlock(scope: !45, file: !2, line: 49, column: 2)
!60 = !DILocalVariable(name: "ctx", arg: 1, scope: !45, file: !2, line: 40, type: !17)
!61 = !DILocation(line: 40, column: 20, scope: !45)
!62 = !DILocalVariable(name: "data", arg: 2, scope: !45, file: !2, line: 40, type: !48)
!63 = !DILocation(line: 40, column: 33, scope: !45)
!64 = !DILocation(line: 42, column: 7, scope: !45)
!65 = !DILocation(line: 42, column: 18, scope: !45)
!66 = !DILocation(line: 43, column: 17, scope: !45)
!67 = !DILocation(line: 43, column: 28, scope: !45)
!68 = !DILocation(line: 43, column: 16, scope: !45)
!69 = !DILocation(line: 43, column: 7, scope: !45)
!70 = !DILocation(line: 43, column: 54, scope: !45)
!71 = !DILocation(line: 43, column: 6, scope: !45)
!72 = !DILocation(line: 43, column: 64, scope: !45)
!73 = !DILocation(line: 44, column: 2, scope: !45)
!74 = !DILocation(line: 44, column: 12, scope: !45)
!75 = !DILocation(line: 46, column: 6, scope: !45)
!76 = !DILocation(line: 46, column: 13, scope: !45)
!77 = !DILocation(line: 48, column: 6, scope: !45)
!78 = !DILocation(line: 50, column: 7, scope: !59)
!79 = !DILocation(line: 50, column: 24, scope: !59)
!80 = !DILocation(line: 50, column: 19, scope: !59)
!81 = !DILocation(line: 52, column: 7, scope: !59)
!82 = !DILocation(line: 52, column: 18, scope: !59)
!83 = !DILocation(line: 54, column: 32, scope: !84)
!84 = distinct !DILexicalBlock(scope: !59, file: !2, line: 53, column: 3)
!85 = !DILocation(line: 54, column: 37, scope: !84)
!86 = !DILocation(line: 54, column: 4, scope: !84)
!87 = !DILocation(line: 54, column: 15, scope: !84)
!88 = !DILocation(line: 54, column: 20, scope: !84)
!89 = !DILocation(line: 55, column: 10, scope: !84)
!90 = !DILocation(line: 57, column: 32, scope: !59)
!91 = !DILocation(line: 57, column: 38, scope: !59)
!92 = !DILocation(line: 57, column: 3, scope: !59)
!93 = !DILocation(line: 57, column: 14, scope: !59)
!94 = !DILocation(line: 57, column: 19, scope: !59)
!95 = !DILocation(line: 58, column: 10, scope: !59)
!96 = !DILocation(line: 58, column: 15, scope: !59)
!97 = !DILocation(line: 59, column: 14, scope: !59)
!98 = !DILocation(line: 59, column: 3, scope: !59)
!99 = !DILocation(line: 62, column: 6, scope: !45)
!100 = !DILocation(line: 64, column: 26, scope: !101)
!101 = distinct !DILexicalBlock(scope: !45, file: !2, line: 63, column: 2)
!102 = !DILocation(line: 64, column: 10, scope: !101)
!103 = !DILocation(line: 64, column: 50, scope: !101)
!104 = !DILocation(line: 66, column: 26, scope: !45)
!105 = !DILocation(line: 66, column: 31, scope: !45)
!106 = !DILocation(line: 66, column: 2, scope: !45)
!107 = !DILocation(line: 66, column: 14, scope: !45)
!108 = distinct !DISubprogram(name: "final", linkageName: "std.hash.md5.Md5.final", scope: !2, file: !2, line: 69, type: !109, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !112)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !17}
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, align: 8, elements: !34)
!112 = !{!113, !114, !115}
!113 = !DILocalVariable(name: "used", scope: !108, file: !2, line: 71, type: !53, align: 8)
!114 = !DILocalVariable(name: "available", scope: !108, file: !2, line: 74, type: !53, align: 8)
!115 = !DILocalVariable(name: "res", scope: !108, file: !2, line: 91, type: !111, align: 1)
