; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.353 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].352" = type { ptr, i64 }
%any.355 = type { ptr, i64 }
%ByteReader.356 = type { %"char[].352", i64 }
%OnStackAllocator.357 = type { %any.355, %"char[].352", i64, ptr }
%JsonContext = type { i32, %any.355, %any.355, i32, ptr, double, i8, i32, i8 }

@"$ct.std.encoding.json.JsonContext.13383" = linkonce global %.introspect.353 { i8 10, i64 0, ptr null, i64 80, i64 0, i64 9, [0 x i64] zeroinitializer }, align 8
@.enum.NO_TOKEN = internal constant [9 x i8] c"NO_TOKEN\00", align 1
@.enum.LBRACE = internal constant [7 x i8] c"LBRACE\00", align 1
@.enum.LBRACKET = internal constant [9 x i8] c"LBRACKET\00", align 1
@.enum.COMMA = internal constant [6 x i8] c"COMMA\00", align 1
@.enum.COLON = internal constant [6 x i8] c"COLON\00", align 1
@.enum.RBRACE = internal constant [7 x i8] c"RBRACE\00", align 1
@.enum.RBRACKET = internal constant [9 x i8] c"RBRACKET\00", align 1
@.enum.STRING = internal constant [7 x i8] c"STRING\00", align 1
@.enum.NUMBER = internal constant [7 x i8] c"NUMBER\00", align 1
@.enum.TRUE = internal constant [5 x i8] c"TRUE\00", align 1
@.enum.FALSE = internal constant [6 x i8] c"FALSE\00", align 1
@.enum.NULL = internal constant [5 x i8] c"NULL\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "max_depth", linkageName: "std.encoding.json.max_depth", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "json.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/encoding")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !{i32 2, !"Dwarf Version", i32 4}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 2, !"wchar_size", i32 4}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"uwtable", i32 1}
!9 = !{i32 2, !"frame-pointer", i32 1}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !54, splitDebugInlining: false)
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !13, file: !2, line: 41, baseType: !3, size: 32, align: 32, elements: !40)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !2, file: !2, line: 58, size: 640, align: 64, elements: !14, identifier: "std.encoding.json.JsonContext.13383")
!14 = !{!15, !17, !24, !29, !30, !34, !36, !38, !39}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !13, file: !2, line: 60, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !13, file: !2, line: 61, baseType: !18, size: 128, align: 64, offset: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !19, identifier: "InStream")
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !18, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !13, file: !2, line: 62, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !26, identifier: "Allocator")
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, baseType: !21, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, baseType: !23, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !13, file: !2, line: 63, baseType: !12, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !13, file: !2, line: 64, baseType: !31, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !32, align: 8)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !13, file: !2, line: 65, baseType: !35, size: 64, align: 64, offset: 448)
!35 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !13, file: !2, line: 66, baseType: !37, size: 8, align: 8, offset: 512)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !13, file: !2, line: 67, baseType: !3, size: 32, align: 32, offset: 544)
!39 = !DIDerivedType(tag: DW_TAG_member, scope: !13, file: !2, line: 68, baseType: !37, size: 8, align: 8, offset: 576)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!41 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!42 = !DIEnumerator(name: "LBRACE", value: 1)
!43 = !DIEnumerator(name: "LBRACKET", value: 2)
!44 = !DIEnumerator(name: "COMMA", value: 3)
!45 = !DIEnumerator(name: "COLON", value: 4)
!46 = !DIEnumerator(name: "RBRACE", value: 5)
!47 = !DIEnumerator(name: "RBRACKET", value: 6)
!48 = !DIEnumerator(name: "STRING", value: 7)
!49 = !DIEnumerator(name: "NUMBER", value: 8)
!50 = !DIEnumerator(name: "TRUE", value: 9)
!51 = !DIEnumerator(name: "FALSE", value: 10)
!52 = !DIEnumerator(name: "NULL", value: 11)
!53 = !DIEnumerator(name: "EOF", value: 12)
!54 = !{!0}
!55 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !2, file: !2, line: 12, type: !56, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !115)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !25, !72}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !60, identifier: "std.collections.object.Object")
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !2, line: 13, baseType: !23, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !59, file: !2, line: 14, baseType: !25, size: 128, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, scope: !59, file: !2, line: 15, baseType: !64, size: 384, align: 128, offset: 256)
!64 = !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !2, line: 15, size: 384, align: 128, elements: !65)
!65 = !{!66, !68, !69, !71, !80, !81, !91}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !64, file: !2, line: 17, baseType: !67, size: 128, align: 128)
!67 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !64, file: !2, line: 18, baseType: !35, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !64, file: !2, line: 19, baseType: !70, size: 8, align: 8)
!70 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !64, file: !2, line: 20, baseType: !72, size: 128, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !74, identifier: "char[]")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !79)
!79 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !64, file: !2, line: 21, baseType: !21, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !64, file: !2, line: 22, baseType: !82, size: 320, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 466, baseType: !83, align: 8)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !84, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !2, line: 20, baseType: !78, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !83, file: !2, line: 21, baseType: !78, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !83, file: !2, line: 22, baseType: !25, size: 128, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !83, file: !2, line: 23, baseType: !89, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 466, baseType: !58, align: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !64, file: !2, line: 23, baseType: !92, size: 384, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 465, baseType: !93, align: 8)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !94, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!94 = !{!95, !110, !111, !112, !113}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !93, file: !2, line: 31, baseType: !96, size: 128, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !97, identifier: "Entry*[]")
!97 = !{!98, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !96, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !102, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!102 = !{!103, !104, !106, !108}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !101, file: !2, line: 23, baseType: !16, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !101, file: !2, line: 24, baseType: !105, size: 128, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 465, baseType: !72, align: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !101, file: !2, line: 25, baseType: !107, size: 64, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 465, baseType: !58, align: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !2, line: 26, baseType: !100, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !96, baseType: !78, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !93, file: !2, line: 32, baseType: !25, size: 128, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !93, file: !2, line: 34, baseType: !16, size: 32, align: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !93, file: !2, line: 36, baseType: !16, size: 32, align: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !93, file: !2, line: 37, baseType: !114, size: 32, align: 32, offset: 320)
!114 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!115 = !{}
!116 = !DILocalVariable(name: "allocator", arg: 1, scope: !55, file: !2, line: 12, type: !25)
!117 = !DILocation(line: 12, column: 36, scope: !55)
!118 = !DILocalVariable(name: "s", arg: 2, scope: !55, file: !2, line: 12, type: !72)
!119 = !DILocation(line: 12, column: 54, scope: !55)
!120 = !DILocation(line: 14, column: 46, scope: !55)
!121 = !DILocation(line: 14, column: 26, scope: !55)
!122 = !DILocation(line: 14, column: 9, scope: !55)
!123 = distinct !DISubprogram(name: "tparse_string", linkageName: "std.encoding.json.tparse_string", scope: !2, file: !2, line: 17, type: !124, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !115)
!124 = !DISubroutineType(types: !125)
!125 = !{!58, !72}
!126 = !DILocalVariable(name: "s", arg: 1, scope: !123, file: !2, line: 17, type: !72)
!127 = !DILocation(line: 17, column: 34, scope: !123)
!128 = !DILocation(line: 19, column: 15, scope: !123)
!129 = !DILocation(line: 19, column: 41, scope: !123)
!130 = !DILocation(line: 19, column: 21, scope: !123)
!131 = !DILocation(line: 19, column: 9, scope: !123)
!132 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !2, file: !2, line: 22, type: !133, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !135)
!133 = !DISubroutineType(types: !134)
!134 = !{!58, !25, !18}
!135 = !{!136, !137}
!136 = !DILocalVariable(name: "smem", scope: !132, file: !2, line: 24, type: !25, align: 8)
!137 = !DILocalVariable(name: "context", scope: !138, file: !2, line: 26, type: !13, align: 8)
!138 = distinct !DILexicalBlock(scope: !132, file: !2, line: 25, column: 2)
!139 = !DILocalVariable(name: "allocator", arg: 1, scope: !132, file: !2, line: 22, type: !25)
!140 = !DILocation(line: 22, column: 29, scope: !132)
!141 = !DILocalVariable(name: "s", arg: 2, scope: !132, file: !2, line: 22, type: !18)
!142 = !DILocation(line: 22, column: 49, scope: !132)
!143 = !DILocalVariable(name: "buffer", scope: !144, file: !2, line: 579, type: !160, align: 1)
!144 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !145, file: !145, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !146)
!145 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!146 = !{!143, !147}
!147 = !DILocalVariable(name: "allocator", scope: !144, file: !2, line: 580, type: !148, align: 8)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !149, identifier: "std.core.mem.allocator.OnStackAllocator")
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !148, file: !2, line: 14, baseType: !25, size: 128, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !2, line: 15, baseType: !73, size: 128, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !148, file: !2, line: 16, baseType: !78, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !148, file: !2, line: 17, baseType: !154, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !155, size: 64, align: 64, dwarfAddressSpace: 0)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !156, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.9581")
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !155, file: !2, line: 22, baseType: !70, size: 8, align: 8)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !155, file: !2, line: 23, baseType: !154, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !2, line: 24, baseType: !21, size: 64, align: 64, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 4096, align: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 512, lowerBound: 0)
!163 = !DILocation(line: 579, column: 14, scope: !144, inlinedAt: !164)
!164 = !DILocation(line: 24, column: 2, scope: !132)
!165 = !DILocation(line: 580, column: 19, scope: !144, inlinedAt: !164)
!166 = !DILocation(line: 581, column: 18, scope: !144, inlinedAt: !164)
!167 = !DILocation(line: 581, column: 26, scope: !144, inlinedAt: !164)
!168 = !DILocation(line: 581, column: 2, scope: !144, inlinedAt: !164)
!169 = !DILocation(line: 24, column: 28, scope: !132)
!170 = !DILocation(line: 583, column: 8, scope: !171, inlinedAt: !164)
!171 = distinct !DILexicalBlock(scope: !144, file: !145, line: 583, column: 2)
!172 = !DILocation(line: 26, column: 15, scope: !138)
!173 = !DILocation(line: 26, column: 75, scope: !138)
!174 = !DILocation(line: 26, column: 42, scope: !138)
!175 = !DILocation(line: 26, column: 90, scope: !138)
!176 = !DILocation(line: 26, column: 106, scope: !138)
!177 = !DILocalVariable(name: "state", scope: !178, file: !2, line: 648, type: !180, align: 8)
!178 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !145, file: !145, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !179)
!179 = !{!177}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 420, baseType: !181, align: 8)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !183, identifier: "std.core.mem.allocator.TempAllocator")
!183 = !{!184, !185, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !182, file: !2, line: 33, baseType: !25, size: 128, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !182, file: !2, line: 34, baseType: !186, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !188, identifier: "std.core.mem.allocator.TempAllocatorPage")
!188 = !{!189, !190, !191, !192, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !187, file: !2, line: 56, baseType: !186, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !187, file: !2, line: 57, baseType: !21, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !187, file: !2, line: 58, baseType: !78, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !187, file: !2, line: 59, baseType: !78, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !2, line: 60, baseType: !194, align: 8, offset: 256)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, align: 8, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 0, lowerBound: 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !182, file: !2, line: 35, baseType: !181, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !182, file: !2, line: 36, baseType: !70, size: 8, align: 8, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !182, file: !2, line: 37, baseType: !78, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !182, file: !2, line: 38, baseType: !78, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !182, file: !2, line: 39, baseType: !78, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !182, file: !2, line: 40, baseType: !78, size: 64, align: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !182, file: !2, line: 41, baseType: !78, size: 64, align: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !182, file: !2, line: 42, baseType: !78, size: 64, align: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !2, line: 43, baseType: !194, align: 8, offset: 704)
!206 = !DILocation(line: 648, column: 12, scope: !178, inlinedAt: !207)
!207 = !DILocation(line: 27, column: 3, scope: !138)
!208 = !DILocation(line: 648, column: 20, scope: !178, inlinedAt: !207)
!209 = !DILocation(line: 29, column: 11, scope: !210)
!210 = distinct !DILexicalBlock(scope: !138, file: !2, line: 28, column: 3)
!211 = !DILocation(line: 651, column: 23, scope: !212, inlinedAt: !207)
!212 = distinct !DILexicalBlock(scope: !178, file: !145, line: 650, column: 2)
!213 = !DILocation(line: 651, column: 3, scope: !212, inlinedAt: !207)
!214 = !DILocation(line: 582, column: 8, scope: !215, inlinedAt: !164)
!215 = distinct !DILexicalBlock(scope: !144, file: !145, line: 582, column: 8)
!216 = !DILocation(line: 651, column: 23, scope: !217, inlinedAt: !207)
!217 = distinct !DILexicalBlock(scope: !178, file: !145, line: 650, column: 2)
!218 = !DILocation(line: 651, column: 3, scope: !217, inlinedAt: !207)
!219 = !DILocation(line: 582, column: 8, scope: !220, inlinedAt: !164)
!220 = distinct !DILexicalBlock(scope: !144, file: !145, line: 582, column: 8)
!221 = distinct !DISubprogram(name: "tparse", linkageName: "std.encoding.json.tparse", scope: !2, file: !2, line: 34, type: !222, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !115)
!222 = !DISubroutineType(types: !223)
!223 = !{!58, !18}
!224 = !DILocalVariable(name: "s", arg: 1, scope: !221, file: !2, line: 34, type: !18)
!225 = !DILocation(line: 34, column: 29, scope: !221)
!226 = !DILocation(line: 36, column: 15, scope: !221)
!227 = !DILocation(line: 36, column: 9, scope: !221)
!228 = distinct !DISubprogram(name: "parse_from_token", linkageName: "std.encoding.json.parse_from_token.13396", scope: !2, file: !2, line: 78, type: !229, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !115)
!229 = !DISubroutineType(types: !230)
!230 = !{!58, !231, !12}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "JsonContext*", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!232 = !DILocalVariable(name: "context", arg: 1, scope: !228, file: !2, line: 78, type: !231)
!233 = !DILocation(line: 78, column: 43, scope: !228)
!234 = !DILocalVariable(name: "token", arg: 2, scope: !228, file: !2, line: 78, type: !12)
!235 = !DILocation(line: 78, column: 66, scope: !228)
!236 = !DILocation(line: 246, column: 2, scope: !237, inlinedAt: !239)
!237 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !238, file: !238, line: 241, scopeLine: 241, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!238 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!239 = !DILocation(line: 82, column: 18, scope: !240)
!240 = distinct !DILexicalBlock(scope: !241, file: !2, line: 82, column: 18)
!241 = distinct !DILexicalBlock(scope: !228, file: !2, line: 80, column: 2)
!242 = !DILocation(line: 83, column: 23, scope: !243)
!243 = distinct !DILexicalBlock(scope: !241, file: !2, line: 83, column: 16)
!244 = !DILocation(line: 84, column: 25, scope: !245)
!245 = distinct !DILexicalBlock(scope: !241, file: !2, line: 84, column: 18)
!246 = !DILocation(line: 88, column: 22, scope: !247)
!247 = distinct !DILexicalBlock(scope: !241, file: !2, line: 88, column: 15)
!248 = !DILocation(line: 89, column: 42, scope: !249)
!249 = distinct !DILexicalBlock(scope: !241, file: !2, line: 89, column: 16)
!250 = !DILocation(line: 89, column: 74, scope: !249)
!251 = !DILocation(line: 89, column: 23, scope: !249)
!252 = !DILocation(line: 90, column: 41, scope: !253)
!253 = distinct !DILexicalBlock(scope: !241, file: !2, line: 90, column: 16)
!254 = !DILocation(line: 90, column: 62, scope: !253)
!255 = !DILocation(line: 90, column: 23, scope: !253)
