; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%Matrix4x4 = type { %.anon.410 }
%.anon.410 = type { %.anon.411 }
%.anon.411 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%Matrix4x4.412 = type { %.anon.413 }
%.anon.413 = type { %.anon.414 }
%.anon.414 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%QuaternionNumber = type { %.anon.415 }
%.anon.415 = type { float, float, float, float }
%QuaternionNumber.416 = type { %.anon.417 }
%.anon.417 = type { double, double, double, double }

; Function Attrs: nounwind uwtable(sync)
define weak [3 x float] @"std.math.vector.float[<3>].cross"([3 x float] %0, [3 x float] %1) #0 !dbg !8 {
entry:
  %self = alloca <3 x float>, align 16
  %v2 = alloca <3 x float>, align 16
  %v1 = alloca <3 x float>, align 16
  %v23 = alloca <3 x float>, align 16
  %a = alloca <3 x float>, align 16
  %b = alloca <3 x float>, align 16
  %2 = extractvalue [3 x float] %0, 0, !dbg !16
  %3 = insertelement <3 x float> undef, float %2, i64 0, !dbg !16
  %4 = extractvalue [3 x float] %0, 1, !dbg !16
  %5 = insertelement <3 x float> %3, float %4, i64 1, !dbg !16
  %6 = extractvalue [3 x float] %0, 2, !dbg !16

!305 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!306 = !DILocation(line: 191, column: 12, scope: !274, inlinedAt: !264)
!307 = !DILocation(line: 684, column: 68, scope: !305, inlinedAt: !306)
!308 = !DILocation(line: 669, column: 82, scope: !309, inlinedAt: !310)
!309 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 669, scopeLine: 669, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!310 = !DILocation(line: 684, column: 63, scope: !305, inlinedAt: !306)
!311 = !DILocation(line: 192, column: 6, scope: !274, inlinedAt: !264)
!312 = !DILocation(line: 684, column: 64, scope: !313, inlinedAt: !314)
!313 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!314 = !DILocation(line: 192, column: 12, scope: !274, inlinedAt: !264)
!315 = !DILocation(line: 684, column: 68, scope: !313, inlinedAt: !314)
!316 = !DILocation(line: 669, column: 82, scope: !317, inlinedAt: !318)
!317 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 669, scopeLine: 669, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!318 = !DILocation(line: 684, column: 63, scope: !313, inlinedAt: !314)
!319 = !DILocation(line: 193, column: 6, scope: !274, inlinedAt: !264)
!320 = !DILocation(line: 684, column: 64, scope: !321, inlinedAt: !322)
!321 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!322 = !DILocation(line: 193, column: 12, scope: !274, inlinedAt: !264)
!323 = !DILocation(line: 684, column: 68, scope: !321, inlinedAt: !322)
!324 = !DILocation(line: 669, column: 82, scope: !325, inlinedAt: !326)
!325 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 669, scopeLine: 669, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!326 = !DILocation(line: 684, column: 63, scope: !321, inlinedAt: !322)
!327 = !DILocation(line: 194, column: 6, scope: !274, inlinedAt: !264)
!328 = !DILocation(line: 684, column: 64, scope: !329, inlinedAt: !330)
!329 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!330 = !DILocation(line: 194, column: 12, scope: !274, inlinedAt: !264)
!331 = !DILocation(line: 684, column: 68, scope: !329, inlinedAt: !330)
!332 = !DILocation(line: 669, column: 82, scope: !333, inlinedAt: !334)
!333 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 669, scopeLine: 669, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!334 = !DILocation(line: 684, column: 63, scope: !329, inlinedAt: !330)
!335 = !DILocation(line: 195, column: 6, scope: !274, inlinedAt: !264)
!336 = !DILocation(line: 195, column: 14, scope: !274, inlinedAt: !264)
!337 = !DILocation(line: 195, column: 20, scope: !274, inlinedAt: !264)
!338 = !DILocation(line: 195, column: 26, scope: !274, inlinedAt: !264)
!339 = !DILocation(line: 195, column: 32, scope: !274, inlinedAt: !264)
!340 = !DILocation(line: 196, column: 6, scope: !274, inlinedAt: !264)
!341 = !DILocation(line: 196, column: 11, scope: !274, inlinedAt: !264)
!342 = !DILocation(line: 196, column: 17, scope: !274, inlinedAt: !264)
!343 = !DILocation(line: 196, column: 23, scope: !274, inlinedAt: !264)
!344 = !DILocation(line: 196, column: 29, scope: !274, inlinedAt: !264)
!345 = !DILocation(line: 196, column: 36, scope: !274, inlinedAt: !264)
!346 = !DILocation(line: 196, column: 10, scope: !274, inlinedAt: !264)
!347 = !DILocation(line: 197, column: 6, scope: !274, inlinedAt: !264)
!348 = !DILocation(line: 197, column: 11, scope: !274, inlinedAt: !264)
!349 = !DILocation(line: 197, column: 17, scope: !274, inlinedAt: !264)
!350 = !DILocation(line: 197, column: 23, scope: !274, inlinedAt: !264)
!351 = !DILocation(line: 197, column: 29, scope: !274, inlinedAt: !264)
!352 = !DILocation(line: 197, column: 36, scope: !274, inlinedAt: !264)
!353 = !DILocation(line: 197, column: 10, scope: !274, inlinedAt: !264)
!354 = !DILocation(line: 198, column: 27, scope: !274, inlinedAt: !264)
!355 = !DILocation(line: 198, column: 23, scope: !274, inlinedAt: !264)
!356 = !DILocation(line: 198, column: 31, scope: !274, inlinedAt: !264)
!357 = !DILocation(line: 198, column: 9, scope: !274, inlinedAt: !264)
!358 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !7, file: !7, line: 35, type: !359, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!359 = !DISubroutineType(types: !360)
!360 = !{!11, !11, !361}
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 59, size: 512, align: 32, elements: !362, identifier: "std_math_matrix$float$.Matrix4x4")
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, scope: !361, file: !7, line: 61, baseType: !364, size: 512, align: 32)
!364 = !DICompositeType(tag: DW_TAG_union_type, scope: !361, file: !7, line: 61, size: 512, align: 32, elements: !365)
!365 = !{!366, !386}
!366 = !DIDerivedType(tag: DW_TAG_member, scope: !364, file: !7, line: 63, baseType: !367, size: 512, align: 32)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4.$anon.$anon", scope: !364, file: !7, line: 63, size: 512, align: 32, elements: !368)
!368 = !{!369, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !367, file: !7, line: 65, baseType: !370, size: 32, align: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 4, baseType: !12, align: 4)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !367, file: !7, line: 65, baseType: !370, size: 32, align: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !367, file: !7, line: 65, baseType: !370, size: 32, align: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !367, file: !7, line: 65, baseType: !370, size: 32, align: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !367, file: !7, line: 66, baseType: !370, size: 32, align: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !367, file: !7, line: 66, baseType: !370, size: 32, align: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !367, file: !7, line: 66, baseType: !370, size: 32, align: 32, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !367, file: !7, line: 66, baseType: !370, size: 32, align: 32, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !367, file: !7, line: 67, baseType: !370, size: 32, align: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !367, file: !7, line: 67, baseType: !370, size: 32, align: 32, offset: 288)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !367, file: !7, line: 67, baseType: !370, size: 32, align: 32, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !367, file: !7, line: 67, baseType: !370, size: 32, align: 32, offset: 352)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !367, file: !7, line: 68, baseType: !370, size: 32, align: 32, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !367, file: !7, line: 68, baseType: !370, size: 32, align: 32, offset: 416)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !367, file: !7, line: 68, baseType: !370, size: 32, align: 32, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !367, file: !7, line: 68, baseType: !370, size: 32, align: 32, offset: 480)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !364, file: !7, line: 70, baseType: !387, size: 512, align: 32)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 512, align: 32, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 16, lowerBound: 0)
!390 = !DILocation(line: 35, column: 59, scope: !358)
!391 = !DILocalVariable(name: "self", arg: 1, scope: !358, file: !7, line: 35, type: !11)
!392 = !DILocation(line: 35, column: 36, scope: !358)
!393 = !DILocalVariable(name: "mat", arg: 2, scope: !358, file: !7, line: 35, type: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !7, file: !7, line: 8, baseType: !361, align: 4)
!395 = !DILocation(line: 35, column: 51, scope: !358)
!396 = !DILocation(line: 126, column: 3, scope: !397, inlinedAt: !390)
!397 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 123, scopeLine: 123, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!398 = !DILocation(line: 126, column: 13, scope: !397, inlinedAt: !390)
!399 = !DILocation(line: 126, column: 15, scope: !397, inlinedAt: !390)
!400 = !DILocation(line: 126, column: 20, scope: !397, inlinedAt: !390)
!401 = !DILocation(line: 126, column: 30, scope: !397, inlinedAt: !390)
!402 = !DILocation(line: 126, column: 32, scope: !397, inlinedAt: !390)
!403 = !DILocation(line: 126, column: 37, scope: !397, inlinedAt: !390)
!404 = !DILocation(line: 126, column: 47, scope: !397, inlinedAt: !390)
!405 = !DILocation(line: 126, column: 49, scope: !397, inlinedAt: !390)
!406 = !DILocation(line: 126, column: 54, scope: !397, inlinedAt: !390)
!407 = !DILocation(line: 125, column: 9, scope: !397, inlinedAt: !390)
!408 = !DILocation(line: 127, column: 3, scope: !397, inlinedAt: !390)
!409 = !DILocation(line: 127, column: 13, scope: !397, inlinedAt: !390)
!410 = !DILocation(line: 127, column: 15, scope: !397, inlinedAt: !390)
!411 = !DILocation(line: 127, column: 20, scope: !397, inlinedAt: !390)
!412 = !DILocation(line: 127, column: 30, scope: !397, inlinedAt: !390)
!413 = !DILocation(line: 127, column: 32, scope: !397, inlinedAt: !390)
!414 = !DILocation(line: 127, column: 37, scope: !397, inlinedAt: !390)
!415 = !DILocation(line: 127, column: 47, scope: !397, inlinedAt: !390)
!416 = !DILocation(line: 127, column: 49, scope: !397, inlinedAt: !390)
!417 = !DILocation(line: 127, column: 54, scope: !397, inlinedAt: !390)
!418 = !DILocation(line: 128, column: 3, scope: !397, inlinedAt: !390)
!419 = !DILocation(line: 128, column: 13, scope: !397, inlinedAt: !390)
!420 = !DILocation(line: 128, column: 15, scope: !397, inlinedAt: !390)
!421 = !DILocation(line: 128, column: 20, scope: !397, inlinedAt: !390)
!422 = !DILocation(line: 128, column: 30, scope: !397, inlinedAt: !390)
!423 = !DILocation(line: 128, column: 32, scope: !397, inlinedAt: !390)
!424 = !DILocation(line: 128, column: 37, scope: !397, inlinedAt: !390)
!425 = !DILocation(line: 128, column: 47, scope: !397, inlinedAt: !390)
!426 = !DILocation(line: 128, column: 49, scope: !397, inlinedAt: !390)
!427 = !DILocation(line: 128, column: 54, scope: !397, inlinedAt: !390)
!428 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !7, file: !7, line: 36, type: !429, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!429 = !DISubroutineType(types: !430)
!430 = !{!36, !36, !431}
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 59, size: 1024, align: 64, elements: !432, identifier: "std_math_matrix$double$.Matrix4x4")
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, scope: !431, file: !7, line: 61, baseType: !434, size: 1024, align: 64)
!434 = !DICompositeType(tag: DW_TAG_union_type, scope: !431, file: !7, line: 61, size: 1024, align: 64, elements: !435)
!435 = !{!436, !456}
!436 = !DIDerivedType(tag: DW_TAG_member, scope: !434, file: !7, line: 63, baseType: !437, size: 1024, align: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4.$anon.$anon", scope: !434, file: !7, line: 63, size: 1024, align: 64, elements: !438)
!438 = !{!439, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !437, file: !7, line: 65, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 5, baseType: !37, align: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !437, file: !7, line: 65, baseType: !440, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !437, file: !7, line: 65, baseType: !440, size: 64, align: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !437, file: !7, line: 65, baseType: !440, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !437, file: !7, line: 66, baseType: !440, size: 64, align: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !437, file: !7, line: 66, baseType: !440, size: 64, align: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !437, file: !7, line: 66, baseType: !440, size: 64, align: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !437, file: !7, line: 66, baseType: !440, size: 64, align: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !437, file: !7, line: 67, baseType: !440, size: 64, align: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !437, file: !7, line: 67, baseType: !440, size: 64, align: 64, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !437, file: !7, line: 67, baseType: !440, size: 64, align: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !437, file: !7, line: 67, baseType: !440, size: 64, align: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !437, file: !7, line: 68, baseType: !440, size: 64, align: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !437, file: !7, line: 68, baseType: !440, size: 64, align: 64, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !437, file: !7, line: 68, baseType: !440, size: 64, align: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !437, file: !7, line: 68, baseType: !440, size: 64, align: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !434, file: !7, line: 70, baseType: !457, size: 1024, align: 64)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, align: 64, elements: !388)
!458 = !DILocation(line: 36, column: 60, scope: !428)
!459 = !DILocalVariable(name: "self", arg: 1, scope: !428, file: !7, line: 36, type: !36)
!460 = !DILocation(line: 36, column: 38, scope: !428)
!461 = !DILocalVariable(name: "mat", arg: 2, scope: !428, file: !7, line: 36, type: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !7, file: !7, line: 9, baseType: !431, align: 8)
!463 = !DILocation(line: 36, column: 52, scope: !428)
!464 = !DILocation(line: 126, column: 3, scope: !465, inlinedAt: !458)
!465 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 123, scopeLine: 123, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!466 = !DILocation(line: 126, column: 13, scope: !465, inlinedAt: !458)
!467 = !DILocation(line: 126, column: 15, scope: !465, inlinedAt: !458)
!468 = !DILocation(line: 126, column: 20, scope: !465, inlinedAt: !458)
!469 = !DILocation(line: 126, column: 30, scope: !465, inlinedAt: !458)
!470 = !DILocation(line: 126, column: 32, scope: !465, inlinedAt: !458)
!471 = !DILocation(line: 126, column: 37, scope: !465, inlinedAt: !458)
!472 = !DILocation(line: 126, column: 47, scope: !465, inlinedAt: !458)
!473 = !DILocation(line: 126, column: 49, scope: !465, inlinedAt: !458)
!474 = !DILocation(line: 126, column: 54, scope: !465, inlinedAt: !458)
!475 = !DILocation(line: 125, column: 9, scope: !465, inlinedAt: !458)
!476 = !DILocation(line: 127, column: 3, scope: !465, inlinedAt: !458)
!477 = !DILocation(line: 127, column: 13, scope: !465, inlinedAt: !458)
!478 = !DILocation(line: 127, column: 15, scope: !465, inlinedAt: !458)
!479 = !DILocation(line: 127, column: 20, scope: !465, inlinedAt: !458)
!480 = !DILocation(line: 127, column: 30, scope: !465, inlinedAt: !458)
!481 = !DILocation(line: 127, column: 32, scope: !465, inlinedAt: !458)
!482 = !DILocation(line: 127, column: 37, scope: !465, inlinedAt: !458)
!483 = !DILocation(line: 127, column: 47, scope: !465, inlinedAt: !458)
!484 = !DILocation(line: 127, column: 49, scope: !465, inlinedAt: !458)
!485 = !DILocation(line: 127, column: 54, scope: !465, inlinedAt: !458)
!486 = !DILocation(line: 128, column: 3, scope: !465, inlinedAt: !458)
!487 = !DILocation(line: 128, column: 13, scope: !465, inlinedAt: !458)
!488 = !DILocation(line: 128, column: 15, scope: !465, inlinedAt: !458)
!489 = !DILocation(line: 128, column: 20, scope: !465, inlinedAt: !458)
!490 = !DILocation(line: 128, column: 30, scope: !465, inlinedAt: !458)
!491 = !DILocation(line: 128, column: 32, scope: !465, inlinedAt: !458)
!492 = !DILocation(line: 128, column: 37, scope: !465, inlinedAt: !458)
!493 = !DILocation(line: 128, column: 47, scope: !465, inlinedAt: !458)
!494 = !DILocation(line: 128, column: 49, scope: !465, inlinedAt: !458)
!495 = !DILocation(line: 128, column: 54, scope: !465, inlinedAt: !458)
!496 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !7, file: !7, line: 38, type: !497, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!497 = !DISubroutineType(types: !498)
!498 = !{!12, !11, !11}
!499 = !DILocation(line: 38, column: 51, scope: !496)
!500 = !DILocalVariable(name: "self", arg: 1, scope: !496, file: !7, line: 38, type: !11)
!501 = !DILocation(line: 38, column: 27, scope: !496)
!502 = !DILocalVariable(name: "v2", arg: 2, scope: !496, file: !7, line: 38, type: !11)
!503 = !DILocation(line: 38, column: 44, scope: !496)
!504 = !DILocalVariable(name: "len", scope: !505, file: !7, line: 135, type: !12, align: 4)
!505 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 133, scopeLine: 133, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !506)
!506 = !{!504, !507}
!507 = !DILocalVariable(name: "dot", scope: !505, file: !7, line: 136, type: !12, align: 4)
!508 = !DILocation(line: 135, column: 6, scope: !505, inlinedAt: !499)
!509 = !DILocation(line: 135, column: 21, scope: !505, inlinedAt: !499)
!510 = !DILocation(line: 135, column: 12, scope: !505, inlinedAt: !499)
!511 = !DILocation(line: 641, column: 60, scope: !512, inlinedAt: !513)
!512 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 641, scopeLine: 641, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!513 = !DILocation(line: 642, column: 55, scope: !514, inlinedAt: !510)
!514 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !72, file: !72, line: 642, scopeLine: 642, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!515 = !DILocation(line: 626, column: 78, scope: !516, inlinedAt: !517)
!516 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 626, scopeLine: 626, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!517 = !DILocation(line: 641, column: 59, scope: !512, inlinedAt: !513)
!518 = !DILocation(line: 136, column: 6, scope: !505, inlinedAt: !499)
!519 = !DILocation(line: 641, column: 60, scope: !520, inlinedAt: !521)
!520 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 641, scopeLine: 641, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!521 = !DILocation(line: 136, column: 12, scope: !505, inlinedAt: !499)
!522 = !DILocation(line: 641, column: 64, scope: !520, inlinedAt: !521)
!523 = !DILocation(line: 626, column: 78, scope: !524, inlinedAt: !525)
!524 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 626, scopeLine: 626, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!525 = !DILocation(line: 641, column: 59, scope: !520, inlinedAt: !521)
!526 = !DILocation(line: 128, column: 21, scope: !527, inlinedAt: !528)
!527 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !72, file: !72, line: 125, scopeLine: 125, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!528 = !DILocation(line: 137, column: 9, scope: !505, inlinedAt: !499)
!529 = !DILocation(line: 128, column: 10, scope: !527, inlinedAt: !528)
!530 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !7, file: !7, line: 39, type: !531, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!531 = !DISubroutineType(types: !532)
!532 = !{!37, !36, !36}
!533 = !DILocation(line: 39, column: 54, scope: !530)
!534 = !DILocalVariable(name: "self", arg: 1, scope: !530, file: !7, line: 39, type: !36)
!535 = !DILocation(line: 39, column: 29, scope: !530)
!536 = !DILocalVariable(name: "v2", arg: 2, scope: !530, file: !7, line: 39, type: !36)
!537 = !DILocation(line: 39, column: 47, scope: !530)
!538 = !DILocalVariable(name: "len", scope: !539, file: !7, line: 135, type: !37, align: 8)
!539 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 133, scopeLine: 133, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !540)
!540 = !{!538, !541}
!541 = !DILocalVariable(name: "dot", scope: !539, file: !7, line: 136, type: !37, align: 8)
!542 = !DILocation(line: 135, column: 6, scope: !539, inlinedAt: !533)
!543 = !DILocation(line: 135, column: 21, scope: !539, inlinedAt: !533)
!544 = !DILocation(line: 135, column: 12, scope: !539, inlinedAt: !533)
!545 = !DILocation(line: 684, column: 64, scope: !546, inlinedAt: !547)
!546 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!547 = !DILocation(line: 685, column: 58, scope: !548, inlinedAt: !544)
!548 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !72, file: !72, line: 685, scopeLine: 685, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!549 = !DILocation(line: 669, column: 82, scope: !550, inlinedAt: !551)
!550 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 669, scopeLine: 669, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!551 = !DILocation(line: 684, column: 63, scope: !546, inlinedAt: !547)
!552 = !DILocation(line: 136, column: 6, scope: !539, inlinedAt: !533)
!553 = !DILocation(line: 684, column: 64, scope: !554, inlinedAt: !555)
!554 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!555 = !DILocation(line: 136, column: 12, scope: !539, inlinedAt: !533)
!556 = !DILocation(line: 684, column: 68, scope: !554, inlinedAt: !555)
!557 = !DILocation(line: 669, column: 82, scope: !558, inlinedAt: !559)
!558 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 669, scopeLine: 669, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!559 = !DILocation(line: 684, column: 63, scope: !554, inlinedAt: !555)
!560 = !DILocation(line: 130, column: 20, scope: !561, inlinedAt: !562)
!561 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !72, file: !72, line: 125, scopeLine: 125, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!562 = !DILocation(line: 137, column: 9, scope: !539, inlinedAt: !533)
!563 = !DILocation(line: 130, column: 10, scope: !561, inlinedAt: !562)
!564 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !7, file: !7, line: 41, type: !565, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!565 = !DISubroutineType(types: !566)
!566 = !{!11, !11, !11, !12}
!567 = !DILocation(line: 41, column: 66, scope: !564)
!568 = !DILocalVariable(name: "self", arg: 1, scope: !564, file: !7, line: 41, type: !11)
!569 = !DILocation(line: 41, column: 34, scope: !564)
!570 = !DILocalVariable(name: "n", arg: 2, scope: !564, file: !7, line: 41, type: !11)
!571 = !DILocation(line: 41, column: 51, scope: !564)
!572 = !DILocalVariable(name: "r", arg: 3, scope: !564, file: !7, line: 41, type: !12)
!573 = !DILocation(line: 41, column: 60, scope: !564)
!574 = !DILocalVariable(name: "dot", scope: !575, file: !7, line: 203, type: !12, align: 4)
!575 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 201, scopeLine: 201, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !576)
!576 = !{!574, !577}
!577 = !DILocalVariable(name: "d", scope: !575, file: !7, line: 204, type: !12, align: 4)
!578 = !DILocation(line: 203, column: 6, scope: !575, inlinedAt: !567)
!579 = !DILocation(line: 641, column: 60, scope: !580, inlinedAt: !581)
!580 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 641, scopeLine: 641, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!581 = !DILocation(line: 203, column: 12, scope: !575, inlinedAt: !567)
!582 = !DILocation(line: 641, column: 64, scope: !580, inlinedAt: !581)
!583 = !DILocation(line: 626, column: 78, scope: !584, inlinedAt: !585)
!584 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 626, scopeLine: 626, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!585 = !DILocation(line: 641, column: 59, scope: !580, inlinedAt: !581)
!586 = !DILocation(line: 204, column: 6, scope: !575, inlinedAt: !567)
!587 = !DILocation(line: 204, column: 14, scope: !575, inlinedAt: !567)
!588 = !DILocation(line: 204, column: 27, scope: !575, inlinedAt: !567)
!589 = !DILocation(line: 204, column: 33, scope: !575, inlinedAt: !567)
!590 = !DILocation(line: 204, column: 23, scope: !575, inlinedAt: !567)
!591 = !DILocation(line: 204, column: 10, scope: !575, inlinedAt: !567)
!592 = !DILocation(line: 206, column: 9, scope: !575, inlinedAt: !567)
!593 = !DILocation(line: 206, column: 17, scope: !575, inlinedAt: !567)
!594 = !DILocation(line: 206, column: 21, scope: !575, inlinedAt: !567)
!595 = !DILocation(line: 206, column: 25, scope: !575, inlinedAt: !567)
!596 = !DILocation(line: 206, column: 34, scope: !575, inlinedAt: !567)
!597 = !DILocation(line: 206, column: 30, scope: !575, inlinedAt: !567)
!598 = !DILocation(line: 31, column: 10, scope: !599, inlinedAt: !601)
!599 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !600, file: !600, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!600 = !DIFile(filename: "values.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!601 = !DILocation(line: 513, column: 25, scope: !602, inlinedAt: !603)
!602 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !72, file: !72, line: 513, scopeLine: 513, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!603 = !DILocation(line: 206, column: 40, scope: !575, inlinedAt: !567)
!604 = !DILocation(line: 206, column: 57, scope: !575, inlinedAt: !567)
!605 = !DILocation(line: 206, column: 29, scope: !575, inlinedAt: !567)
!606 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !7, file: !7, line: 42, type: !607, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!607 = !DISubroutineType(types: !608)
!608 = !{!36, !36, !36, !37}
!609 = !DILocation(line: 42, column: 70, scope: !606)
!610 = !DILocalVariable(name: "self", arg: 1, scope: !606, file: !7, line: 42, type: !36)
!611 = !DILocation(line: 42, column: 36, scope: !606)
!612 = !DILocalVariable(name: "n", arg: 2, scope: !606, file: !7, line: 42, type: !36)
!613 = !DILocation(line: 42, column: 54, scope: !606)
!614 = !DILocalVariable(name: "r", arg: 3, scope: !606, file: !7, line: 42, type: !37)
!615 = !DILocation(line: 42, column: 64, scope: !606)
!616 = !DILocalVariable(name: "dot", scope: !617, file: !7, line: 203, type: !37, align: 8)
!617 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 201, scopeLine: 201, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !618)
!618 = !{!616, !619}
!619 = !DILocalVariable(name: "d", scope: !617, file: !7, line: 204, type: !37, align: 8)
!620 = !DILocation(line: 203, column: 6, scope: !617, inlinedAt: !609)
!621 = !DILocation(line: 684, column: 64, scope: !622, inlinedAt: !623)
!622 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!623 = !DILocation(line: 203, column: 12, scope: !617, inlinedAt: !609)
!624 = !DILocation(line: 684, column: 68, scope: !622, inlinedAt: !623)
!625 = !DILocation(line: 669, column: 82, scope: !626, inlinedAt: !627)
!626 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 669, scopeLine: 669, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!627 = !DILocation(line: 684, column: 63, scope: !622, inlinedAt: !623)
!628 = !DILocation(line: 204, column: 6, scope: !617, inlinedAt: !609)
!629 = !DILocation(line: 204, column: 14, scope: !617, inlinedAt: !609)
!630 = !DILocation(line: 204, column: 27, scope: !617, inlinedAt: !609)
!631 = !DILocation(line: 204, column: 33, scope: !617, inlinedAt: !609)
!632 = !DILocation(line: 204, column: 23, scope: !617, inlinedAt: !609)
!633 = !DILocation(line: 204, column: 10, scope: !617, inlinedAt: !609)
!634 = !DILocation(line: 206, column: 9, scope: !617, inlinedAt: !609)
!635 = !DILocation(line: 206, column: 17, scope: !617, inlinedAt: !609)
!636 = !DILocation(line: 206, column: 21, scope: !617, inlinedAt: !609)
!637 = !DILocation(line: 206, column: 25, scope: !617, inlinedAt: !609)
!638 = !DILocation(line: 206, column: 34, scope: !617, inlinedAt: !609)
!639 = !DILocation(line: 206, column: 30, scope: !617, inlinedAt: !609)
!640 = !DILocation(line: 31, column: 10, scope: !641, inlinedAt: !642)
!641 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !600, file: !600, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!642 = !DILocation(line: 513, column: 25, scope: !643, inlinedAt: !644)
!643 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !72, file: !72, line: 513, scopeLine: 513, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!644 = !DILocation(line: 206, column: 40, scope: !617, inlinedAt: !609)
!645 = !DILocation(line: 206, column: 57, scope: !617, inlinedAt: !609)
!646 = !DILocation(line: 206, column: 29, scope: !617, inlinedAt: !609)
!647 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !7, file: !7, line: 44, type: !648, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!648 = !DISubroutineType(types: !649)
!649 = !{!11, !11, !650}
!650 = !DICompositeType(tag: DW_TAG_union_type, name: "QuaternionNumber", scope: !7, file: !7, line: 18, size: 128, align: 32, elements: !651, identifier: "std_math_quaternion$float$.QuaternionNumber")
!651 = !{!652, !660}
!652 = !DIDerivedType(tag: DW_TAG_member, scope: !650, file: !7, line: 20, baseType: !653, size: 128, align: 32)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "QuaternionNumber.$anon", scope: !650, file: !7, line: 20, size: 128, align: 32, elements: !654)
!654 = !{!655, !657, !658, !659}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !653, file: !7, line: 22, baseType: !656, size: 32, align: 32)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 5, baseType: !12, align: 4)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !653, file: !7, line: 22, baseType: !656, size: 32, align: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !653, file: !7, line: 22, baseType: !656, size: 32, align: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !653, file: !7, line: 22, baseType: !656, size: 32, align: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !650, file: !7, line: 24, baseType: !661, size: 128, align: 128)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, align: 32, flags: DIFlagVector, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 4, lowerBound: 0)
!664 = !DILocation(line: 44, column: 62, scope: !647)
!665 = !DILocalVariable(name: "self", arg: 1, scope: !647, file: !7, line: 44, type: !11)
!666 = !DILocation(line: 44, column: 38, scope: !647)
!667 = !DILocalVariable(name: "q", arg: 2, scope: !647, file: !7, line: 44, type: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !7, file: !7, line: 5, baseType: !650, align: 4)
!669 = !DILocation(line: 44, column: 56, scope: !647)
!670 = !DILocation(line: 44, column: 66, scope: !647)
!671 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !7, file: !7, line: 45, type: !672, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!672 = !DISubroutineType(types: !673)
!673 = !{!36, !36, !674}
!674 = !DICompositeType(tag: DW_TAG_union_type, name: "QuaternionNumber", scope: !7, file: !7, line: 18, size: 256, align: 64, elements: !675, identifier: "std_math_quaternion$double$.QuaternionNumber")
!675 = !{!676, !684}
!676 = !DIDerivedType(tag: DW_TAG_member, scope: !674, file: !7, line: 20, baseType: !677, size: 256, align: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "QuaternionNumber.$anon", scope: !674, file: !7, line: 20, size: 256, align: 64, elements: !678)
!678 = !{!679, !681, !682, !683}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !677, file: !7, line: 22, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 6, baseType: !37, align: 8)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !677, file: !7, line: 22, baseType: !680, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !677, file: !7, line: 22, baseType: !680, size: 64, align: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !677, file: !7, line: 22, baseType: !680, size: 64, align: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !674, file: !7, line: 24, baseType: !685, size: 256, align: 128)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, align: 64, flags: DIFlagVector, elements: !662)
!686 = !DILocation(line: 45, column: 63, scope: !671)
!687 = !DILocalVariable(name: "self", arg: 1, scope: !671, file: !7, line: 45, type: !36)
!688 = !DILocation(line: 45, column: 40, scope: !671)
!689 = !DILocalVariable(name: "q", arg: 2, scope: !671, file: !7, line: 45, type: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !7, file: !7, line: 6, baseType: !674, align: 8)
!691 = !DILocation(line: 45, column: 57, scope: !671)
!692 = !DILocation(line: 45, column: 67, scope: !671)
!693 = distinct !DISubprogram(name: "rotate_axis", linkageName: "std.math.vector.float[<3>].rotate_axis", scope: !7, file: !7, line: 47, type: !565, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !15)
!694 = !DILocation(line: 47, column: 77, scope: !693)
!695 = !DILocalVariable(name: "self", arg: 1, scope: !693, file: !7, line: 47, type: !11)
!696 = !DILocation(line: 47, column: 38, scope: !693)
!697 = !DILocalVariable(name: "axis", arg: 2, scope: !693, file: !7, line: 47, type: !11)
!698 = !DILocation(line: 47, column: 55, scope: !693)
!699 = !DILocalVariable(name: "angle", arg: 3, scope: !693, file: !7, line: 47, type: !12)
!700 = !DILocation(line: 47, column: 67, scope: !693)
!701 = !DILocalVariable(name: "len", scope: !702, file: !7, line: 591, type: !12, align: 4)
!702 = distinct !DISubprogram(name: "normalize", linkageName: "normalize", scope: !72, file: !72, line: 589, scopeLine: 589, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !703)
!703 = !{!701}
!704 = !DILocation(line: 591, column: 6, scope: !702, inlinedAt: !705)
!705 = !DILocation(line: 644, column: 56, scope: !706, inlinedAt: !707)
!706 = distinct !DISubprogram(name: "normalize", linkageName: "normalize", scope: !72, file: !72, line: 644, scopeLine: 644, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!707 = !DILocation(line: 149, column: 9, scope: !708, inlinedAt: !694)
!708 = distinct !DISubprogram(name: "rotate_axis_angle", linkageName: "rotate_axis_angle", scope: !7, file: !7, line: 147, scopeLine: 147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !709)
!709 = !{!710, !711, !712}
!710 = !DILocalVariable(name: "w", scope: !708, file: !7, line: 152, type: !11, align: 16)
!711 = !DILocalVariable(name: "wv", scope: !708, file: !7, line: 153, type: !11, align: 16)
!712 = !DILocalVariable(name: "wwv", scope: !708, file: !7, line: 154, type: !11, align: 16)
!713 = !DILocation(line: 641, column: 60, scope: !714, inlinedAt: !715)
!714 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !72, file: !72, line: 641, scopeLine: 641, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!715 = !DILocation(line: 642, column: 55, scope: !716, inlinedAt: !717)
!716 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !72, file: !72, line: 642, scopeLine: 642, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!717 = !DILocation(line: 591, column: 12, scope: !702, inlinedAt: !705)
!718 = !DILocation(line: 641, column: 64, scope: !714, inlinedAt: !715)
!719 = !DILocation(line: 626, column: 78, scope: !720, inlinedAt: !721)
!720 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !72, file: !72, line: 626, scopeLine: 626, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!721 = !DILocation(line: 641, column: 59, scope: !714, inlinedAt: !715)
!722 = !DILocation(line: 592, column: 6, scope: !702, inlinedAt: !705)
!723 = !DILocation(line: 592, column: 23, scope: !702, inlinedAt: !705)
