; ModuleID = 'std::core::runtime'
source_filename = "std::core::runtime"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.119 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%HashMap.121 = type { %"Entry*[].122", %any.123, i32, i32, float }
%"Entry*[].122" = type { ptr, i64 }
%any.123 = type { ptr, i64 }
%"char[].118" = type { ptr, i64 }
%"fn void()[]" = type { ptr, i64 }
%"char[][].124" = type { ptr, i64 }
%"BenchmarkUnit[]" = type { ptr, i64 }
%"any[].125" = type { ptr, i64 }
%BenchmarkUnit = type { %"char[].118", ptr }
%HashMapIterator = type { ptr, i32, i32, ptr }
%"TestUnit[]" = type { ptr, i64 }
%TestUnit = type { %"char[].118", ptr }
%TestContext = type { [25 x i64], %"char[].118", i8, i8, i8, i8, i8, i8, %"char[].118", ptr, ptr, ptr, i64, %File, %stored }
%File = type { ptr }
%stored = type { %File, %File, %any.123 }
%TrackingAllocator = type { %any.123, %HashMap.126, i64, i64 }
%HashMap.126 = type { %"Entry*[].127", %any.123, i32, i32, float }
%"Entry*[].127" = type { ptr, i64 }

@"$ct.std.core.runtime.BenchmarkUnit" = linkonce global %.introspect.119 { i8 10, i64 0, ptr null, i64 24, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.runtime.TestContext.stored" = linkonce global %.introspect.119 { i8 10, i64 0, ptr null, i64 32, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "bench_fn_iters", linkageName: "std.core.runtime.bench_fn_iters.6233", scope: !2, file: !2, line: 6, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "runtime_benchmark.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !4, identifier: "std_collections_map$String$uint$.HashMap")
!4 = !{!5, !30, !37, !38, !39}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !3, file: !2, line: 31, baseType: !6, size: 128, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !7, identifier: "Entry*[]")
!7 = !{!8, !29}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !6, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !12, identifier: "std_collections_map$String$uint$.Entry")
!12 = !{!13, !15, !26, !28}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !11, file: !2, line: 23, baseType: !14, size: 32, align: 32)
!14 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !11, file: !2, line: 24, baseType: !16, size: 128, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 6, baseType: !17, align: 8)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !19, identifier: "char[]")
!19 = !{!20, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !18, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !18, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !25)
!25 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !11, file: !2, line: 25, baseType: !27, size: 32, align: 32, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 6, baseType: !14, align: 4)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !2, line: 26, baseType: !10, size: 64, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !6, baseType: !24, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 32, baseType: !31, size: 128, align: 64, offset: 128)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !32, identifier: "Allocator")
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !31, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !3, file: !2, line: 34, baseType: !14, size: 32, align: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !3, file: !2, line: 36, baseType: !14, size: 32, align: 32, offset: 288)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !3, file: !2, line: 37, baseType: !40, size: 32, align: 32, offset: 320)
!40 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_WARMUP_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS", scope: !2, file: !2, line: 27, type: !43, isLocal: false, isDefinition: true, align: 4)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_MAX_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_MAX_ITERATIONS", scope: !2, file: !2, line: 28, type: !43, isLocal: false, isDefinition: true, align: 4)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "benchmark_warmup_iterations", linkageName: "std.core.runtime.benchmark_warmup_iterations", scope: !2, file: !2, line: 30, type: !14, isLocal: true, isDefinition: true, align: 4)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "benchmark_max_iterations", linkageName: "std.core.runtime.benchmark_max_iterations", scope: !2, file: !2, line: 31, type: !14, isLocal: true, isDefinition: true, align: 4)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "benchmark_clock", linkageName: "std.core.runtime.benchmark_clock.6256", scope: !2, file: !2, line: 52, type: !52, isLocal: true, isDefinition: true, align: 8)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", scope: !2, file: !2, line: 6, baseType: !25, align: 8)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "benchmark_nano_seconds", linkageName: "std.core.runtime.benchmark_nano_seconds.6257", scope: !2, file: !2, line: 53, type: !55, isLocal: true, isDefinition: true, align: 8)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "NanoDuration", scope: !2, file: !2, line: 7, baseType: !56, align: 8)
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "cycle_start", linkageName: "std.core.runtime.cycle_start.6258", scope: !2, file: !2, line: 54, type: !56, isLocal: true, isDefinition: true, align: 8)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "cycle_stop", linkageName: "std.core.runtime.cycle_stop.6259", scope: !2, file: !2, line: 55, type: !56, isLocal: true, isDefinition: true, align: 8)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "benchmark_log", linkageName: "std.core.runtime.benchmark_log.6260", scope: !2, file: !2, line: 56, type: !63, isLocal: true, isDefinition: true, align: 8)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !64, align: 8)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "benchmark_warming", linkageName: "std.core.runtime.benchmark_warming.6261", scope: !2, file: !2, line: 57, type: !68, isLocal: true, isDefinition: true, align: 1)
!68 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "this_iteration", linkageName: "std.core.runtime.this_iteration.6262", scope: !2, file: !2, line: 58, type: !14, isLocal: true, isDefinition: true, align: 4)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "benchmark_stop", linkageName: "std.core.runtime.benchmark_stop.6263", scope: !2, file: !2, line: 59, type: !68, isLocal: true, isDefinition: true, align: 1)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "test_context", linkageName: "std.core.runtime.test_context", scope: !75, file: !75, line: 12, type: !76, isLocal: true, isDefinition: true, align: 8)
!75 = !DIFile(filename: "runtime_test.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestContext*", baseType: !77, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext", scope: !75, file: !75, line: 14, size: 2496, align: 64, elements: !78, identifier: "std.core.runtime.TestContext")
!78 = !{!79, !84, !85, !86, !87, !88, !89, !90, !91, !92, !97, !98, !99, !100, !105}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !77, file: !75, line: 16, baseType: !80, size: 1600, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "JmpBuf", scope: !75, file: !75, line: 55, baseType: !81, align: 8)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 1600, align: 64, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 25, lowerBound: 0)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "test_filter", scope: !77, file: !75, line: 18, baseType: !17, size: 128, align: 64, offset: 1600)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_on_assert", scope: !77, file: !75, line: 20, baseType: !68, size: 8, align: 8, offset: 1728)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "assert_print_backtrace", scope: !77, file: !75, line: 23, baseType: !68, size: 8, align: 8, offset: 1736)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "has_ansi_codes", scope: !77, file: !75, line: 24, baseType: !68, size: 8, align: 8, offset: 1744)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "is_in_panic", scope: !77, file: !75, line: 25, baseType: !68, size: 8, align: 8, offset: 1752)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "is_quiet_mode", scope: !77, file: !75, line: 26, baseType: !68, size: 8, align: 8, offset: 1760)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "is_no_capture", scope: !77, file: !75, line: 27, baseType: !68, size: 8, align: 8, offset: 1768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "current_test_name", scope: !77, file: !75, line: 28, baseType: !17, size: 128, align: 64, offset: 1792)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "setup_fn", scope: !77, file: !75, line: 29, baseType: !93, size: 64, align: 64, offset: 1920)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "TestFn", scope: !75, file: !75, line: 10, baseType: !94, align: 8)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn", baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "teardown_fn", scope: !77, file: !75, line: 30, baseType: !93, size: 64, align: 64, offset: 1984)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "error_buffer", scope: !77, file: !75, line: 32, baseType: !21, size: 64, align: 64, offset: 2048)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "error_buffer_capacity", scope: !77, file: !75, line: 33, baseType: !24, size: 64, align: 64, offset: 2112)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "fake_stdout", scope: !77, file: !75, line: 34, baseType: !101, size: 64, align: 64, offset: 2176)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !77, file: !75, line: 4, size: 64, align: 64, elements: !102, identifier: "std.io.File")
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !101, file: !75, line: 6, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !75, file: !75, line: 368, baseType: !34, align: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "stored", scope: !77, file: !75, line: 35, baseType: !106, size: 256, align: 64, offset: 2240)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext.stored", scope: !77, file: !75, line: 35, size: 256, align: 64, elements: !107, identifier: "std.core.runtime.TestContext.stored")
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "stdout", scope: !106, file: !75, line: 37, baseType: !101, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "stderr", scope: !106, file: !75, line: 38, baseType: !101, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !106, file: !75, line: 39, baseType: !31, size: 128, align: 64, offset: 128)
!111 = !{i32 2, !"Dwarf Version", i32 4}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{i32 2, !"wchar_size", i32 4}
!114 = !{i32 4, !"PIC Level", i32 2}
!115 = !{i32 1, !"uwtable", i32 1}
!116 = !{i32 2, !"frame-pointer", i32 1}
!117 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !118, splitDebugInlining: false)
!118 = !{!0, !41, !44, !46, !48, !50, !53, !57, !59, !61, !66, !69, !71, !73}
!119 = distinct !DISubprogram(name: "benchmark_collection_create", linkageName: "std.core.runtime.benchmark_collection_create", scope: !2, file: !2, line: 14, type: !120, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !133)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !31}
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit[]", size: 128, align: 64, elements: !123, identifier: "BenchmarkUnit[]")
!123 = !{!124, !132}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !122, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkUnit*", baseType: !126, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit", scope: !2, file: !2, line: 8, size: 192, align: 64, elements: !127, identifier: "std.core.runtime.BenchmarkUnit")
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !2, line: 10, baseType: !17, size: 128, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !126, file: !2, line: 11, baseType: !130, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "BenchmarkFn", scope: !2, file: !2, line: 4, baseType: !131, align: 8)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn", baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, baseType: !24, size: 64, align: 64, offset: 64)
!133 = !{!134, !140, !146, !147, !149, !151}
!134 = !DILocalVariable(name: "fns", scope: !119, file: !2, line: 16, type: !135, align: 8)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkFn[]", size: 128, align: 64, elements: !136, identifier: "BenchmarkFn[]")
!136 = !{!137, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !135, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn*", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !135, baseType: !24, size: 64, align: 64, offset: 64)
!140 = !DILocalVariable(name: "names", scope: !119, file: !2, line: 17, type: !141, align: 8)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !142, identifier: "String[]")
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !141, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !17, size: 64, align: 64, dwarfAddressSpace: 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !141, baseType: !24, size: 64, align: 64, offset: 64)
!146 = !DILocalVariable(name: "benchmarks", scope: !119, file: !2, line: 18, type: !122, align: 8)
!147 = !DILocalVariable(name: ".temp", scope: !148, file: !2, line: 19, type: !24, align: 8)
!148 = distinct !DILexicalBlock(scope: !119, file: !2, line: 19, column: 2)
!149 = !DILocalVariable(name: "i", scope: !150, file: !2, line: 19, type: !24, align: 8)
!150 = distinct !DILexicalBlock(scope: !148, file: !2, line: 20, column: 2)
!151 = !DILocalVariable(name: "benchmark", scope: !150, file: !2, line: 19, type: !130, align: 8)
!152 = !DILocalVariable(name: "allocator", arg: 1, scope: !119, file: !2, line: 14, type: !31)
!153 = !DILocation(line: 14, column: 58, scope: !119)
!154 = !DILocation(line: 16, column: 16, scope: !119)
!155 = !DILocation(line: 16, column: 22, scope: !119)
!156 = !DILocation(line: 17, column: 11, scope: !119)
!157 = !DILocation(line: 17, column: 19, scope: !119)
!158 = !DILocation(line: 18, column: 18, scope: !119)
!159 = !DILocation(line: 18, column: 80, scope: !119)
!160 = !DILocation(line: 304, column: 55, scope: !161, inlinedAt: !163)
!161 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !162, file: !162, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!162 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!163 = !DILocation(line: 287, column: 9, scope: !164, inlinedAt: !165)
!164 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !162, file: !162, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!165 = !DILocation(line: 18, column: 31, scope: !119)
!166 = !DILocation(line: 304, column: 40, scope: !161, inlinedAt: !163)
!167 = !DILocation(line: 80, column: 6, scope: !168, inlinedAt: !169)
!168 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !162, file: !162, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!169 = !DILocation(line: 304, column: 18, scope: !161, inlinedAt: !163)
!170 = !DILocation(line: 80, column: 20, scope: !168, inlinedAt: !169)
!171 = !DILocation(line: 43, column: 71, scope: !172, inlinedAt: !173)
!172 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !162, file: !162, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!173 = !DILocation(line: 86, column: 10, scope: !168, inlinedAt: !169)
!174 = !DILocation(line: 304, column: 67, scope: !161, inlinedAt: !163)
!175 = !DILocation(line: 19, column: 26, scope: !148)
!176 = !DILocation(line: 19, column: 11, scope: !148)
!177 = !DILocation(line: 19, column: 11, scope: !150)
!178 = !DILocation(line: 19, column: 14, scope: !150)
!179 = !DILocation(line: 19, column: 26, scope: !150)
!180 = !DILocation(line: 21, column: 21, scope: !181)
!181 = distinct !DILexicalBlock(scope: !150, file: !2, line: 20, column: 2)
!182 = !DILocation(line: 21, column: 27, scope: !181)
!183 = !DILocation(line: 21, column: 31, scope: !181)
!184 = !DILocation(line: 21, column: 35, scope: !181)
!185 = !DILocation(line: 21, column: 3, scope: !181)
!186 = !DILocation(line: 21, column: 14, scope: !181)
!187 = !DILocation(line: 22, column: 31, scope: !181)
!188 = !DILocation(line: 22, column: 37, scope: !181)
!189 = !DILocation(line: 22, column: 8, scope: !181)
!190 = !DILocation(line: 22, column: 69, scope: !181)
!191 = !DILocation(line: 22, column: 57, scope: !181)
!192 = !DILocation(line: 22, column: 63, scope: !181)
!193 = !DILocation(line: 22, column: 42, scope: !181)
!194 = !DILocation(line: 24, column: 9, scope: !119)
!195 = distinct !DISubprogram(name: "set_benchmark_warmup_iterations", linkageName: "std.core.runtime.set_benchmark_warmup_iterations", scope: !2, file: !2, line: 33, type: !196, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !198)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !14}
!198 = !{}
!199 = !DILocalVariable(name: "value", arg: 1, scope: !195, file: !2, line: 33, type: !14)
!200 = !DILocation(line: 33, column: 46, scope: !195)
!201 = !DILocation(line: 35, column: 35, scope: !195)
!202 = distinct !DISubprogram(name: "set_benchmark_max_iterations", linkageName: "std.core.runtime.set_benchmark_max_iterations", scope: !2, file: !2, line: 38, type: !196, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !203)
!203 = !{!204, !214, !215}
!204 = !DILocalVariable(name: ".temp", scope: !205, file: !2, line: 42, type: !206, align: 8)
!205 = distinct !DILexicalBlock(scope: !202, file: !2, line: 42, column: 2)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashMapKeyIterator", scope: !2, file: !2, line: 557, baseType: !207, align: 8)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMapIterator", scope: !2, file: !2, line: 548, size: 192, align: 64, elements: !208, identifier: "std_collections_map$String$uint$.HashMapIterator")
!208 = !{!209, !211, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !207, file: !2, line: 550, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "HashMap*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "top_index", scope: !207, file: !2, line: 551, baseType: !43, size: 32, align: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !207, file: !2, line: 552, baseType: !43, size: 32, align: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "current_entry", scope: !207, file: !2, line: 553, baseType: !10, size: 64, align: 64, offset: 128)
!214 = !DILocalVariable(name: ".temp", scope: !205, file: !2, line: 42, type: !24, align: 8)
!215 = !DILocalVariable(name: "k", scope: !216, file: !2, line: 42, type: !16, align: 8)
!216 = distinct !DILexicalBlock(scope: !205, file: !2, line: 42, column: 42)
!217 = !DILocalVariable(name: "value", arg: 1, scope: !202, file: !2, line: 38, type: !14)
!218 = !DILocation(line: 38, column: 43, scope: !202)
!219 = !DILocation(line: 40, column: 12, scope: !202)
!220 = !DILocation(line: 41, column: 32, scope: !202)
!221 = !DILocation(line: 42, column: 15, scope: !205)
!222 = !DILocation(line: 42, column: 11, scope: !216)
!223 = !DILocation(line: 42, column: 15, scope: !216)
!224 = !DILocation(line: 42, column: 62, scope: !216)
!225 = !DILocation(line: 42, column: 42, scope: !216)
!226 = distinct !DISubprogram(name: "set_benchmark_func_iterations", linkageName: "std.core.runtime.set_benchmark_func_iterations", scope: !2, file: !2, line: 45, type: !227, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !198)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !17, !14}
!229 = !DILocalVariable(name: "func", arg: 1, scope: !226, file: !2, line: 45, type: !17)
!230 = !DILocation(line: 45, column: 46, scope: !226)
!231 = !DILocalVariable(name: "value", arg: 2, scope: !226, file: !2, line: 45, type: !14)
!232 = !DILocation(line: 45, column: 57, scope: !226)
!233 = !DILocation(line: 47, column: 9, scope: !226)
!234 = !DILocation(line: 48, column: 25, scope: !226)
!235 = !DILocation(line: 48, column: 2, scope: !226)
!236 = distinct !DISubprogram(name: "run_benchmarks", linkageName: "std.core.runtime.run_benchmarks", scope: !2, file: !2, line: 87, type: !237, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !239)
!237 = !DISubroutineType(types: !238)
!238 = !{!68, !122}
!239 = !{!240, !241, !243, !245, !246, !247, !249, !251, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!240 = !DILocalVariable(name: "max_name", scope: !236, file: !2, line: 89, type: !24, align: 8)
!241 = !DILocalVariable(name: ".temp", scope: !242, file: !2, line: 91, type: !24, align: 8)
!242 = distinct !DILexicalBlock(scope: !236, file: !2, line: 91, column: 2)
!243 = !DILocalVariable(name: "unit", scope: !244, file: !2, line: 91, type: !125, align: 8)
!244 = distinct !DILexicalBlock(scope: !242, file: !2, line: 92, column: 2)
!245 = !DILocalVariable(name: "len", scope: !236, file: !2, line: 96, type: !24, align: 8)
!246 = !DILocalVariable(name: "name", scope: !236, file: !2, line: 98, type: !63, align: 8)
!247 = !DILocalVariable(name: ".temp", scope: !248, file: !2, line: 107, type: !24, align: 8)
!248 = distinct !DILexicalBlock(scope: !236, file: !2, line: 107, column: 2)
!249 = !DILocalVariable(name: "unit", scope: !250, file: !2, line: 107, type: !126, align: 8)
!250 = distinct !DILexicalBlock(scope: !248, file: !2, line: 108, column: 2)
!251 = !DILocalVariable(name: "i", scope: !252, file: !2, line: 115, type: !14, align: 4)
!252 = distinct !DILexicalBlock(scope: !253, file: !2, line: 115, column: 3)
!253 = distinct !DILexicalBlock(scope: !250, file: !2, line: 108, column: 2)
!254 = !DILocalVariable(name: "running_timer", scope: !253, file: !2, line: 121, type: !55, align: 8)
!255 = !DILocalVariable(name: "total_clocks", scope: !253, file: !2, line: 122, type: !56, align: 8)
!256 = !DILocalVariable(name: "current_benchmark_iterations", scope: !253, file: !2, line: 124, type: !14, align: 4)
!257 = !DILocalVariable(name: "perc_str", scope: !253, file: !2, line: 125, type: !18, align: 8)
!258 = !DILocalVariable(name: "perc", scope: !253, file: !2, line: 126, type: !43, align: 4)
!259 = !DILocalVariable(name: "print_step", scope: !253, file: !2, line: 127, type: !14, align: 4)
!260 = !DILocalVariable(name: "clock_cycles", scope: !253, file: !2, line: 151, type: !40, align: 4)
!261 = !DILocalVariable(name: "measurement", scope: !253, file: !2, line: 152, type: !40, align: 4)
!262 = !DILocalVariable(name: "units", scope: !253, file: !2, line: 153, type: !141, align: 8)
!263 = !DILocalVariable(name: "adjusted_measurement", scope: !253, file: !2, line: 155, type: !40, align: 4)
!264 = !DILocalVariable(name: "adjusted_runtime_total", scope: !253, file: !2, line: 157, type: !40, align: 4)
!265 = !DILocalVariable(name: "benchmarks", arg: 1, scope: !236, file: !2, line: 87, type: !122)
!266 = !DILocation(line: 87, column: 40, scope: !236)
!267 = !DILocation(line: 89, column: 6, scope: !236)
!268 = !DILocation(line: 91, column: 19, scope: !242)
!269 = !DILocation(line: 91, column: 12, scope: !244)
!270 = !DILocation(line: 91, column: 19, scope: !244)
!271 = !DILocation(line: 93, column: 7, scope: !272)
!272 = distinct !DILexicalBlock(scope: !244, file: !2, line: 92, column: 2)
!273 = !DILocation(line: 93, column: 18, scope: !272)
!274 = !DILocation(line: 93, column: 44, scope: !272)
!275 = !DILocation(line: 96, column: 6, scope: !236)
!276 = !DILocation(line: 96, column: 12, scope: !236)
!277 = !DILocation(line: 98, column: 10, scope: !236)
!278 = !DILocation(line: 98, column: 17, scope: !236)
!279 = !DILocation(line: 99, column: 26, scope: !236)
!280 = !DILocation(line: 99, column: 2, scope: !236)
!281 = !DILocation(line: 395, column: 27, scope: !282, inlinedAt: !285)
!282 = distinct !DILexicalBlock(scope: !284, file: !283, line: 396, column: 1)
!283 = !DIFile(filename: "dstring.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!284 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !283, file: !283, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!285 = !DILocation(line: 100, column: 2, scope: !236)
!286 = !DILocation(line: 405, column: 4, scope: !284, inlinedAt: !285)
!287 = !DILocation(line: 101, column: 26, scope: !236)
!288 = !DILocation(line: 101, column: 32, scope: !236)
!289 = !DILocation(line: 101, column: 2, scope: !236)
!290 = !DILocation(line: 242, column: 16, scope: !291, inlinedAt: !293)
!291 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !292, file: !292, line: 240, scopeLine: 240, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!292 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io")
!293 = !DILocation(line: 103, column: 2, scope: !236)
!294 = !DILocalVariable(name: "len", scope: !295, file: !2, line: 216, type: !24, align: 8)
!295 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !292, file: !292, line: 214, scopeLine: 214, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117, retainedNodes: !296)
!296 = !{!294}
!297 = !DILocation(line: 216, column: 6, scope: !295, inlinedAt: !298)
!298 = !DILocation(line: 242, column: 2, scope: !291, inlinedAt: !293)
!299 = !DILocation(line: 162, column: 35, scope: !300, inlinedAt: !301)
!300 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !292, file: !292, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!301 = !DILocation(line: 216, column: 12, scope: !295, inlinedAt: !298)
!302 = !DILocation(line: 162, column: 25, scope: !300, inlinedAt: !301)
!303 = !DILocation(line: 217, column: 2, scope: !295, inlinedAt: !298)
!304 = !DILocation(line: 222, column: 4, scope: !295, inlinedAt: !298)
!305 = !DILocation(line: 224, column: 9, scope: !295, inlinedAt: !298)
!306 = !DILocation(line: 105, column: 2, scope: !236)
!307 = !DILocation(line: 107, column: 18, scope: !248)
!308 = !DILocation(line: 107, column: 11, scope: !250)
!309 = !DILocation(line: 107, column: 18, scope: !250)
!310 = !DILocation(line: 110, column: 36, scope: !253)
!311 = !DILocation(line: 110, column: 3, scope: !253)
!312 = !DILocation(line: 111, column: 27, scope: !253)
!313 = !DILocation(line: 111, column: 38, scope: !253)
!314 = !DILocation(line: 111, column: 3, scope: !253)
!315 = !DILocation(line: 112, column: 21, scope: !253)
!316 = !DILocation(line: 112, column: 3, scope: !253)
!317 = !DILocation(line: 114, column: 23, scope: !253)
!318 = !DILocation(line: 115, column: 13, scope: !252)
!319 = !DILocation(line: 115, column: 17, scope: !252)
!320 = !DILocation(line: 115, column: 20, scope: !252)
!321 = !DILocation(line: 115, column: 24, scope: !252)
!322 = !DILocation(line: 117, column: 4, scope: !323)
!323 = distinct !DILexicalBlock(scope: !252, file: !2, line: 116, column: 3)
!324 = !DILocation(line: 115, column: 53, scope: !252)
!325 = !DILocation(line: 119, column: 23, scope: !253)
!326 = !DILocation(line: 121, column: 16, scope: !253)
!327 = !DILocation(line: 122, column: 8, scope: !253)
!328 = !DILocation(line: 124, column: 8, scope: !253)
!329 = !DILocation(line: 124, column: 39, scope: !253)
!330 = !DILocation(line: 124, column: 68, scope: !253)
!331 = !DILocation(line: 125, column: 10, scope: !253)
!332 = !DILocation(line: 126, column: 7, scope: !253)
!333 = !DILocation(line: 126, column: 14, scope: !253)
!334 = !DILocation(line: 127, column: 8, scope: !253)
!335 = !DILocation(line: 127, column: 21, scope: !253)
!336 = !DILocation(line: 129, column: 25, scope: !337)
!337 = distinct !DILexicalBlock(scope: !253, file: !2, line: 129, column: 3)
!338 = !DILocation(line: 129, column: 28, scope: !337)
!339 = !DILocation(line: 129, column: 45, scope: !337)
!340 = !DILocation(line: 131, column: 13, scope: !341)
!341 = distinct !DILexicalBlock(scope: !337, file: !2, line: 130, column: 3)
!342 = !DILocation(line: 131, column: 30, scope: !341)
!343 = !DILocation(line: 131, column: 8, scope: !341)
!344 = !DILocation(line: 133, column: 5, scope: !345)
!345 = distinct !DILexicalBlock(scope: !341, file: !2, line: 132, column: 4)
!346 = !DILocation(line: 133, column: 36, scope: !345)
!347 = !DILocation(line: 133, column: 53, scope: !345)
!348 = !DILocation(line: 133, column: 35, scope: !345)
!349 = !DILocation(line: 31, column: 10, scope: !350, inlinedAt: !352)
!350 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !351, file: !351, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!351 = !DIFile(filename: "values.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!352 = !DILocation(line: 314, column: 27, scope: !353, inlinedAt: !355)
!353 = distinct !DISubprogram(name: "floor", linkageName: "floor", scope: !354, file: !354, line: 314, scopeLine: 314, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!354 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/math")
!355 = !DILocation(line: 133, column: 17, scope: !345)
!356 = !DILocation(line: 134, column: 36, scope: !345)
!357 = !DILocation(line: 134, column: 53, scope: !345)
!358 = !DILocation(line: 134, column: 29, scope: !345)
!359 = !DILocation(line: 242, column: 25, scope: !360, inlinedAt: !361)
!360 = distinct !DISubprogram(name: "ceil", linkageName: "ceil", scope: !354, file: !354, line: 242, scopeLine: 242, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!361 = !DILocation(line: 134, column: 12, scope: !345)
!362 = !DILocation(line: 136, column: 44, scope: !345)
!363 = !DILocation(line: 136, column: 61, scope: !345)
!364 = !DILocation(line: 136, column: 80, scope: !345)
!365 = !DILocation(line: 136, column: 96, scope: !345)
!366 = !DILocation(line: 136, column: 126, scope: !345)
!367 = !DILocation(line: 136, column: 5, scope: !345)
!368 = !DILocation(line: 137, column: 5, scope: !345)
!369 = !DILocation(line: 63, column: 20, scope: !370, inlinedAt: !371)
!370 = distinct !DISubprogram(name: "@start_benchmark", linkageName: "@start_benchmark", scope: !2, file: !2, line: 61, scopeLine: 61, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!371 = !DILocation(line: 140, column: 4, scope: !341)
!372 = !DILocation(line: 64, column: 16, scope: !370, inlinedAt: !371)
!373 = !DILocation(line: 142, column: 4, scope: !341)
!374 = !DILocation(line: 143, column: 8, scope: !341)
!375 = !DILocation(line: 109, column: 9, scope: !376)
!376 = distinct !DILexicalBlock(scope: !253, file: !2, line: 109, column: 9)
!377 = !DILocation(line: 145, column: 8, scope: !341)
!378 = !DILocation(line: 69, column: 27, scope: !379, inlinedAt: !380)
!379 = distinct !DISubprogram(name: "@end_benchmark", linkageName: "@end_benchmark", scope: !2, file: !2, line: 67, scopeLine: 67, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!380 = !DILocation(line: 145, column: 52, scope: !341)
!381 = !DILocation(line: 70, column: 15, scope: !379, inlinedAt: !380)
!382 = !DILocation(line: 147, column: 4, scope: !341)
!383 = !DILocation(line: 147, column: 20, scope: !341)
!384 = !DILocation(line: 147, column: 33, scope: !341)
!385 = !DILocation(line: 148, column: 4, scope: !341)
!386 = !DILocation(line: 148, column: 21, scope: !341)
!387 = !DILocation(line: 129, column: 77, scope: !337)
!388 = !DILocation(line: 129, column: 118, scope: !337)
!389 = !DILocation(line: 151, column: 9, scope: !253)
!390 = !DILocation(line: 151, column: 24, scope: !253)
!391 = !DILocation(line: 151, column: 46, scope: !253)
!392 = !DILocation(line: 152, column: 9, scope: !253)
!393 = !DILocation(line: 152, column: 23, scope: !253)
!394 = !DILocation(line: 152, column: 46, scope: !253)
!395 = !DILocation(line: 153, column: 12, scope: !253)
!396 = !DILocation(line: 155, column: 9, scope: !253)
!397 = !DILocation(line: 155, column: 32, scope: !253)
!398 = !DILocation(line: 156, column: 3, scope: !253)
!399 = !DILocation(line: 156, column: 10, scope: !400)
!400 = distinct !DILexicalBlock(scope: !253, file: !2, line: 156, column: 3)
!401 = !DILocation(line: 156, column: 40, scope: !400)
!402 = !DILocation(line: 157, column: 9, scope: !253)
!403 = !DILocation(line: 157, column: 34, scope: !253)
!404 = !DILocation(line: 158, column: 3, scope: !253)
!405 = !DILocation(line: 158, column: 10, scope: !406)
!406 = distinct !DILexicalBlock(scope: !253, file: !2, line: 158, column: 3)
!407 = !DILocation(line: 158, column: 42, scope: !406)
!408 = !DILocation(line: 160, column: 23, scope: !253)
!409 = !DILocation(line: 160, column: 3, scope: !253)
!410 = !DILocation(line: 163, column: 4, scope: !253)
!411 = !DILocation(line: 164, column: 4, scope: !253)
!412 = !DILocation(line: 67, column: 10, scope: !413, inlinedAt: !414)
!413 = distinct !DISubprogram(name: "promote_int_same", linkageName: "promote_int_same", scope: !351, file: !351, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!414 = !DILocation(line: 344, column: 15, scope: !415, inlinedAt: !416)
!415 = distinct !DISubprogram(name: "log", linkageName: "log", scope: !354, file: !354, line: 342, scopeLine: 342, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!416 = !DILocation(line: 164, column: 40, scope: !253)
!417 = !DILocation(line: 62, column: 11, scope: !418, inlinedAt: !419)
!418 = distinct !DISubprogram(name: "promote_int_same", linkageName: "promote_int_same", scope: !351, file: !351, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!419 = !DILocation(line: 344, column: 58, scope: !415, inlinedAt: !416)
!420 = !DILocation(line: 344, column: 9, scope: !415, inlinedAt: !416)
!421 = !DILocation(line: 31, column: 10, scope: !422, inlinedAt: !423)
!422 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !351, file: !351, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!423 = !DILocation(line: 314, column: 27, scope: !424, inlinedAt: !425)
!424 = distinct !DISubprogram(name: "floor", linkageName: "floor", scope: !354, file: !354, line: 314, scopeLine: 314, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!425 = !DILocation(line: 164, column: 23, scope: !253)
!426 = !DILocation(line: 398, column: 19, scope: !427, inlinedAt: !428)
!427 = distinct !DISubprogram(name: "min", linkageName: "min", scope: !354, file: !354, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!428 = !DILocation(line: 164, column: 10, scope: !253)
!429 = !DILocation(line: 165, column: 4, scope: !253)
!430 = !DILocation(line: 166, column: 4, scope: !253)
!431 = !DILocation(line: 167, column: 4, scope: !253)
!432 = !DILocation(line: 168, column: 4, scope: !253)
!433 = !DILocation(line: 168, column: 50, scope: !253)
!434 = !DILocation(line: 67, column: 10, scope: !435, inlinedAt: !436)
!435 = distinct !DISubprogram(name: "promote_int_same", linkageName: "promote_int_same", scope: !351, file: !351, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!436 = !DILocation(line: 344, column: 15, scope: !437, inlinedAt: !438)
!437 = distinct !DISubprogram(name: "log", linkageName: "log", scope: !354, file: !354, line: 342, scopeLine: 342, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!438 = !DILocation(line: 168, column: 40, scope: !253)
!439 = !DILocation(line: 62, column: 11, scope: !440, inlinedAt: !441)
!440 = distinct !DISubprogram(name: "promote_int_same", linkageName: "promote_int_same", scope: !351, file: !351, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!441 = !DILocation(line: 344, column: 58, scope: !437, inlinedAt: !438)
!442 = !DILocation(line: 344, column: 9, scope: !437, inlinedAt: !438)
!443 = !DILocation(line: 31, column: 10, scope: !444, inlinedAt: !445)
!444 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !351, file: !351, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!445 = !DILocation(line: 314, column: 27, scope: !446, inlinedAt: !447)
!446 = distinct !DISubprogram(name: "floor", linkageName: "floor", scope: !354, file: !354, line: 314, scopeLine: 314, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!447 = !DILocation(line: 168, column: 23, scope: !253)
!448 = !DILocation(line: 398, column: 19, scope: !449, inlinedAt: !450)
!449 = distinct !DISubprogram(name: "min", linkageName: "min", scope: !354, file: !354, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!450 = !DILocation(line: 168, column: 10, scope: !253)
!451 = !DILocation(line: 161, column: 3, scope: !253)
!452 = !DILocation(line: 109, column: 9, scope: !453)
!453 = distinct !DILexicalBlock(scope: !253, file: !2, line: 109, column: 9)
!454 = !DILocation(line: 172, column: 41, scope: !236)
!455 = !DILocation(line: 172, column: 57, scope: !236)
!456 = !DILocation(line: 172, column: 84, scope: !236)
!457 = !DILocation(line: 172, column: 2, scope: !236)
!458 = !DILocation(line: 173, column: 9, scope: !236)
!459 = distinct !DISubprogram(name: "default_benchmark_runner", linkageName: "std.core.runtime.default_benchmark_runner", scope: !2, file: !2, line: 176, type: !460, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !198)
!460 = !DISubroutineType(types: !461)
!461 = !{!68, !141}
!462 = !DILocalVariable(name: "args", arg: 1, scope: !459, file: !2, line: 176, type: !141)
!463 = !DILocation(line: 176, column: 43, scope: !459)
!464 = !DILocalVariable(name: "state", scope: !465, file: !2, line: 648, type: !468, align: 8)
!465 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !466, file: !466, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117, retainedNodes: !467)
!466 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!467 = !{!464}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 420, baseType: !469, align: 8)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !470, size: 64, align: 64, dwarfAddressSpace: 0)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !471, identifier: "std.core.mem.allocator.TempAllocator")
!471 = !{!472, !473, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !470, file: !2, line: 33, baseType: !31, size: 128, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !470, file: !2, line: 34, baseType: !474, size: 64, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !475, size: 64, align: 64, dwarfAddressSpace: 0)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !476, identifier: "std.core.mem.allocator.TempAllocatorPage")
!476 = !{!477, !478, !479, !480, !481}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !475, file: !2, line: 56, baseType: !474, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !475, file: !2, line: 57, baseType: !34, size: 64, align: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !475, file: !2, line: 58, baseType: !24, size: 64, align: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !475, file: !2, line: 59, baseType: !24, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !475, file: !2, line: 60, baseType: !482, align: 8, offset: 256)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, align: 8, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 0, lowerBound: 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !470, file: !2, line: 35, baseType: !469, size: 64, align: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !470, file: !2, line: 36, baseType: !68, size: 8, align: 8, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !470, file: !2, line: 37, baseType: !24, size: 64, align: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !470, file: !2, line: 38, baseType: !24, size: 64, align: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !470, file: !2, line: 39, baseType: !24, size: 64, align: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !470, file: !2, line: 40, baseType: !24, size: 64, align: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !470, file: !2, line: 41, baseType: !24, size: 64, align: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !470, file: !2, line: 42, baseType: !24, size: 64, align: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !470, file: !2, line: 43, baseType: !482, align: 8, offset: 704)
!494 = !DILocation(line: 648, column: 12, scope: !465, inlinedAt: !495)
!495 = !DILocation(line: 176, column: 52, scope: !459)
!496 = !DILocation(line: 648, column: 20, scope: !465, inlinedAt: !495)
!497 = !DILocation(line: 178, column: 21, scope: !498)
!498 = distinct !DILexicalBlock(scope: !459, file: !2, line: 177, column: 1)
!499 = !DILocation(line: 20, column: 68, scope: !500, inlinedAt: !501)
!500 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !283, file: !283, line: 20, scopeLine: 20, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!501 = !DILocation(line: 178, column: 2, scope: !498)
!502 = !DILocation(line: 185, column: 52, scope: !498)
!503 = !DILocation(line: 185, column: 24, scope: !498)
!504 = !DILocation(line: 185, column: 9, scope: !498)
!505 = !DILocation(line: 181, column: 7, scope: !506)
!506 = distinct !DILexicalBlock(scope: !498, file: !2, line: 180, column: 2)
!507 = !DILocation(line: 181, column: 87, scope: !506)
!508 = !DILocation(line: 181, column: 28, scope: !506)
!509 = !DILocation(line: 182, column: 3, scope: !506)
!510 = !DILocation(line: 651, column: 23, scope: !511, inlinedAt: !495)
!511 = distinct !DILexicalBlock(scope: !465, file: !466, line: 650, column: 2)
!512 = !DILocation(line: 651, column: 3, scope: !511, inlinedAt: !495)
!513 = distinct !DISubprogram(name: "test_collection_create", linkageName: "std.core.runtime.test_collection_create", scope: !75, file: !75, line: 49, type: !514, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !525)
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !31}
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit[]", size: 128, align: 64, elements: !517, identifier: "TestUnit[]")
!517 = !{!518, !524}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !516, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestUnit*", baseType: !520, size: 64, align: 64, dwarfAddressSpace: 0)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit", scope: !75, file: !75, line: 43, size: 192, align: 64, elements: !521, identifier: "std.core.runtime.TestUnit")
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !520, file: !75, line: 45, baseType: !17, size: 128, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !520, file: !75, line: 46, baseType: !93, size: 64, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !516, baseType: !24, size: 64, align: 64, offset: 64)
!525 = !{!526, !532, !533, !534, !536, !538}
!526 = !DILocalVariable(name: "fns", scope: !513, file: !75, line: 51, type: !527, align: 8)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestFn[]", size: 128, align: 64, elements: !528, identifier: "TestFn[]")
!528 = !{!529, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !527, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn*", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !527, baseType: !24, size: 64, align: 64, offset: 64)
!532 = !DILocalVariable(name: "names", scope: !513, file: !75, line: 52, type: !141, align: 8)
!533 = !DILocalVariable(name: "tests", scope: !513, file: !75, line: 53, type: !516, align: 8)
!534 = !DILocalVariable(name: ".temp", scope: !535, file: !75, line: 54, type: !24, align: 8)
!535 = distinct !DILexicalBlock(scope: !513, file: !75, line: 54, column: 2)
!536 = !DILocalVariable(name: "i", scope: !537, file: !75, line: 54, type: !24, align: 8)
!537 = distinct !DILexicalBlock(scope: !535, file: !75, line: 55, column: 2)
!538 = !DILocalVariable(name: "test", scope: !537, file: !75, line: 54, type: !93, align: 8)
!539 = !DILocalVariable(name: "allocator", arg: 1, scope: !513, file: !75, line: 49, type: !31)
!540 = !DILocation(line: 49, column: 48, scope: !513)
!541 = !DILocation(line: 51, column: 11, scope: !513)
!542 = !DILocation(line: 51, column: 17, scope: !513)
!543 = !DILocation(line: 52, column: 11, scope: !513)
!544 = !DILocation(line: 52, column: 19, scope: !513)
!545 = !DILocation(line: 53, column: 13, scope: !513)
!546 = !DILocation(line: 53, column: 65, scope: !513)
!547 = !DILocation(line: 304, column: 55, scope: !548, inlinedAt: !549)
!548 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !162, file: !162, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!549 = !DILocation(line: 287, column: 9, scope: !550, inlinedAt: !551)
!550 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !162, file: !162, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!551 = !DILocation(line: 53, column: 21, scope: !513)
!552 = !DILocation(line: 304, column: 40, scope: !548, inlinedAt: !549)
!553 = !DILocation(line: 80, column: 6, scope: !554, inlinedAt: !555)
!554 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !162, file: !162, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!555 = !DILocation(line: 304, column: 18, scope: !548, inlinedAt: !549)
!556 = !DILocation(line: 80, column: 20, scope: !554, inlinedAt: !555)
!557 = !DILocation(line: 43, column: 71, scope: !558, inlinedAt: !559)
!558 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !162, file: !162, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!559 = !DILocation(line: 86, column: 10, scope: !554, inlinedAt: !555)
!560 = !DILocation(line: 304, column: 67, scope: !548, inlinedAt: !549)
!561 = !DILocation(line: 54, column: 21, scope: !535)
!562 = !DILocation(line: 54, column: 11, scope: !535)
!563 = !DILocation(line: 54, column: 11, scope: !537)
!564 = !DILocation(line: 54, column: 14, scope: !537)
!565 = !DILocation(line: 54, column: 21, scope: !537)
!566 = !DILocation(line: 56, column: 16, scope: !567)
!567 = distinct !DILexicalBlock(scope: !537, file: !75, line: 55, column: 2)
!568 = !DILocation(line: 56, column: 22, scope: !567)
!569 = !DILocation(line: 56, column: 26, scope: !567)
!570 = !DILocation(line: 56, column: 30, scope: !567)
!571 = !DILocation(line: 56, column: 3, scope: !567)
!572 = !DILocation(line: 56, column: 9, scope: !567)
!573 = !DILocation(line: 58, column: 9, scope: !513)
!574 = distinct !DISubprogram(name: "cmp_test_unit", linkageName: "std.core.runtime.cmp_test_unit", scope: !75, file: !75, line: 62, type: !575, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !577)
!575 = !DISubroutineType(types: !576)
!576 = !{!43, !520, !520}
!577 = !{!578, !579, !580, !582, !584, !585}
!578 = !DILocalVariable(name: "an", scope: !574, file: !75, line: 64, type: !24, align: 8)
!579 = !DILocalVariable(name: "bn", scope: !574, file: !75, line: 65, type: !24, align: 8)
!580 = !DILocalVariable(name: ".temp", scope: !581, file: !75, line: 67, type: !24, align: 8)
!581 = distinct !DILexicalBlock(scope: !574, file: !75, line: 67, column: 2)
!582 = !DILocalVariable(name: "i", scope: !583, file: !75, line: 67, type: !24, align: 8)
!583 = distinct !DILexicalBlock(scope: !581, file: !75, line: 68, column: 2)
!584 = !DILocalVariable(name: "ac", scope: !583, file: !75, line: 67, type: !22, align: 1)
!585 = !DILocalVariable(name: "bc", scope: !586, file: !75, line: 69, type: !22, align: 1)
!586 = distinct !DILexicalBlock(scope: !583, file: !75, line: 68, column: 2)
!587 = !DILocalVariable(name: "a", arg: 1, scope: !574, file: !75, line: 62, type: !520)
!588 = !DILocation(line: 62, column: 31, scope: !574)
!589 = !DILocalVariable(name: "b", arg: 2, scope: !574, file: !75, line: 62, type: !520)
!590 = !DILocation(line: 62, column: 43, scope: !574)
!591 = !DILocation(line: 64, column: 6, scope: !574)
!592 = !DILocation(line: 64, column: 11, scope: !574)
!593 = !DILocation(line: 65, column: 6, scope: !574)
!594 = !DILocation(line: 65, column: 11, scope: !574)
!595 = !DILocation(line: 66, column: 6, scope: !574)
!596 = !DILocation(line: 66, column: 11, scope: !574)
!597 = !DILocalVariable(name: "temp", scope: !598, file: !75, line: 87, type: !520, align: 8)
!598 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !599, file: !599, line: 85, scopeLine: 85, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117, retainedNodes: !600)
!599 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!600 = !{!597}
!601 = !DILocation(line: 87, column: 6, scope: !598, inlinedAt: !602)
!602 = !DILocation(line: 66, column: 15, scope: !574)
!603 = !DILocation(line: 87, column: 13, scope: !598, inlinedAt: !602)
!604 = !DILocation(line: 88, column: 7, scope: !598, inlinedAt: !602)
!605 = !DILocation(line: 89, column: 7, scope: !598, inlinedAt: !602)
!606 = !DILocation(line: 67, column: 19, scope: !581)
!607 = !DILocation(line: 67, column: 11, scope: !581)
!608 = !DILocation(line: 67, column: 11, scope: !583)
!609 = !DILocation(line: 67, column: 14, scope: !583)
!610 = !DILocation(line: 67, column: 19, scope: !583)
!611 = !DILocation(line: 69, column: 8, scope: !586)
!612 = !DILocation(line: 69, column: 13, scope: !586)
!613 = !DILocation(line: 69, column: 20, scope: !586)
!614 = !DILocation(line: 70, column: 7, scope: !586)
!615 = !DILocation(line: 70, column: 13, scope: !586)
!616 = !DILocation(line: 70, column: 24, scope: !586)
!617 = !DILocation(line: 70, column: 29, scope: !586)
!618 = !DILocation(line: 70, column: 34, scope: !586)
!619 = !DILocation(line: 70, column: 39, scope: !586)
!620 = !DILocation(line: 70, column: 44, scope: !586)
!621 = !DILocation(line: 70, column: 49, scope: !586)
!622 = !DILocation(line: 72, column: 15, scope: !574)
!623 = !DILocation(line: 72, column: 20, scope: !574)
!624 = !DILocation(line: 72, column: 9, scope: !574)
!625 = distinct !DISubprogram(name: "terminal_has_ansi_codes", linkageName: "std.core.runtime.terminal_has_ansi_codes.7287", scope: !75, file: !75, line: 75, type: !626, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !628)
!626 = !DISubroutineType(types: !627)
!627 = !{!68}
!628 = !{!629}
!629 = !DILocalVariable(name: "v", scope: !630, file: !75, line: 78, type: !17, align: 8)
!630 = distinct !DILexicalBlock(scope: !625, file: !75, line: 76, column: 1)
!631 = !DILocalVariable(name: "state", scope: !632, file: !75, line: 648, type: !468, align: 8)
!632 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !466, file: !466, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117, retainedNodes: !633)
!633 = !{!631}
!634 = !DILocation(line: 648, column: 12, scope: !632, inlinedAt: !635)
!635 = !DILocation(line: 75, column: 45, scope: !625)
!636 = !DILocation(line: 648, column: 20, scope: !632, inlinedAt: !635)
!637 = !DILocation(line: 78, column: 10, scope: !630)
!638 = !DILocation(line: 78, column: 14, scope: !630)
!639 = !DILocation(line: 80, column: 18, scope: !640)
!640 = distinct !DILexicalBlock(scope: !630, file: !75, line: 79, column: 2)
!641 = !DILocation(line: 80, column: 7, scope: !640)
!642 = !DILocation(line: 80, column: 41, scope: !640)
!643 = !DILocation(line: 80, column: 30, scope: !640)
!644 = !DILocation(line: 80, column: 64, scope: !640)
!645 = !DILocation(line: 80, column: 53, scope: !640)
!646 = !DILocation(line: 651, column: 23, scope: !647, inlinedAt: !635)
!647 = distinct !DILexicalBlock(scope: !632, file: !466, line: 650, column: 2)
!648 = !DILocation(line: 651, column: 3, scope: !647, inlinedAt: !635)
!649 = !DILocation(line: 85, column: 10, scope: !630)
!650 = !DILocation(line: 651, column: 23, scope: !651, inlinedAt: !635)
!651 = distinct !DILexicalBlock(scope: !632, file: !466, line: 650, column: 2)
!652 = !DILocation(line: 651, column: 3, scope: !651, inlinedAt: !635)
!653 = distinct !DISubprogram(name: "test_panic", linkageName: "std.core.runtime.test_panic.7288", scope: !75, file: !75, line: 89, type: !654, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !198)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !17, !17, !17, !14}
!656 = !DILocalVariable(name: "message", arg: 1, scope: !653, file: !75, line: 89, type: !17)
!657 = !DILocation(line: 89, column: 27, scope: !653)
!658 = !DILocalVariable(name: "file", arg: 2, scope: !653, file: !75, line: 89, type: !17)
!659 = !DILocation(line: 89, column: 43, scope: !653)
!660 = !DILocalVariable(name: "function", arg: 3, scope: !653, file: !75, line: 89, type: !17)
!661 = !DILocation(line: 89, column: 56, scope: !653)
!662 = !DILocalVariable(name: "line", arg: 4, scope: !653, file: !75, line: 89, type: !14)
!663 = !DILocation(line: 89, column: 71, scope: !653)
!664 = !DILocation(line: 91, column: 6, scope: !653)
!665 = !DILocation(line: 91, column: 38, scope: !653)
!666 = !DILocation(line: 92, column: 2, scope: !653)
!667 = !DILocation(line: 94, column: 2, scope: !653)
!668 = !DILocation(line: 95, column: 8, scope: !653)
!669 = !DILocation(line: 95, column: 2, scope: !653)
!670 = !DILocation(line: 96, column: 6, scope: !653)
!671 = !DILocation(line: 99, column: 41, scope: !672)
!672 = distinct !DILexicalBlock(scope: !653, file: !75, line: 97, column: 2)
!673 = !DILocation(line: 99, column: 7, scope: !672)
!674 = !DILocation(line: 102, column: 50, scope: !653)
!675 = !DILocation(line: 102, column: 56, scope: !653)
!676 = !DILocation(line: 102, column: 62, scope: !653)
!677 = !DILocation(line: 102, column: 2, scope: !653)
!678 = !DILocation(line: 103, column: 2, scope: !653)
!679 = !DILocation(line: 105, column: 6, scope: !653)
!680 = !DILocation(line: 265, column: 2, scope: !681, inlinedAt: !682)
!681 = distinct !DISubprogram(name: "breakpoint", linkageName: "breakpoint", scope: !599, file: !599, line: 263, scopeLine: 263, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!682 = !DILocation(line: 107, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !653, file: !75, line: 106, column: 2)
!684 = !DILocation(line: 110, column: 6, scope: !653)
!685 = !DILocation(line: 112, column: 3, scope: !686)
!686 = distinct !DILexicalBlock(scope: !653, file: !75, line: 111, column: 2)
!687 = !DILocation(line: 115, column: 2, scope: !653)
!688 = !DILocation(line: 116, column: 2, scope: !653)
!689 = !DILocation(line: 116, column: 32, scope: !653)
!690 = !DILocation(line: 117, column: 17, scope: !653)
!691 = !DILocation(line: 117, column: 2, scope: !653)
!692 = distinct !DISubprogram(name: "mute_output", linkageName: "std.core.runtime.mute_output.7293", scope: !75, file: !75, line: 120, type: !95, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !693)
!693 = !{!694, !696}
!694 = !DILocalVariable(name: "stdout", scope: !692, file: !75, line: 123, type: !695, align: 8)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "File*", baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!696 = !DILocalVariable(name: "stderr", scope: !692, file: !75, line: 124, type: !695, align: 8)
!697 = !DILocation(line: 122, column: 6, scope: !692)
!698 = !DILocation(line: 122, column: 37, scope: !692)
!699 = !DILocation(line: 122, column: 74, scope: !692)
!700 = !DILocation(line: 123, column: 8, scope: !692)
!701 = !DILocation(line: 123, column: 17, scope: !692)
!702 = !DILocation(line: 124, column: 11, scope: !692)
!703 = !DILocation(line: 124, column: 20, scope: !692)
!704 = !DILocation(line: 125, column: 12, scope: !692)
!705 = !DILocation(line: 125, column: 3, scope: !692)
!706 = !DILocation(line: 126, column: 12, scope: !692)
!707 = !DILocation(line: 126, column: 3, scope: !692)
!708 = !DILocation(line: 127, column: 8, scope: !692)
!709 = !DILocation(line: 127, column: 2, scope: !692)
!710 = distinct !DISubprogram(name: "unmute_output", linkageName: "std.core.runtime.unmute_output.7296", scope: !75, file: !75, line: 130, type: !711, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !68}
!713 = !{!714, !715, !716, !717}
!714 = !DILocalVariable(name: "stdout", scope: !710, file: !75, line: 134, type: !695, align: 8)
!715 = !DILocalVariable(name: "stderr", scope: !710, file: !75, line: 135, type: !695, align: 8)
!716 = !DILocalVariable(name: "log_size", scope: !710, file: !75, line: 140, type: !24, align: 8)
!717 = !DILocalVariable(name: "c", scope: !718, file: !75, line: 154, type: !22, align: 1)
!718 = distinct !DILexicalBlock(scope: !719, file: !75, line: 154, column: 3)
!719 = distinct !DILexicalBlock(scope: !710, file: !75, line: 147, column: 2)
!720 = !DILocalVariable(name: "has_error", arg: 1, scope: !710, file: !75, line: 130, type: !68)
!721 = !DILocation(line: 130, column: 28, scope: !710)
!722 = !DILocation(line: 132, column: 6, scope: !710)
!723 = !DILocation(line: 132, column: 37, scope: !710)
!724 = !DILocation(line: 132, column: 74, scope: !710)
!725 = !DILocation(line: 134, column: 8, scope: !710)
!726 = !DILocation(line: 134, column: 17, scope: !710)
!727 = !DILocation(line: 135, column: 8, scope: !710)
!728 = !DILocation(line: 135, column: 17, scope: !710)
!729 = !DILocation(line: 137, column: 12, scope: !710)
!730 = !DILocation(line: 137, column: 3, scope: !710)
!731 = !DILocation(line: 138, column: 12, scope: !710)
!732 = !DILocation(line: 138, column: 3, scope: !710)
!733 = !DILocation(line: 140, column: 6, scope: !710)
!734 = !DILocation(line: 140, column: 17, scope: !710)
!735 = !DILocation(line: 141, column: 6, scope: !710)
!736 = !DILocation(line: 143, column: 14, scope: !737)
!737 = distinct !DILexicalBlock(scope: !710, file: !75, line: 142, column: 2)
!738 = !DILocation(line: 143, column: 68, scope: !737)
!739 = !DILocation(line: 242, column: 16, scope: !740, inlinedAt: !741)
!740 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !292, file: !292, line: 240, scopeLine: 240, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!741 = !DILocation(line: 143, column: 3, scope: !737)
!742 = !DILocalVariable(name: "len", scope: !743, file: !75, line: 216, type: !24, align: 8)
!743 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !292, file: !292, line: 214, scopeLine: 214, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117, retainedNodes: !744)
!744 = !{!742}
!745 = !DILocation(line: 216, column: 6, scope: !743, inlinedAt: !746)
!746 = !DILocation(line: 242, column: 2, scope: !740, inlinedAt: !741)
!747 = !DILocation(line: 160, column: 24, scope: !748, inlinedAt: !749)
!748 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !292, file: !292, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!749 = !DILocation(line: 216, column: 12, scope: !743, inlinedAt: !746)
!750 = !DILocation(line: 217, column: 2, scope: !743, inlinedAt: !746)
!751 = !DILocation(line: 222, column: 4, scope: !743, inlinedAt: !746)
!752 = !DILocation(line: 224, column: 9, scope: !743, inlinedAt: !746)
!753 = !DILocation(line: 146, column: 6, scope: !710)
!754 = !DILocation(line: 146, column: 19, scope: !710)
!755 = !DILocation(line: 148, column: 3, scope: !719)
!756 = !DILocation(line: 149, column: 3, scope: !719)
!757 = !DILocation(line: 150, column: 9, scope: !719)
!758 = !DILocation(line: 150, column: 3, scope: !719)
!759 = !DILocation(line: 152, column: 3, scope: !719)
!760 = !DILocation(line: 153, column: 23, scope: !719)
!761 = !DILocation(line: 153, column: 3, scope: !719)
!762 = !DILocation(line: 154, column: 3, scope: !719)
!763 = !DILocation(line: 154, column: 14, scope: !718)
!764 = !DILocation(line: 154, column: 18, scope: !718)
!765 = !DILocation(line: 156, column: 18, scope: !766, inlinedAt: !767)
!766 = distinct !DISubprogram(name: "@unlikely", linkageName: "@unlikely", scope: !599, file: !599, line: 361, scopeLine: 361, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!767 = !DILocation(line: 156, column: 8, scope: !768)
!768 = distinct !DILexicalBlock(scope: !718, file: !75, line: 155, column: 3)
!769 = !DILocation(line: 367, column: 18, scope: !766, inlinedAt: !767)
!770 = !DILocation(line: 367, column: 26, scope: !766, inlinedAt: !767)
!771 = !DILocation(line: 159, column: 5, scope: !772)
!772 = distinct !DILexicalBlock(scope: !768, file: !75, line: 157, column: 4)
!773 = !DILocation(line: 161, column: 18, scope: !768)
!774 = !DILocation(line: 161, column: 4, scope: !768)
!775 = !DILocation(line: 163, column: 3, scope: !719)
!776 = !DILocation(line: 165, column: 8, scope: !710)
!777 = !DILocation(line: 165, column: 2, scope: !710)
!778 = distinct !DISubprogram(name: "run_tests", linkageName: "std.core.runtime.run_tests", scope: !75, file: !75, line: 168, type: !779, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !117, retainedNodes: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!68, !141, !516}
!781 = !{!782, !783, !784, !785, !787, !789, !790, !792, !795, !796, !797, !798, !799, !800, !801, !803, !805, !843}
!782 = !DILocalVariable(name: "max_name", scope: !778, file: !75, line: 170, type: !24, align: 8)
!783 = !DILocalVariable(name: "sort_tests", scope: !778, file: !75, line: 171, type: !68, align: 1)
!784 = !DILocalVariable(name: "check_leaks", scope: !778, file: !75, line: 172, type: !68, align: 1)
!785 = !DILocalVariable(name: ".temp", scope: !786, file: !75, line: 178, type: !24, align: 8)
!786 = distinct !DILexicalBlock(scope: !778, file: !75, line: 178, column: 2)
!787 = !DILocalVariable(name: "unit", scope: !788, file: !75, line: 178, type: !519, align: 8)
!788 = distinct !DILexicalBlock(scope: !786, file: !75, line: 179, column: 2)
!789 = !DILocalVariable(name: "context", scope: !778, file: !75, line: 182, type: !77, align: 8)
!790 = !DILocalVariable(name: "i", scope: !791, file: !75, line: 192, type: !43, align: 4)
!791 = distinct !DILexicalBlock(scope: !778, file: !75, line: 192, column: 2)
!792 = !DILocalVariable(name: "old_panic", scope: !778, file: !75, line: 238, type: !793, align: 8)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !75, file: !75, line: 211, baseType: !794, align: 8)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !654, size: 64, align: 64, dwarfAddressSpace: 0)
!795 = !DILocalVariable(name: "tests_passed", scope: !778, file: !75, line: 241, type: !43, align: 4)
!796 = !DILocalVariable(name: "tests_skipped", scope: !778, file: !75, line: 242, type: !43, align: 4)
!797 = !DILocalVariable(name: "test_count", scope: !778, file: !75, line: 243, type: !43, align: 4)
!798 = !DILocalVariable(name: "name", scope: !778, file: !75, line: 244, type: !63, align: 8)
!799 = !DILocalVariable(name: "len", scope: !778, file: !75, line: 245, type: !24, align: 8)
!800 = !DILocalVariable(name: "temp_state", scope: !778, file: !75, line: 251, type: !468, align: 8)
!801 = !DILocalVariable(name: ".temp", scope: !802, file: !75, line: 253, type: !24, align: 8)
!802 = distinct !DILexicalBlock(scope: !778, file: !75, line: 253, column: 2)
!803 = !DILocalVariable(name: "unit", scope: !804, file: !75, line: 253, type: !520, align: 8)
!804 = distinct !DILexicalBlock(scope: !802, file: !75, line: 254, column: 2)
!805 = !DILocalVariable(name: "mem", scope: !806, file: !75, line: 277, type: !807, align: 8)
!806 = distinct !DILexicalBlock(scope: !804, file: !75, line: 254, column: 2)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "TrackingAllocator", scope: !75, file: !75, line: 25, size: 640, align: 64, elements: !808, identifier: "std.core.mem.allocator.TrackingAllocator")
!808 = !{!809, !810, !841, !842}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "inner_allocator", scope: !807, file: !75, line: 27, baseType: !31, size: 128, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !807, file: !75, line: 28, baseType: !811, size: 384, align: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "AllocMap", scope: !75, file: !75, line: 16, baseType: !812, align: 8)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !75, file: !75, line: 29, size: 384, align: 64, elements: !813, identifier: "std_collections_map$ulong$std.core.mem.allocator.Allocation$.HashMap")
!813 = !{!814, !837, !838, !839, !840}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !812, file: !75, line: 31, baseType: !815, size: 128, align: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !816, identifier: "Entry*[]")
!816 = !{!817, !836}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !815, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !819, size: 64, align: 64, dwarfAddressSpace: 0)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !820, size: 64, align: 64, dwarfAddressSpace: 0)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !75, file: !75, line: 21, size: 1344, align: 64, elements: !821, identifier: "std_collections_map$ulong$std.core.mem.allocator.Allocation$.Entry")
!821 = !{!822, !823, !825, !835}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !820, file: !75, line: 23, baseType: !14, size: 32, align: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !820, file: !75, line: 24, baseType: !824, size: 64, align: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !75, file: !75, line: 16, baseType: !25, align: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !820, file: !75, line: 25, baseType: !826, size: 1152, align: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !75, file: !75, line: 16, baseType: !827, align: 8)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocation", scope: !75, file: !75, line: 9, size: 1152, align: 64, elements: !828, identifier: "std.core.mem.allocator.Allocation")
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !827, file: !75, line: 11, baseType: !34, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !827, file: !75, line: 12, baseType: !24, size: 64, align: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "backtrace", scope: !827, file: !75, line: 13, baseType: !832, size: 1024, align: 64, offset: 128)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1024, align: 64, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 16, lowerBound: 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !75, line: 26, baseType: !819, size: 64, align: 64, offset: 1280)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !815, baseType: !24, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !812, file: !75, line: 32, baseType: !31, size: 128, align: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !812, file: !75, line: 34, baseType: !14, size: 32, align: 32, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !812, file: !75, line: 36, baseType: !14, size: 32, align: 32, offset: 288)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !812, file: !75, line: 37, baseType: !40, size: 32, align: 32, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mem_total", scope: !807, file: !75, line: 29, baseType: !24, size: 64, align: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "allocs_total", scope: !807, file: !75, line: 30, baseType: !24, size: 64, align: 64, offset: 576)
!843 = !DILocalVariable(name: "n_failed", scope: !778, file: !75, line: 314, type: !43, align: 4)
!844 = !DILocalVariable(name: "args", arg: 1, scope: !778, file: !75, line: 168, type: !141)
!845 = !DILocation(line: 168, column: 28, scope: !778)
!846 = !DILocalVariable(name: "tests", arg: 2, scope: !778, file: !75, line: 168, type: !516)
!847 = !DILocation(line: 168, column: 45, scope: !778)
!848 = !DILocation(line: 170, column: 6, scope: !778)
!849 = !DILocation(line: 171, column: 7, scope: !778)
!850 = !DILocation(line: 171, column: 20, scope: !778)
!851 = !DILocation(line: 172, column: 7, scope: !778)
!852 = !DILocation(line: 172, column: 21, scope: !778)
!853 = !DILocation(line: 173, column: 6, scope: !778)
!854 = !DILocation(line: 242, column: 16, scope: !855, inlinedAt: !856)
!855 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !292, file: !292, line: 240, scopeLine: 240, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!856 = !DILocation(line: 175, column: 3, scope: !857)
!857 = distinct !DILexicalBlock(scope: !778, file: !75, line: 174, column: 2)
!858 = !DILocalVariable(name: "len", scope: !859, file: !75, line: 216, type: !24, align: 8)
!859 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !292, file: !292, line: 214, scopeLine: 214, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117, retainedNodes: !860)
!860 = !{!858}
!861 = !DILocation(line: 216, column: 6, scope: !859, inlinedAt: !862)
!862 = !DILocation(line: 242, column: 2, scope: !855, inlinedAt: !856)
!863 = !DILocation(line: 160, column: 24, scope: !864, inlinedAt: !865)
!864 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !292, file: !292, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !117)
!865 = !DILocation(line: 216, column: 12, scope: !859, inlinedAt: !862)
!866 = !DILocation(line: 217, column: 2, scope: !859, inlinedAt: !862)
!867 = !DILocation(line: 222, column: 4, scope: !859, inlinedAt: !862)
!868 = !DILocation(line: 224, column: 9, scope: !859, inlinedAt: !862)
!869 = !DILocation(line: 176, column: 10, scope: !857)
!870 = !DILocation(line: 178, column: 19, scope: !786)
!871 = !DILocation(line: 178, column: 12, scope: !788)
!872 = !DILocation(line: 178, column: 19, scope: !788)
!873 = !DILocation(line: 180, column: 7, scope: !874)
!874 = distinct !DILexicalBlock(scope: !788, file: !75, line: 179, column: 2)
!875 = !DILocation(line: 180, column: 18, scope: !874)
!876 = !DILocation(line: 180, column: 44, scope: !874)
!877 = !DILocation(line: 182, column: 14, scope: !778)
!878 = !DILocation(line: 184, column: 29, scope: !778)
!879 = !DILocation(line: 185, column: 27, scope: !778)
!880 = !DILocation(line: 186, column: 18, scope: !778)
!881 = !DILocation(line: 187, column: 21, scope: !778)
!882 = !DILocation(line: 188, column: 23, scope: !778)
!883 = !DILocation(line: 189, column: 21, scope: !778)
!884 = !DILocation(line: 190, column: 21, scope: !778)
!885 = !DILocation(line: 192, column: 11, scope: !791)
!886 = !DILocation(line: 192, column: 15, scope: !791)
!887 = !DILocation(line: 192, column: 18, scope: !791)
!888 = !DILocation(line: 192, column: 22, scope: !791)
!889 = !DILocation(line: 194, column: 11, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !75, line: 194, column: 3)
!891 = distinct !DILexicalBlock(scope: !791, file: !75, line: 193, column: 2)
!892 = !DILocation(line: 194, column: 16, scope: !890)
!893 = !DILocation(line: 196, column: 9, scope: !890)
!894 = !DILocation(line: 197, column: 5, scope: !895)
!895 = distinct !DILexicalBlock(scope: !890, file: !75, line: 197, column: 5)
!896 = !DILocation(line: 198, column: 9, scope: !890)
!897 = !DILocation(line: 199, column: 18, scope: !898)
!898 = distinct !DILexicalBlock(scope: !890, file: !75, line: 199, column: 5)
