; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.147 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].146" = type { ptr, i64 }
%any.151 = type { ptr, i64 }
%"any[].149" = type { ptr, i64 }
%OnStackAllocator.150 = type { %any.151, %"char[].146", i64, ptr }
%"void*[]" = type { ptr, i64 }
%List.152 = type { i64, i64, %any.151, ptr }

@"$ct.std.core.builtin.EmptySlot" = linkonce global %.introspect.147 { i8 18, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.p$void" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.p$void" = linkonce global %.introspect.147 { i8 19, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.void" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.void" = linkonce global %.introspect.147 { i8 0, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.enum.NO_LOCALITY = internal constant [12 x i8] c"NO_LOCALITY\00", align 1
@.enum.FAR = internal constant [4 x i8] c"FAR\00", align 1
@.enum.NEAR = internal constant [5 x i8] c"NEAR\00", align 1
@.enum.VERY_NEAR = internal constant [10 x i8] c"VERY_NEAR\00", align 1
@"$ct.int" = linkonce global %.introspect.147 { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 27, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 29, baseType: !4, align: 8)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic.6962", scope: !2, file: !2, line: 190, type: !7, isLocal: true, isDefinition: true, align: 1)
!7 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 213, type: !10, isLocal: false, isDefinition: true, align: 8)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 211, baseType: !11, align: 8)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14, !14, !14, !23}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !16, identifier: "char[]")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 660, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 2, !"wchar_size", i32 4}
!30 = !{i32 4, !"PIC Level", i32 2}
!31 = !{i32 1, !"uwtable", i32 1}
!32 = !{i32 2, !"frame-pointer", i32 1}
!33 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !34, splitDebugInlining: false)
!34 = !{!0, !5, !8, !24}
!35 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 215, type: !36, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !48)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !14, !14, !14, !23, !38}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !39, identifier: "any[]")
!39 = !{!40, !47}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !43, identifier: "any")
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !4, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, baseType: !21, size: 64, align: 64, offset: 64)
!48 = !{!49, !54}
!49 = !DILocalVariable(name: "allocator", scope: !35, file: !2, line: 225, type: !50, align: 8)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !51, identifier: "Allocator")
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !50, baseType: !4, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, baseType: !46, size: 64, align: 64, offset: 64)
!54 = !DILocalVariable(name: "s", scope: !55, file: !2, line: 227, type: !56, align: 8)
!55 = distinct !DILexicalBlock(scope: !35, file: !2, line: 226, column: 3)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !57, align: 8)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 1)
!59 = !DILocalVariable(name: "fmt", arg: 1, scope: !35, file: !2, line: 215, type: !14)
!60 = !DILocation(line: 215, column: 23, scope: !35)
!61 = !DILocalVariable(name: "file", arg: 2, scope: !35, file: !2, line: 215, type: !14)
!62 = !DILocation(line: 215, column: 35, scope: !35)
!63 = !DILocalVariable(name: "function", arg: 3, scope: !35, file: !2, line: 215, type: !14)
!64 = !DILocation(line: 215, column: 48, scope: !35)
!65 = !DILocalVariable(name: "line", arg: 4, scope: !35, file: !2, line: 215, type: !23)
!66 = !DILocation(line: 215, column: 63, scope: !35)
!67 = !DILocalVariable(name: "args", arg: 5, scope: !35, file: !2, line: 215, type: !38)
!68 = !DILocation(line: 215, column: 69, scope: !35)
!69 = !DILocation(line: 218, column: 7, scope: !35)
!70 = !DILocation(line: 250, column: 15, scope: !71, inlinedAt: !73)
!71 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !72, file: !72, line: 248, scopeLine: 248, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!72 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io")
!73 = !DILocation(line: 220, column: 4, scope: !74)
!74 = distinct !DILexicalBlock(scope: !35, file: !2, line: 219, column: 3)
!75 = !DILocation(line: 160, column: 24, scope: !76, inlinedAt: !77)
!76 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !72, file: !72, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!77 = !DILocation(line: 250, column: 2, scope: !71, inlinedAt: !73)
!78 = !DILocation(line: 260, column: 16, scope: !79, inlinedAt: !80)
!79 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !72, file: !72, line: 258, scopeLine: 258, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!80 = !DILocation(line: 221, column: 4, scope: !74)
!81 = !DILocalVariable(name: "len", scope: !82, file: !2, line: 216, type: !21, align: 8)
!82 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !72, file: !72, line: 214, scopeLine: 214, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !83)
!83 = !{!81}
!84 = !DILocation(line: 216, column: 6, scope: !82, inlinedAt: !85)
!85 = !DILocation(line: 260, column: 2, scope: !79, inlinedAt: !80)
!86 = !DILocation(line: 160, column: 24, scope: !87, inlinedAt: !88)
!87 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !72, file: !72, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!88 = !DILocation(line: 216, column: 12, scope: !82, inlinedAt: !85)
!89 = !DILocation(line: 217, column: 2, scope: !82, inlinedAt: !85)
!90 = !DILocation(line: 222, column: 4, scope: !82, inlinedAt: !85)
!91 = !DILocation(line: 224, column: 9, scope: !82, inlinedAt: !85)
!92 = !DILocation(line: 222, column: 10, scope: !74)
!93 = !DILocation(line: 224, column: 14, scope: !35)
!94 = !DILocalVariable(name: "buffer", scope: !95, file: !2, line: 579, type: !111, align: 1)
!95 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !97)
!96 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!97 = !{!94, !98}
!98 = !DILocalVariable(name: "allocator", scope: !95, file: !2, line: 580, type: !99, align: 8)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !100, identifier: "std.core.mem.allocator.OnStackAllocator")
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !99, file: !2, line: 14, baseType: !50, size: 128, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !2, line: 15, baseType: !15, size: 128, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !99, file: !2, line: 16, baseType: !21, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !99, file: !2, line: 17, baseType: !105, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !106, size: 64, align: 64, dwarfAddressSpace: 0)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !107, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.9581")
!107 = !{!108, !109, !110}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !106, file: !2, line: 22, baseType: !7, size: 8, align: 8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !106, file: !2, line: 23, baseType: !105, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !2, line: 24, baseType: !4, size: 64, align: 64, offset: 128)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 4096, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 512, lowerBound: 0)
!114 = !DILocation(line: 579, column: 14, scope: !95, inlinedAt: !115)
!115 = !DILocation(line: 225, column: 3, scope: !35)
!116 = !DILocation(line: 580, column: 19, scope: !95, inlinedAt: !115)
!117 = !DILocation(line: 581, column: 18, scope: !95, inlinedAt: !115)
!118 = !DILocation(line: 581, column: 26, scope: !95, inlinedAt: !115)
!119 = !DILocation(line: 581, column: 2, scope: !95, inlinedAt: !115)
!120 = !DILocation(line: 225, column: 29, scope: !35)
!121 = !DILocation(line: 583, column: 8, scope: !122, inlinedAt: !115)
!122 = distinct !DILexicalBlock(scope: !95, file: !96, line: 583, column: 2)
!123 = !DILocation(line: 227, column: 12, scope: !55)
!124 = !DILocation(line: 20, column: 68, scope: !125, inlinedAt: !127)
!125 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !126, file: !126, line: 20, scopeLine: 20, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!126 = !DIFile(filename: "dstring.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!127 = !DILocation(line: 228, column: 4, scope: !55)
!128 = !DILocation(line: 229, column: 4, scope: !55)
!129 = !DILocation(line: 230, column: 15, scope: !55)
!130 = !DILocation(line: 231, column: 4, scope: !55)
!131 = !DILocation(line: 231, column: 10, scope: !55)
!132 = !DILocation(line: 231, column: 40, scope: !55)
!133 = !DILocation(line: 582, column: 8, scope: !134, inlinedAt: !115)
!134 = distinct !DILexicalBlock(scope: !95, file: !96, line: 582, column: 8)
!135 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 138, type: !136, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{!7, !14, !26}
!138 = !{!139, !140, !145, !151, !152, !172, !174, !176, !177}
!139 = !DILocalVariable(name: "smem", scope: !135, file: !2, line: 138, type: !50, align: 8)
!140 = !DILocalVariable(name: "buffer", scope: !141, file: !2, line: 140, type: !142, align: 8)
!141 = distinct !DILexicalBlock(scope: !135, file: !2, line: 139, column: 1)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 64, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 256, lowerBound: 0)
!145 = !DILocalVariable(name: "backtraces", scope: !141, file: !2, line: 141, type: !146, align: 8)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !147, identifier: "void*[]")
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !146, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !146, baseType: !21, size: 64, align: 64, offset: 64)
!151 = !DILocalVariable(name: "mem", scope: !141, file: !2, line: 143, type: !50, align: 8)
!152 = !DILocalVariable(name: "backtrace", scope: !153, file: !2, line: 145, type: !154, align: 8)
!153 = distinct !DILexicalBlock(scope: !141, file: !2, line: 144, column: 2)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !155, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!155 = !{!156, !157, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !154, file: !2, line: 20, baseType: !21, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !154, file: !2, line: 21, baseType: !21, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !154, file: !2, line: 22, baseType: !50, size: 128, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !154, file: !2, line: 23, baseType: !160, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 88, baseType: !162, align: 8)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !163, identifier: "std.os.backtrace.Backtrace")
!163 = !{!164, !166, !167, !168, !169, !170, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !162, file: !2, line: 11, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !22)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !162, file: !2, line: 12, baseType: !14, size: 128, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !162, file: !2, line: 13, baseType: !14, size: 128, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !162, file: !2, line: 14, baseType: !14, size: 128, align: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !162, file: !2, line: 15, baseType: !23, size: 32, align: 32, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !162, file: !2, line: 16, baseType: !50, size: 128, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !162, file: !2, line: 17, baseType: !7, size: 8, align: 8, offset: 640)
!172 = !DILocalVariable(name: ".temp", scope: !173, file: !2, line: 151, type: !21, align: 8)
!173 = distinct !DILexicalBlock(scope: !153, file: !2, line: 151, column: 3)
!174 = !DILocalVariable(name: "i", scope: !175, file: !2, line: 151, type: !21, align: 8)
!175 = distinct !DILexicalBlock(scope: !173, file: !2, line: 152, column: 3)
!176 = !DILocalVariable(name: "trace", scope: !175, file: !2, line: 151, type: !160, align: 8)
!177 = !DILocalVariable(name: "inline_suffix", scope: !178, file: !2, line: 154, type: !14, align: 8)
!178 = distinct !DILexicalBlock(scope: !175, file: !2, line: 152, column: 3)
!179 = !DILocalVariable(name: "message", arg: 1, scope: !135, file: !2, line: 138, type: !14)
!180 = !DILocation(line: 138, column: 32, scope: !135)
!181 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !135, file: !2, line: 138, type: !26)
!182 = !DILocation(line: 138, column: 45, scope: !135)
!183 = !DILocalVariable(name: "buffer", scope: !184, file: !2, line: 579, type: !187, align: 1)
!184 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !185)
!185 = !{!183, !186}
!186 = !DILocalVariable(name: "allocator", scope: !184, file: !2, line: 580, type: !99, align: 8)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 34816, align: 8, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 4352, lowerBound: 0)
!190 = !DILocation(line: 579, column: 14, scope: !184, inlinedAt: !191)
!191 = !DILocation(line: 138, column: 99, scope: !135)
!192 = !DILocation(line: 580, column: 19, scope: !184, inlinedAt: !191)
!193 = !DILocation(line: 581, column: 18, scope: !184, inlinedAt: !191)
!194 = !DILocation(line: 581, column: 26, scope: !184, inlinedAt: !191)
!195 = !DILocation(line: 581, column: 2, scope: !184, inlinedAt: !191)
!196 = !DILocation(line: 138, column: 128, scope: !135)
!197 = !DILocation(line: 583, column: 8, scope: !198, inlinedAt: !191)
!198 = distinct !DILexicalBlock(scope: !184, file: !96, line: 583, column: 2)
!199 = !DILocation(line: 140, column: 13, scope: !141)
!200 = !DILocation(line: 141, column: 10, scope: !141)
!201 = !DILocation(line: 141, column: 51, scope: !141)
!202 = !DILocation(line: 141, column: 23, scope: !141)
!203 = !DILocation(line: 142, column: 2, scope: !141)
!204 = !DILocalVariable(name: "buffer", scope: !205, file: !2, line: 579, type: !208, align: 1)
!205 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !96, file: !96, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !206)
!206 = !{!204, !207}
!207 = !DILocalVariable(name: "allocator", scope: !205, file: !2, line: 580, type: !99, align: 8)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 16384, align: 8, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 2048, lowerBound: 0)
!211 = !DILocation(line: 579, column: 14, scope: !205, inlinedAt: !212)
!212 = !DILocation(line: 143, column: 2, scope: !141)
!213 = !DILocation(line: 580, column: 19, scope: !205, inlinedAt: !212)
!214 = !DILocation(line: 581, column: 18, scope: !205, inlinedAt: !212)
!215 = !DILocation(line: 581, column: 26, scope: !205, inlinedAt: !212)
!216 = !DILocation(line: 581, column: 2, scope: !205, inlinedAt: !212)
!217 = !DILocation(line: 143, column: 29, scope: !141)
!218 = !DILocation(line: 583, column: 8, scope: !219, inlinedAt: !212)
!219 = distinct !DILexicalBlock(scope: !205, file: !96, line: 583, column: 2)
!220 = !DILocation(line: 145, column: 18, scope: !153)
!221 = !DILocation(line: 145, column: 30, scope: !153)
!222 = !DILocation(line: 146, column: 13, scope: !153)
!223 = !DILocation(line: 582, column: 8, scope: !224, inlinedAt: !212)
