; ModuleID = 'std::io::file'
source_filename = "std::io::file"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.315 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].314" = type { ptr, i64 }
%any.318 = type { ptr, i64 }
%File.317 = type { ptr }
%"any[].319" = type { ptr, i64 }
%FileMmap.320 = type { %File.317, %VirtualMemory.321, i64, i64 }
%VirtualMemory.321 = type { ptr, i64, i32 }
%PathImp = type { %"char[].314", i32, %any.318 }

@"$ct.fault" = linkonce global %.introspect.315 { i8 6, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.panic_msg = internal constant [37 x i8] c"Unexpected fault '%s' was unwrapped!\00", align 1
@.file = internal constant [13 x i8] c"file_mmap.c3\00", align 1
@.func = internal constant [10 x i8] c"mmap_file\00", align 1
@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@std.io.OVERFLOW = linkonce constant %"char[].314" { ptr @std.io.OVERFLOW.nameof, i64 12 }, align 8
@std.io.OVERFLOW.nameof = internal constant [13 x i8] c"io::OVERFLOW\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@"$sel.acquire" = linkonce_odr constant [8 x i8] c"acquire\00", align 1
@.panic_msg.2 = internal constant [45 x i8] c"No method 'acquire' could be found on target\00", align 1
@.file.3 = internal constant [17 x i8] c"mem_allocator.c3\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "file_mmap.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io")
!8 = !{!9, !20, !26}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VirtualMemoryAccess", scope: !7, file: !7, line: 20, baseType: !10, size: 32, align: 32, elements: !11)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19}
!12 = !DIEnumerator(name: "PROTECTED", value: 0)
!13 = !DIEnumerator(name: "READ", value: 1)
!14 = !DIEnumerator(name: "WRITE", value: 2)
!15 = !DIEnumerator(name: "READWRITE", value: 3)
!16 = !DIEnumerator(name: "EXEC", value: 4)
!17 = !DIEnumerator(name: "EXECREAD", value: 5)
!18 = !DIEnumerator(name: "EXECWRITE", value: 6)
!19 = !DIEnumerator(name: "ANY", value: 7)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !21, file: !21, line: 7, baseType: !10, size: 32, align: 32, elements: !22)
!21 = !DIFile(filename: "file.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io")
!22 = !{!23, !24, !25}
!23 = !DIEnumerator(name: "SET", value: 0)
!24 = !DIEnumerator(name: "CURSOR", value: 1)
!25 = !DIEnumerator(name: "END", value: 2)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !27, file: !21, line: 23, baseType: !10, size: 32, align: 32, elements: !47)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !21, file: !21, line: 16, size: 320, align: 64, elements: !28, identifier: "std.io.path.PathImp")
!28 = !{!29, !39, !40}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !27, file: !21, line: 18, baseType: !30, size: 128, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !32, identifier: "char[]")
!32 = !{!33, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !31, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !38)
!38 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !27, file: !21, line: 19, baseType: !26, size: 32, align: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !27, file: !21, line: 20, baseType: !41, size: 128, align: 64, offset: 192)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !42, identifier: "Allocator")
!42 = !{!43, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !41, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!47 = !{!48, !49}
!48 = !DIEnumerator(name: "WIN32", value: 0)
!49 = !DIEnumerator(name: "POSIX", value: 1)
!50 = distinct !DISubprogram(name: "mmap_file", linkageName: "std.io.file.mmap_file", scope: !7, file: !7, line: 44, type: !51, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !69)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !56, !38, !38, !9, !68}
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileMmap", scope: !7, file: !7, line: 4, size: 384, align: 64, elements: !54, identifier: "std.io.file.mmap.FileMmap")
!54 = !{!55, !60, !66, !67}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !53, file: !7, line: 6, baseType: !56, size: 64, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !7, file: !7, line: 4, size: 64, align: 64, elements: !57, identifier: "std.io.File")
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !56, file: !7, line: 6, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !7, file: !7, line: 368, baseType: !44, align: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "vm", scope: !53, file: !7, line: 7, baseType: !61, size: 192, align: 64, offset: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtualMemory", scope: !53, file: !7, line: 11, size: 192, align: 64, elements: !62, identifier: "std.core.mem.vm.VirtualMemory")
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !61, file: !7, line: 13, baseType: !44, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !61, file: !7, line: 14, baseType: !37, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "default_access", scope: !61, file: !7, line: 15, baseType: !9, size: 32, align: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !53, file: !7, line: 8, baseType: !37, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !53, file: !7, line: 9, baseType: !37, size: 64, align: 64, offset: 320)
!68 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!69 = !{!70, !72, !73, !74, !75, !76, !77}
!70 = !DILocalVariable(name: "cur", scope: !71, file: !7, line: 48, type: !37, align: 8)
!71 = distinct !DILexicalBlock(scope: !50, file: !7, line: 47, column: 2)
!72 = !DILocalVariable(name: "file_size", scope: !71, file: !7, line: 50, type: !37, align: 8)
!73 = !DILocalVariable(name: "page_size", scope: !50, file: !7, line: 55, type: !37, align: 8)
!74 = !DILocalVariable(name: "page_offset", scope: !50, file: !7, line: 58, type: !37, align: 8)
!75 = !DILocalVariable(name: "map_offset", scope: !50, file: !7, line: 59, type: !37, align: 8)
!76 = !DILocalVariable(name: "map_len", scope: !50, file: !7, line: 62, type: !37, align: 8)
!77 = !DILocalVariable(name: "ptr", scope: !50, file: !7, line: 65, type: !44, align: 8)
!78 = !DILocalVariable(name: "file", arg: 1, scope: !50, file: !7, line: 44, type: !56)
!79 = !DILocation(line: 44, column: 29, scope: !50)
!80 = !DILocalVariable(name: "offset", arg: 2, scope: !50, file: !7, line: 44, type: !37)
!81 = !DILocation(line: 44, column: 39, scope: !50)
!82 = !DILocalVariable(name: "len", arg: 3, scope: !50, file: !7, line: 44, type: !37)
!83 = !DILocation(line: 44, column: 55, scope: !50)
!84 = !DILocalVariable(name: "access", arg: 4, scope: !50, file: !7, line: 44, type: !9)
!85 = !DILocation(line: 44, column: 84, scope: !50)
!86 = !DILocalVariable(name: "shared", arg: 5, scope: !50, file: !7, line: 44, type: !68)
!87 = !DILocation(line: 44, column: 104, scope: !50)
!88 = !DILocation(line: 46, column: 6, scope: !50)
!89 = !DILocation(line: 48, column: 7, scope: !71)
!90 = !DILocation(line: 48, column: 13, scope: !71)
!91 = !DILocation(line: 50, column: 7, scope: !71)
!92 = !DILocation(line: 50, column: 19, scope: !71)
!93 = !DILocation(line: 49, column: 19, scope: !94)
!94 = distinct !DILexicalBlock(scope: !71, file: !7, line: 49, column: 9)
!95 = !DILocation(line: 49, column: 9, scope: !94)
!96 = !DILocation(line: 51, column: 9, scope: !71)
!97 = !DILocation(line: 49, column: 19, scope: !98)
!98 = distinct !DILexicalBlock(scope: !71, file: !7, line: 49, column: 9)
!99 = !DILocation(line: 49, column: 9, scope: !98)
!100 = !DILocation(line: 55, column: 6, scope: !50)
!101 = !DILocation(line: 55, column: 18, scope: !50)
!102 = !DILocation(line: 58, column: 6, scope: !50)
!103 = !DILocation(line: 58, column: 30, scope: !50)
!104 = !DILocation(line: 58, column: 20, scope: !50)
!105 = !DILocation(line: 59, column: 6, scope: !50)
!106 = !DILocation(line: 59, column: 28, scope: !50)
!107 = !DILocation(line: 59, column: 19, scope: !50)
!108 = !DILocation(line: 62, column: 6, scope: !50)
!109 = !DILocation(line: 62, column: 16, scope: !50)
!110 = !DILocation(line: 62, column: 22, scope: !50)
!111 = !DILocation(line: 63, column: 35, scope: !50)
!112 = !DILocation(line: 63, column: 12, scope: !50)
!113 = !DILocation(line: 65, column: 8, scope: !50)
!114 = !DILocation(line: 65, column: 28, scope: !50)
!115 = !DILocation(line: 65, column: 14, scope: !50)
!116 = !DILocation(line: 68, column: 15, scope: !50)
!117 = !DILocation(line: 68, column: 20, scope: !50)
!118 = !DILocation(line: 68, column: 29, scope: !50)
!119 = !DILocation(line: 68, column: 38, scope: !50)
!120 = !DILocation(line: 68, column: 51, scope: !50)
!121 = distinct !DISubprogram(name: "mmap_open", linkageName: "std.io.file.mmap_open", scope: !7, file: !7, line: 81, type: !122, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !124)
!122 = !DISubroutineType(types: !123)
!123 = !{!53, !30, !30, !38, !38, !9, !68}
!124 = !{!125, !126}
!125 = !DILocalVariable(name: "file", scope: !121, file: !7, line: 83, type: !56, align: 8)
!126 = !DILocalVariable(name: "mm", scope: !121, file: !7, line: 85, type: !53, align: 8)
!127 = !DILocalVariable(name: "filename", arg: 1, scope: !121, file: !7, line: 81, type: !30)
!128 = !DILocation(line: 81, column: 31, scope: !121)
!129 = !DILocalVariable(name: "mode", arg: 2, scope: !121, file: !7, line: 81, type: !30)
!130 = !DILocation(line: 81, column: 48, scope: !121)
!131 = !DILocalVariable(name: "offset", arg: 3, scope: !121, file: !7, line: 81, type: !37)
!132 = !DILocation(line: 81, column: 58, scope: !121)
!133 = !DILocalVariable(name: "len", arg: 4, scope: !121, file: !7, line: 81, type: !37)
!134 = !DILocation(line: 81, column: 74, scope: !121)
!135 = !DILocalVariable(name: "access", arg: 5, scope: !121, file: !7, line: 81, type: !9)
!136 = !DILocation(line: 81, column: 103, scope: !121)
!137 = !DILocalVariable(name: "shared", arg: 6, scope: !121, file: !7, line: 81, type: !68)
!138 = !DILocation(line: 81, column: 123, scope: !121)
!139 = !DILocation(line: 83, column: 7, scope: !121)
!140 = !DILocation(line: 83, column: 14, scope: !121)
!141 = !DILocation(line: 85, column: 11, scope: !121)
!142 = !DILocation(line: 85, column: 16, scope: !121)
!143 = !DILocation(line: 84, column: 14, scope: !144)
!144 = distinct !DILexicalBlock(scope: !121, file: !7, line: 84, column: 14)
!145 = !DILocation(line: 88, column: 2, scope: !121)
!146 = !DILocation(line: 90, column: 9, scope: !121)
!147 = distinct !DISubprogram(name: "reopen", linkageName: "std.io.File.reopen", scope: !21, file: !21, line: 56, type: !148, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !150, !30, !30}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "File*", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!151 = !{}
!152 = !DILocalVariable(name: "self", arg: 1, scope: !147, file: !21, line: 56, type: !150)
!153 = !DILocation(line: 56, column: 22, scope: !147)
!154 = !DILocalVariable(name: "filename", arg: 2, scope: !147, file: !21, line: 56, type: !30)
!155 = !DILocation(line: 56, column: 36, scope: !147)
!156 = !DILocalVariable(name: "mode", arg: 3, scope: !147, file: !21, line: 56, type: !30)
!157 = !DILocation(line: 56, column: 53, scope: !147)
!158 = !DILocation(line: 54, column: 11, scope: !159)
!159 = distinct !DILexicalBlock(scope: !147, file: !21, line: 57, column: 1)
!160 = !DILocation(line: 58, column: 14, scope: !147)
!161 = !DILocation(line: 58, column: 2, scope: !147)
!162 = distinct !DISubprogram(name: "seek", linkageName: "std.io.File.seek", scope: !21, file: !21, line: 64, type: !163, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!163 = !DISubroutineType(types: !164)
!164 = !{!38, !150, !165, !20}
!165 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!166 = !DILocalVariable(name: "self", arg: 1, scope: !162, file: !21, line: 64, type: !150)
!167 = !DILocation(line: 64, column: 19, scope: !162)
!168 = !DILocalVariable(name: "offset", arg: 2, scope: !162, file: !21, line: 64, type: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !165)
!170 = !DILocation(line: 64, column: 30, scope: !162)
!171 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !162, file: !21, line: 64, type: !20)
!172 = !DILocation(line: 64, column: 43, scope: !162)
!173 = !DILocation(line: 62, column: 11, scope: !174)
!174 = distinct !DILexicalBlock(scope: !162, file: !21, line: 65, column: 1)
!175 = !DILocation(line: 66, column: 38, scope: !162)
!176 = !DILocation(line: 66, column: 2, scope: !162)
!177 = !DILocation(line: 67, column: 9, scope: !162)
!178 = distinct !DISubprogram(name: "write_byte", linkageName: "std.io.File.write_byte", scope: !21, file: !21, line: 90, type: !179, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !150, !35}
!181 = !DILocalVariable(name: "self", arg: 1, scope: !178, file: !21, line: 90, type: !150)
!182 = !DILocation(line: 90, column: 26, scope: !178)
!183 = !DILocalVariable(name: "c", arg: 2, scope: !178, file: !21, line: 90, type: !35)
!184 = !DILocation(line: 90, column: 38, scope: !178)
!185 = !DILocation(line: 88, column: 11, scope: !186)
!186 = distinct !DILexicalBlock(scope: !178, file: !21, line: 91, column: 1)
!187 = !DILocation(line: 92, column: 26, scope: !178)
!188 = !DILocation(line: 92, column: 29, scope: !178)
!189 = !DILocation(line: 92, column: 9, scope: !178)
!190 = distinct !DISubprogram(name: "close", linkageName: "std.io.File.close", scope: !21, file: !21, line: 98, type: !191, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !150}
!193 = !DILocalVariable(name: "self", arg: 1, scope: !190, file: !21, line: 98, type: !150)
!194 = !DILocation(line: 98, column: 21, scope: !190)
!195 = !DILocation(line: 100, column: 6, scope: !190)
!196 = !DILocation(line: 100, column: 32, scope: !190)
!197 = !DILocation(line: 100, column: 19, scope: !190)
!198 = !DILocation(line: 102, column: 11, scope: !199)
!199 = distinct !DILexicalBlock(scope: !200, file: !21, line: 102, column: 3)
!200 = distinct !DILexicalBlock(scope: !190, file: !21, line: 101, column: 2)
!201 = !DILocation(line: 105, column: 30, scope: !202)
!202 = distinct !DILexicalBlock(scope: !199, file: !21, line: 105, column: 23)
!203 = !DILocation(line: 106, column: 30, scope: !204)
!204 = distinct !DILexicalBlock(scope: !199, file: !21, line: 106, column: 23)
!205 = !DILocation(line: 114, column: 28, scope: !206)
!206 = distinct !DILexicalBlock(scope: !199, file: !21, line: 114, column: 21)
!207 = !DILocation(line: 115, column: 20, scope: !208)
!208 = distinct !DILexicalBlock(scope: !199, file: !21, line: 115, column: 13)
!209 = !DILocation(line: 118, column: 2, scope: !190)
!210 = distinct !DISubprogram(name: "eof", linkageName: "std.io.File.eof", scope: !21, file: !21, line: 124, type: !211, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!211 = !DISubroutineType(types: !212)
!212 = !{!68, !150}
!213 = !DILocalVariable(name: "self", arg: 1, scope: !210, file: !21, line: 124, type: !150)
!214 = !DILocation(line: 124, column: 18, scope: !210)
!215 = !DILocation(line: 122, column: 11, scope: !216)
!216 = distinct !DILexicalBlock(scope: !210, file: !21, line: 125, column: 1)
!217 = !DILocation(line: 126, column: 20, scope: !210)
!218 = !DILocation(line: 126, column: 9, scope: !210)
!219 = distinct !DISubprogram(name: "read", linkageName: "std.io.File.read", scope: !21, file: !21, line: 132, type: !220, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!220 = !DISubroutineType(types: !221)
!221 = !{!38, !150, !31}
!222 = !DILocalVariable(name: "self", arg: 1, scope: !219, file: !21, line: 132, type: !150)
!223 = !DILocation(line: 132, column: 19, scope: !219)
!224 = !DILocalVariable(name: "buffer", arg: 2, scope: !219, file: !21, line: 132, type: !31)
!225 = !DILocation(line: 132, column: 33, scope: !219)
!226 = !DILocation(line: 134, column: 9, scope: !219)
!227 = distinct !DISubprogram(name: "write", linkageName: "std.io.File.write", scope: !21, file: !21, line: 141, type: !220, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!228 = !DILocalVariable(name: "self", arg: 1, scope: !227, file: !21, line: 141, type: !150)
!229 = !DILocation(line: 141, column: 20, scope: !227)
!230 = !DILocalVariable(name: "buffer", arg: 2, scope: !227, file: !21, line: 141, type: !31)
!231 = !DILocation(line: 141, column: 34, scope: !227)
!232 = !DILocation(line: 139, column: 11, scope: !233)
!233 = distinct !DILexicalBlock(scope: !227, file: !21, line: 142, column: 1)
!234 = !DILocation(line: 143, column: 9, scope: !227)
!235 = distinct !DISubprogram(name: "read_byte", linkageName: "std.io.File.read_byte", scope: !21, file: !21, line: 156, type: !236, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !238)
!236 = !DISubroutineType(types: !237)
!237 = !{!35, !150}
!238 = !{!239}
!239 = !DILocalVariable(name: "c", scope: !235, file: !21, line: 158, type: !10, align: 4)
!240 = !DILocalVariable(name: "self", arg: 1, scope: !235, file: !21, line: 156, type: !150)
!241 = !DILocation(line: 156, column: 25, scope: !235)
!242 = !DILocation(line: 158, column: 6, scope: !235)
!243 = !DILocation(line: 158, column: 22, scope: !235)
!244 = !DILocation(line: 158, column: 10, scope: !235)
!245 = !DILocation(line: 159, column: 6, scope: !235)
!246 = !DILocation(line: 159, column: 22, scope: !235)
!247 = !DILocation(line: 160, column: 9, scope: !235)
!248 = distinct !DISubprogram(name: "flush", linkageName: "std.io.File.flush", scope: !21, file: !21, line: 222, type: !191, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!249 = !DILocalVariable(name: "self", arg: 1, scope: !248, file: !21, line: 222, type: !150)
!250 = !DILocation(line: 222, column: 21, scope: !248)
!251 = !DILocation(line: 220, column: 11, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !21, line: 223, column: 1)
!253 = !DILocation(line: 224, column: 15, scope: !248)
!254 = !DILocation(line: 224, column: 2, scope: !248)
!255 = distinct !DISubprogram(name: "fd", linkageName: "std.io.File.fd", scope: !21, file: !21, line: 146, type: !256, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !56}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fd", scope: !21, file: !21, line: 56, baseType: !10, align: 4)
!259 = !DILocalVariable(name: "self", arg: 1, scope: !255, file: !21, line: 146, type: !56)
!260 = !DILocation(line: 146, column: 15, scope: !255)
!261 = !DILocation(line: 148, column: 22, scope: !255)
!262 = !DILocation(line: 148, column: 9, scope: !255)
!263 = distinct !DISubprogram(name: "isatty", linkageName: "std.io.File.isatty", scope: !21, file: !21, line: 151, type: !264, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!264 = !DISubroutineType(types: !265)
!265 = !{!68, !56}
!266 = !DILocalVariable(name: "self", arg: 1, scope: !263, file: !21, line: 151, type: !56)
!267 = !DILocation(line: 151, column: 21, scope: !263)
!268 = !DILocation(line: 153, column: 22, scope: !263)
!269 = !DILocation(line: 153, column: 9, scope: !263)
!270 = distinct !DISubprogram(name: "open", linkageName: "std.io.file.open", scope: !21, file: !21, line: 12, type: !271, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!271 = !DISubroutineType(types: !272)
!272 = !{!56, !30, !30}
!273 = !DILocalVariable(name: "filename", arg: 1, scope: !270, file: !21, line: 12, type: !30)
!274 = !DILocation(line: 12, column: 22, scope: !270)
!275 = !DILocalVariable(name: "mode", arg: 2, scope: !270, file: !21, line: 12, type: !30)
!276 = !DILocation(line: 12, column: 39, scope: !270)
!277 = !DILocation(line: 14, column: 21, scope: !270)
!278 = !DILocation(line: 14, column: 9, scope: !270)
!279 = distinct !DISubprogram(name: "open_path", linkageName: "std.io.file.open_path", scope: !21, file: !21, line: 17, type: !280, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!280 = !DISubroutineType(types: !281)
!281 = !{!56, !27, !30}
!282 = !DILocalVariable(name: "path", arg: 1, scope: !279, file: !21, line: 17, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !21, file: !21, line: 14, baseType: !27, align: 8)
!284 = !DILocation(line: 17, column: 25, scope: !279)
!285 = !DILocalVariable(name: "mode", arg: 2, scope: !279, file: !21, line: 17, type: !30)
!286 = !DILocation(line: 17, column: 38, scope: !279)
!287 = !DILocation(line: 19, column: 38, scope: !279)
!288 = !DILocation(line: 19, column: 21, scope: !279)
!289 = !DILocation(line: 19, column: 9, scope: !279)
!290 = distinct !DISubprogram(name: "exists", linkageName: "std.io.file.exists", scope: !21, file: !21, line: 22, type: !291, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!291 = !DISubroutineType(types: !292)
!292 = !{!68, !30}
!293 = !DILocalVariable(name: "file", arg: 1, scope: !290, file: !21, line: 22, type: !30)
!294 = !DILocation(line: 22, column: 23, scope: !290)
!295 = !DILocalVariable(name: "state", scope: !296, file: !21, line: 648, type: !299, align: 8)
!296 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !297, file: !297, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !298)
!297 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!298 = !{!295}
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !21, file: !21, line: 420, baseType: !300, align: 8)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !301, size: 64, align: 64, dwarfAddressSpace: 0)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !21, file: !21, line: 31, size: 704, align: 64, elements: !302, identifier: "std.core.mem.allocator.TempAllocator")
!302 = !{!303, !304, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !301, file: !21, line: 33, baseType: !41, size: 128, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !301, file: !21, line: 34, baseType: !305, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !306, size: 64, align: 64, dwarfAddressSpace: 0)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !21, file: !21, line: 54, size: 256, align: 64, elements: !307, identifier: "std.core.mem.allocator.TempAllocatorPage")
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !306, file: !21, line: 56, baseType: !305, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !306, file: !21, line: 57, baseType: !44, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !306, file: !21, line: 58, baseType: !37, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !306, file: !21, line: 59, baseType: !37, size: 64, align: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !21, line: 60, baseType: !313, align: 8, offset: 256)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, align: 8, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 0, lowerBound: 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !301, file: !21, line: 35, baseType: !300, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !301, file: !21, line: 36, baseType: !68, size: 8, align: 8, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !301, file: !21, line: 37, baseType: !37, size: 64, align: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !301, file: !21, line: 38, baseType: !37, size: 64, align: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !301, file: !21, line: 39, baseType: !37, size: 64, align: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !301, file: !21, line: 40, baseType: !37, size: 64, align: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !301, file: !21, line: 41, baseType: !37, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !301, file: !21, line: 42, baseType: !37, size: 64, align: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !21, line: 43, baseType: !313, align: 8, offset: 704)
!325 = !DILocation(line: 648, column: 12, scope: !296, inlinedAt: !326)
!326 = !DILocation(line: 22, column: 32, scope: !290)
!327 = !DILocation(line: 648, column: 20, scope: !296, inlinedAt: !326)
!328 = !DILocation(line: 24, column: 39, scope: !329)
!329 = distinct !DILexicalBlock(scope: !290, file: !21, line: 23, column: 1)
!330 = !DILocation(line: 24, column: 9, scope: !329)
!331 = !DILocation(line: 651, column: 23, scope: !332, inlinedAt: !326)
!332 = distinct !DILexicalBlock(scope: !296, file: !297, line: 650, column: 2)
!333 = !DILocation(line: 651, column: 3, scope: !332, inlinedAt: !326)
!334 = distinct !DISubprogram(name: "from_handle", linkageName: "std.io.file.from_handle", scope: !21, file: !21, line: 27, type: !335, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!335 = !DISubroutineType(types: !336)
!336 = !{!56, !44}
!337 = !DILocalVariable(name: "file", arg: 1, scope: !334, file: !21, line: 27, type: !59)
!338 = !DILocation(line: 27, column: 27, scope: !334)
!339 = !DILocation(line: 29, column: 19, scope: !334)
!340 = distinct !DISubprogram(name: "is_file", linkageName: "std.io.file.is_file", scope: !21, file: !21, line: 32, type: !291, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!341 = !DILocalVariable(name: "path", arg: 1, scope: !340, file: !21, line: 32, type: !30)
!342 = !DILocation(line: 32, column: 24, scope: !340)
!343 = !DILocation(line: 34, column: 28, scope: !340)
!344 = !DILocation(line: 34, column: 9, scope: !340)
!345 = distinct !DISubprogram(name: "is_dir", linkageName: "std.io.file.is_dir", scope: !21, file: !21, line: 37, type: !291, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!346 = !DILocalVariable(name: "path", arg: 1, scope: !345, file: !21, line: 37, type: !30)
!347 = !DILocation(line: 37, column: 23, scope: !345)
!348 = !DILocation(line: 39, column: 27, scope: !345)
!349 = !DILocation(line: 39, column: 9, scope: !345)
!350 = distinct !DISubprogram(name: "get_size", linkageName: "std.io.file.get_size", scope: !21, file: !21, line: 42, type: !351, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!351 = !DISubroutineType(types: !352)
!352 = !{!38, !30}
!353 = !DILocalVariable(name: "path", arg: 1, scope: !350, file: !21, line: 42, type: !30)
!354 = !DILocation(line: 42, column: 25, scope: !350)
!355 = !DILocation(line: 44, column: 9, scope: !350)
!356 = distinct !DISubprogram(name: "delete", linkageName: "std.io.file.delete", scope: !21, file: !21, line: 47, type: !357, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !151)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !30}
!359 = !DILocalVariable(name: "filename", arg: 1, scope: !356, file: !21, line: 47, type: !30)
!360 = !DILocation(line: 47, column: 24, scope: !356)
!361 = !DILocation(line: 49, column: 27, scope: !356)
!362 = !DILocation(line: 49, column: 9, scope: !356)
!363 = distinct !DISubprogram(name: "load_buffer", linkageName: "std.io.file.load_buffer", scope: !21, file: !21, line: 170, type: !364, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{!31, !30, !31}
!366 = !{!367, !368, !369}
!367 = !DILocalVariable(name: "file", scope: !363, file: !21, line: 172, type: !56, align: 8)
!368 = !DILocalVariable(name: "len", scope: !363, file: !21, line: 174, type: !37, align: 8)
!369 = !DILocalVariable(name: "read", scope: !363, file: !21, line: 177, type: !37, align: 8)
