; ModuleID = 'std::encoding::csv'
source_filename = "std::encoding::csv"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.365 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any.367 = type { ptr, i64 }
%"char[].364" = type { ptr, i64 }
%"any[].369" = type { ptr, i64 }
%"char[][].368" = type { ptr, i64 }
%CsvRow = type { %"char[][].368", %"char[].364", %any.367 }
%CsvReader = type { %any.367, %"char[].364" }

@"$ct.std.encoding.csv.CsvReader" = linkonce global %.introspect.365 { i8 10, i64 0, ptr null, i64 32, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.encoding.csv.CsvRow" = linkonce global %.introspect.365 { i8 10, i64 0, ptr null, i64 48, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@.str = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@"$ct.sa$String" = linkonce global %.introspect.365 { i8 16, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.String" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.String" = linkonce global %.introspect.365 { i8 18, i64 ptrtoint (ptr @"$ct.sa$char" to i64), ptr null, i64 16, i64 ptrtoint (ptr @"$ct.sa$char" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.sa$char" = linkonce global %.introspect.365 { i8 16, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.char" to i64), i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "csv.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/encoding")
!8 = distinct !DISubprogram(name: "to_format", linkageName: "std.encoding.csv.CsvRow.to_format", scope: !7, file: !7, line: 18, type: !9, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !56)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !12, !37}
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvRow*", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvRow", scope: !7, file: !7, line: 11, size: 384, align: 64, elements: !14, identifier: "std.encoding.csv.CsvRow")
!14 = !{!15, !29, !30}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !13, file: !7, line: 13, baseType: !16, size: 128, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !17, identifier: "String[]")
!17 = !{!18, !28}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !16, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !22, identifier: "char[]")
!22 = !{!23, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !21, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !16, baseType: !27, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !13, file: !7, line: 14, baseType: !20, size: 128, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !13, file: !7, line: 15, baseType: !31, size: 128, align: 64, offset: 256)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !32, identifier: "Allocator")
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !31, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 63, size: 320, align: 64, elements: !39, identifier: "std.io.Formatter")
!39 = !{!40, !41, !46}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !38, file: !7, line: 65, baseType: !34, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !38, file: !7, line: 66, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 16, baseType: !43, align: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !34, !25}
!46 = !DIDerivedType(tag: DW_TAG_member, scope: !38, file: !7, line: 67, baseType: !47, size: 192, align: 64, offset: 128)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !38, file: !7, line: 67, size: 192, align: 64, elements: !48)
!48 = !{!49, !51, !52, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !47, file: !7, line: 69, baseType: !50, size: 32, align: 32)
!50 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !47, file: !7, line: 70, baseType: !50, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !47, file: !7, line: 71, baseType: !50, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !47, file: !7, line: 72, baseType: !54, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !55)
!55 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!56 = !{}
!57 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 18, type: !12)
!58 = !DILocation(line: 18, column: 26, scope: !8)
!59 = !DILocalVariable(name: "f", arg: 2, scope: !8, file: !7, line: 18, type: !37)
!60 = !DILocation(line: 18, column: 44, scope: !8)
!61 = !DILocation(line: 20, column: 24, scope: !8)
!62 = !DILocation(line: 20, column: 9, scope: !8)
!63 = distinct !DISubprogram(name: "len", linkageName: "std.encoding.csv.CsvRow.len", scope: !7, file: !7, line: 23, type: !64, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !56)
!64 = !DISubroutineType(types: !65)
!65 = !{!27, !12}
!66 = !DILocalVariable(name: "self", arg: 1, scope: !63, file: !7, line: 23, type: !12)
!67 = !DILocation(line: 23, column: 19, scope: !63)
!68 = !DILocation(line: 25, column: 9, scope: !63)
!69 = distinct !DISubprogram(name: "get_col", linkageName: "std.encoding.csv.CsvRow.get_col", scope: !7, file: !7, line: 31, type: !70, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !56)
!70 = !DISubroutineType(types: !71)
!71 = !{!20, !12, !11}
!72 = !DILocalVariable(name: "self", arg: 1, scope: !69, file: !7, line: 31, type: !12)
!73 = !DILocation(line: 31, column: 26, scope: !69)
!74 = !DILocalVariable(name: "col", arg: 2, scope: !69, file: !7, line: 31, type: !27)
!75 = !DILocation(line: 31, column: 37, scope: !69)
!76 = !DILocation(line: 29, column: 17, scope: !77)
!77 = distinct !DILexicalBlock(scope: !69, file: !7, line: 32, column: 1)
!78 = !DILocation(line: 29, column: 11, scope: !77)
!79 = !DILocation(line: 33, column: 9, scope: !69)
!80 = !DILocation(line: 33, column: 19, scope: !69)
!81 = distinct !DISubprogram(name: "init", linkageName: "std.encoding.csv.CsvReader.init", scope: !7, file: !7, line: 36, type: !82, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !56)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84, !88, !20}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvReader*", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvReader", scope: !7, file: !7, line: 5, size: 256, align: 64, elements: !86, identifier: "std.encoding.csv.CsvReader")
!86 = !{!87, !92}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !85, file: !7, line: 7, baseType: !88, size: 128, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !89, identifier: "InStream")
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !88, baseType: !34, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, baseType: !36, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "separator", scope: !85, file: !7, line: 8, baseType: !20, size: 128, align: 64, offset: 128)
!93 = !DILocalVariable(name: "self", arg: 1, scope: !81, file: !7, line: 36, type: !84)
!94 = !DILocation(line: 36, column: 24, scope: !81)
!95 = !DILocalVariable(name: "stream", arg: 2, scope: !81, file: !7, line: 36, type: !88)
!96 = !DILocation(line: 36, column: 40, scope: !81)
!97 = !DILocalVariable(name: "separator", arg: 3, scope: !81, file: !7, line: 36, type: !20)
!98 = !DILocation(line: 36, column: 55, scope: !81)
!99 = !DILocation(line: 38, column: 2, scope: !81)
!100 = !DILocation(line: 39, column: 2, scope: !81)
!101 = distinct !DISubprogram(name: "read_row", linkageName: "std.encoding.csv.CsvReader.read_row", scope: !7, file: !7, line: 44, type: !102, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !104)
!102 = !DISubroutineType(types: !103)
!103 = !{!13, !85, !31}
!104 = !{!105, !106}
!105 = !DILocalVariable(name: "row", scope: !101, file: !7, line: 46, type: !20, align: 8)
!106 = !DILocalVariable(name: "list", scope: !101, file: !7, line: 48, type: !16, align: 8)
!107 = !DILocalVariable(name: "self", arg: 1, scope: !101, file: !7, line: 44, type: !85)
!108 = !DILocation(line: 44, column: 31, scope: !101)
!109 = !DILocalVariable(name: "allocator", arg: 2, scope: !101, file: !7, line: 44, type: !31)
!110 = !DILocation(line: 44, column: 47, scope: !101)
!111 = !DILocation(line: 46, column: 9, scope: !101)
!112 = !DILocation(line: 61, column: 6, scope: !113, inlinedAt: !123)
!113 = distinct !DISubprogram(name: "readline", linkageName: "readline", scope: !114, file: !114, line: 59, scopeLine: 59, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !115)
!114 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io")
!115 = !{!116, !121}
!116 = !DILocalVariable(name: "str", scope: !117, file: !7, line: 63, type: !118, align: 8)
!117 = distinct !DILexicalBlock(scope: !113, file: !114, line: 62, column: 2)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !7, file: !7, line: 7, baseType: !119, align: 8)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !120, size: 64, align: 64, dwarfAddressSpace: 0)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !7, file: !7, line: 8, baseType: null, align: 1)
!121 = !DILocalVariable(name: "str", scope: !122, file: !7, line: 69, type: !118, align: 8)
!122 = distinct !DILexicalBlock(scope: !113, file: !114, line: 68, column: 2)
!123 = !DILocation(line: 46, column: 15, scope: !101)
!124 = !DILocation(line: 61, column: 19, scope: !113, inlinedAt: !123)
!125 = !DILocation(line: 63, column: 11, scope: !117, inlinedAt: !123)
!126 = !DILocation(line: 63, column: 17, scope: !117, inlinedAt: !123)
!127 = !DILocalVariable(name: "func", scope: !128, file: !7, line: 104, type: !136, align: 8)
!128 = distinct !DISubprogram(name: "readline_to_stream", linkageName: "readline_to_stream", scope: !114, file: !114, line: 100, scopeLine: 100, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !129)
!129 = !{!127, !130, !131, !132, !135}
!130 = !DILocalVariable(name: "val", scope: !128, file: !7, line: 105, type: !25, align: 1)
!131 = !DILocalVariable(name: "len", scope: !128, file: !7, line: 115, type: !27, align: 8)
!132 = !DILocalVariable(name: "c", scope: !133, file: !7, line: 128, type: !25, align: 1)
!133 = distinct !DILexicalBlock(scope: !134, file: !114, line: 126, column: 2)
!134 = distinct !DILexicalBlock(scope: !128, file: !114, line: 125, column: 2)
!135 = !DILocalVariable(name: "err", scope: !133, file: !7, line: 132, type: !54, align: 8)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "read_byte", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !DISubroutineType(types: !138)
!138 = !{!25, !34}
!139 = !DILocation(line: 104, column: 7, scope: !128, inlinedAt: !140)
!140 = !DILocation(line: 64, column: 3, scope: !117, inlinedAt: !123)
!141 = !DILocation(line: 104, column: 15, scope: !128, inlinedAt: !140)
!142 = !DILocation(line: 105, column: 8, scope: !128, inlinedAt: !140)
!143 = !DILocation(line: 105, column: 14, scope: !128, inlinedAt: !140)
!144 = !DILocation(line: 114, column: 6, scope: !128, inlinedAt: !140)
!145 = !DILocation(line: 114, column: 26, scope: !128, inlinedAt: !140)
!146 = !DILocation(line: 115, column: 6, scope: !128, inlinedAt: !140)
!147 = !DILocation(line: 116, column: 6, scope: !128, inlinedAt: !140)
!148 = !DILocation(line: 121, column: 26, scope: !149, inlinedAt: !140)
!149 = distinct !DILexicalBlock(scope: !128, file: !114, line: 117, column: 2)
!150 = !DILocation(line: 121, column: 4, scope: !149, inlinedAt: !140)
!151 = !DILocation(line: 123, column: 3, scope: !149, inlinedAt: !140)
!152 = !DILocation(line: 125, column: 2, scope: !128, inlinedAt: !140)
!153 = !DILocation(line: 128, column: 10, scope: !133, inlinedAt: !140)
!154 = !DILocation(line: 128, column: 14, scope: !133, inlinedAt: !140)
!155 = !DILocation(line: 132, column: 13, scope: !133, inlinedAt: !140)
!156 = !DILocation(line: 132, column: 19, scope: !133, inlinedAt: !140)
!157 = !DILocation(line: 134, column: 8, scope: !158, inlinedAt: !140)
!158 = distinct !DILexicalBlock(scope: !133, file: !114, line: 133, column: 3)
!159 = !DILocation(line: 134, column: 24, scope: !158, inlinedAt: !140)
!160 = !DILocation(line: 135, column: 11, scope: !158, inlinedAt: !140)
!161 = !DILocation(line: 137, column: 7, scope: !133, inlinedAt: !140)
!162 = !DILocation(line: 137, column: 18, scope: !133, inlinedAt: !140)
!163 = !DILocation(line: 138, column: 7, scope: !133, inlinedAt: !140)
!164 = !DILocation(line: 138, column: 18, scope: !133, inlinedAt: !140)
!165 = !DILocation(line: 142, column: 26, scope: !133, inlinedAt: !140)
!166 = !DILocation(line: 142, column: 4, scope: !133, inlinedAt: !140)
!167 = !DILocation(line: 144, column: 3, scope: !133, inlinedAt: !140)
!168 = !DILocation(line: 146, column: 9, scope: !128, inlinedAt: !140)
!169 = !DILocation(line: 65, column: 10, scope: !117, inlinedAt: !123)
!170 = !DILocalVariable(name: "state", scope: !171, file: !7, line: 648, type: !174, align: 8)
!171 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !172, file: !172, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !173)
!172 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!173 = !{!170}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 420, baseType: !175, align: 8)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !176, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !177, identifier: "std.core.mem.allocator.TempAllocator")
!177 = !{!178, !179, !191, !192, !194, !195, !196, !197, !198, !199, !200}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !176, file: !7, line: 33, baseType: !31, size: 128, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !176, file: !7, line: 34, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !182, identifier: "std.core.mem.allocator.TempAllocatorPage")
!182 = !{!183, !184, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !181, file: !7, line: 56, baseType: !180, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !181, file: !7, line: 57, baseType: !34, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !181, file: !7, line: 58, baseType: !27, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !181, file: !7, line: 59, baseType: !27, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !7, line: 60, baseType: !188, align: 8, offset: 256)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, align: 8, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 0, lowerBound: 0)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !176, file: !7, line: 35, baseType: !175, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !176, file: !7, line: 36, baseType: !193, size: 8, align: 8, offset: 256)
!193 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !176, file: !7, line: 37, baseType: !27, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !176, file: !7, line: 38, baseType: !27, size: 64, align: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !176, file: !7, line: 39, baseType: !27, size: 64, align: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !176, file: !7, line: 40, baseType: !27, size: 64, align: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !176, file: !7, line: 41, baseType: !27, size: 64, align: 64, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !176, file: !7, line: 42, baseType: !27, size: 64, align: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !7, line: 43, baseType: !188, align: 8, offset: 704)
!201 = !DILocation(line: 648, column: 12, scope: !171, inlinedAt: !202)
!202 = !DILocation(line: 67, column: 2, scope: !113, inlinedAt: !123)
!203 = !DILocation(line: 648, column: 20, scope: !171, inlinedAt: !202)
!204 = !DILocation(line: 69, column: 11, scope: !122, inlinedAt: !123)
!205 = !DILocation(line: 69, column: 17, scope: !122, inlinedAt: !123)
!206 = !DILocalVariable(name: "func", scope: !207, file: !7, line: 104, type: !136, align: 8)
!207 = distinct !DISubprogram(name: "readline_to_stream", linkageName: "readline_to_stream", scope: !114, file: !114, line: 100, scopeLine: 100, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !208)
!208 = !{!206, !209, !210, !211, !214}
!209 = !DILocalVariable(name: "val", scope: !207, file: !7, line: 105, type: !25, align: 1)
!210 = !DILocalVariable(name: "len", scope: !207, file: !7, line: 115, type: !27, align: 8)
!211 = !DILocalVariable(name: "c", scope: !212, file: !7, line: 128, type: !25, align: 1)
!212 = distinct !DILexicalBlock(scope: !213, file: !114, line: 126, column: 2)
!213 = distinct !DILexicalBlock(scope: !207, file: !114, line: 125, column: 2)
!214 = !DILocalVariable(name: "err", scope: !212, file: !7, line: 132, type: !54, align: 8)
!215 = !DILocation(line: 104, column: 7, scope: !207, inlinedAt: !216)
!216 = !DILocation(line: 70, column: 3, scope: !122, inlinedAt: !123)
!217 = !DILocation(line: 104, column: 15, scope: !207, inlinedAt: !216)
!218 = !DILocation(line: 105, column: 8, scope: !207, inlinedAt: !216)
!219 = !DILocation(line: 105, column: 14, scope: !207, inlinedAt: !216)
!220 = !DILocation(line: 114, column: 6, scope: !207, inlinedAt: !216)
!221 = !DILocation(line: 114, column: 26, scope: !207, inlinedAt: !216)
!222 = !DILocation(line: 115, column: 6, scope: !207, inlinedAt: !216)
!223 = !DILocation(line: 116, column: 6, scope: !207, inlinedAt: !216)
!224 = !DILocation(line: 121, column: 26, scope: !225, inlinedAt: !216)
!225 = distinct !DILexicalBlock(scope: !207, file: !114, line: 117, column: 2)
!226 = !DILocation(line: 121, column: 4, scope: !225, inlinedAt: !216)
!227 = !DILocation(line: 123, column: 3, scope: !225, inlinedAt: !216)
!228 = !DILocation(line: 125, column: 2, scope: !207, inlinedAt: !216)
!229 = !DILocation(line: 128, column: 10, scope: !212, inlinedAt: !216)
!230 = !DILocation(line: 128, column: 14, scope: !212, inlinedAt: !216)
!231 = !DILocation(line: 132, column: 13, scope: !212, inlinedAt: !216)
!232 = !DILocation(line: 132, column: 19, scope: !212, inlinedAt: !216)
!233 = !DILocation(line: 134, column: 8, scope: !234, inlinedAt: !216)
!234 = distinct !DILexicalBlock(scope: !212, file: !114, line: 133, column: 3)
!235 = !DILocation(line: 134, column: 24, scope: !234, inlinedAt: !216)
!236 = !DILocation(line: 135, column: 11, scope: !234, inlinedAt: !216)
!237 = !DILocation(line: 137, column: 7, scope: !212, inlinedAt: !216)
!238 = !DILocation(line: 137, column: 18, scope: !212, inlinedAt: !216)
!239 = !DILocation(line: 138, column: 7, scope: !212, inlinedAt: !216)
!240 = !DILocation(line: 138, column: 18, scope: !212, inlinedAt: !216)
!241 = !DILocation(line: 142, column: 26, scope: !212, inlinedAt: !216)
!242 = !DILocation(line: 142, column: 4, scope: !212, inlinedAt: !216)
!243 = !DILocation(line: 144, column: 3, scope: !212, inlinedAt: !216)
!244 = !DILocation(line: 146, column: 9, scope: !207, inlinedAt: !216)
!245 = !DILocation(line: 651, column: 23, scope: !246, inlinedAt: !202)
!246 = distinct !DILexicalBlock(scope: !171, file: !172, line: 650, column: 2)
!247 = !DILocation(line: 651, column: 3, scope: !246, inlinedAt: !202)
!248 = !DILocation(line: 71, column: 23, scope: !122, inlinedAt: !123)
!249 = !DILocation(line: 71, column: 10, scope: !122, inlinedAt: !123)
!250 = !DILocation(line: 651, column: 23, scope: !251, inlinedAt: !202)
