; ModuleID = 'std::os::darwin'
source_filename = "std::os::darwin"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.474 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].473" = type { ptr, i64 }
%any.476 = type { ptr, i64 }
%Backtrace.480 = type { i64, %"char[].473", %"char[].473", %"char[].473", i32, %any.476, i8 }
%"any[].477" = type { ptr, i64 }
%"char[][].478" = type { ptr, i64 }
%OnStackAllocator.479 = type { %any.476, %"char[].473", i64, ptr }
%Darwin_Dl_info = type { ptr, ptr, ptr, ptr }
%"void*[].481" = type { ptr, i64 }
%List.482 = type { i64, i64, %any.476, ptr }

@"$ct.std.os.darwin.Darwin_Dl_info" = linkonce global %.introspect.474 { i8 10, i64 0, ptr null, i64 32, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.darwin.Darwin_segment_command_64" = linkonce global %.introspect.474 { i8 10, i64 0, ptr null, i64 72, i64 0, i64 11, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.darwin.Darwin_mach_timebase_info" = linkonce global %.introspect.474 { i8 10, i64 0, ptr null, i64 8, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.darwin.NSSearchPathDomainMask" = linkonce global %.introspect.474 { i8 9, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.ulong" to i64), i64 5, [0 x i64] zeroinitializer }, align 8

!41 = distinct !DIGlobalVariable(name: "HW_EPOCH", linkageName: "std.os.darwin.HW_EPOCH", scope: !2, file: !2, line: 24, type: !3, isLocal: false, isDefinition: true, align: 4)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "HW_FLOATINGPT", linkageName: "std.os.darwin.HW_FLOATINGPT", scope: !2, file: !2, line: 25, type: !3, isLocal: false, isDefinition: true, align: 4)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "HW_MACHINE_ARCH", linkageName: "std.os.darwin.HW_MACHINE_ARCH", scope: !2, file: !2, line: 26, type: !3, isLocal: false, isDefinition: true, align: 4)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "HW_VECTORUNIT", linkageName: "std.os.darwin.HW_VECTORUNIT", scope: !2, file: !2, line: 27, type: !3, isLocal: false, isDefinition: true, align: 4)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "HW_BUS_FREQ", linkageName: "std.os.darwin.HW_BUS_FREQ", scope: !2, file: !2, line: 28, type: !3, isLocal: false, isDefinition: true, align: 4)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "HW_CPU_FREQ", linkageName: "std.os.darwin.HW_CPU_FREQ", scope: !2, file: !2, line: 29, type: !3, isLocal: false, isDefinition: true, align: 4)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "HW_CACHELINE", linkageName: "std.os.darwin.HW_CACHELINE", scope: !2, file: !2, line: 30, type: !3, isLocal: false, isDefinition: true, align: 4)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "HW_L1ICACHESIZE", linkageName: "std.os.darwin.HW_L1ICACHESIZE", scope: !2, file: !2, line: 31, type: !3, isLocal: false, isDefinition: true, align: 4)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "HW_L1DCACHESIZE", linkageName: "std.os.darwin.HW_L1DCACHESIZE", scope: !2, file: !2, line: 32, type: !3, isLocal: false, isDefinition: true, align: 4)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "HW_L2SETTINGS", linkageName: "std.os.darwin.HW_L2SETTINGS", scope: !2, file: !2, line: 33, type: !3, isLocal: false, isDefinition: true, align: 4)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "HW_L2CACHESIZE", linkageName: "std.os.darwin.HW_L2CACHESIZE", scope: !2, file: !2, line: 34, type: !3, isLocal: false, isDefinition: true, align: 4)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "HW_L3SETTINGS", linkageName: "std.os.darwin.HW_L3SETTINGS", scope: !2, file: !2, line: 35, type: !3, isLocal: false, isDefinition: true, align: 4)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "HW_L3CACHESIZE", linkageName: "std.os.darwin.HW_L3CACHESIZE", scope: !2, file: !2, line: 36, type: !3, isLocal: false, isDefinition: true, align: 4)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "HW_MAXID", linkageName: "std.os.darwin.HW_MAXID", scope: !2, file: !2, line: 37, type: !3, isLocal: false, isDefinition: true, align: 4)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "path", linkageName: "executable_path.path", scope: !2, file: !2, line: 84, type: !70, isLocal: true, isDefinition: true, align: 1)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 32768, align: 8, elements: !72)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!73}
!73 = !DISubrange(count: 4096, lowerBound: 0)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "len", linkageName: "executable_path.len", scope: !2, file: !2, line: 85, type: !76, isLocal: true, isDefinition: true, align: 4)
!76 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!77 = !{i32 2, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 2, !"wchar_size", i32 4}
!80 = !{i32 4, !"PIC Level", i32 2}
!81 = !{i32 1, !"uwtable", i32 1}
!82 = !{i32 2, !"frame-pointer", i32 1}
!83 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !84, globals: !90, splitDebugInlining: false)
!84 = !{!85, !89}
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NSSearchPathDirectory", scope: !86, file: !86, line: 13, baseType: !87, size: 64, align: 64, elements: !88)
!86 = !DIFile(filename: "general.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/os/macos")
!87 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!88 = !{}
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NSSearchPathDomainMask", scope: !86, file: !86, line: 4, baseType: !87, size: 64, align: 64, elements: !88)
!90 = !{!0, !4, !6, !8, !10, !12, !14, !16, !18, !20, !22, !24, !26, !28, !30, !32, !34, !36, !38, !40, !42, !44, !46, !48, !50, !52, !54, !56, !58, !60, !62, !64, !66, !68, !74}
!91 = distinct !DISubprogram(name: "executable_path", linkageName: "std.os.darwin.executable_path", scope: !2, file: !2, line: 82, type: !92, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !100)
!92 = !DISubroutineType(types: !93)
!93 = !{!94}
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !95, identifier: "char[]")
!95 = !{!96, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !94, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !94, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !87)
!100 = !{!101, !103}
!101 = !DILocalVariable(name: "buf", scope: !102, file: !2, line: 88, type: !70, align: 1)
!102 = distinct !DILexicalBlock(scope: !91, file: !2, line: 87, column: 2)
!103 = !DILocalVariable(name: "temp_len", scope: !102, file: !2, line: 89, type: !76, align: 4)
!104 = !DILocation(line: 86, column: 6, scope: !91)
!105 = !DILocation(line: 88, column: 14, scope: !102)
!106 = !DILocation(line: 89, column: 8, scope: !102)
!107 = !DILocation(line: 89, column: 19, scope: !102)
!108 = !DILocation(line: 90, column: 10, scope: !102)
!109 = !DILocation(line: 90, column: 66, scope: !102)
!110 = !DILocation(line: 91, column: 12, scope: !102)
!111 = !DILocation(line: 92, column: 24, scope: !102)
!112 = !DILocation(line: 92, column: 12, scope: !102)
!113 = !DILocation(line: 94, column: 26, scope: !91)
!114 = distinct !DISubprogram(name: "load_address", linkageName: "std.os.darwin.load_address.19116", scope: !2, file: !2, line: 97, type: !115, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{!87}
!117 = !{!118, !136, !138, !139, !141}
!118 = !DILocalVariable(name: "cmd", scope: !114, file: !2, line: 99, type: !119, align: 8)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Darwin_segment_command_64*", baseType: !120, size: 64, align: 64, dwarfAddressSpace: 0)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Darwin_segment_command_64", scope: !2, file: !2, line: 55, size: 576, align: 64, elements: !121, identifier: "std.os.darwin.Darwin_segment_command_64")
!121 = !{!122, !123, !124, !128, !129, !130, !131, !132, !133, !134, !135}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !120, file: !2, line: 57, baseType: !76, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !120, file: !2, line: 58, baseType: !76, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !120, file: !2, line: 59, baseType: !125, size: 128, align: 8, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 16, lowerBound: 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vmaddr", scope: !120, file: !2, line: 60, baseType: !87, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vmsize", scope: !120, file: !2, line: 61, baseType: !87, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fileoff", scope: !120, file: !2, line: 62, baseType: !87, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !120, file: !2, line: 63, baseType: !87, size: 64, align: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "maxprot", scope: !120, file: !2, line: 64, baseType: !3, size: 32, align: 32, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initprot", scope: !120, file: !2, line: 65, baseType: !3, size: 32, align: 32, offset: 480)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nsects", scope: !120, file: !2, line: 66, baseType: !76, size: 32, align: 32, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !2, line: 67, baseType: !76, size: 32, align: 32, offset: 544)
!136 = !DILocalVariable(name: "path", scope: !114, file: !2, line: 101, type: !137, align: 8)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !94)
!138 = !DILocalVariable(name: "dyld_count", scope: !114, file: !2, line: 102, type: !76, align: 4)
!139 = !DILocalVariable(name: "i", scope: !140, file: !2, line: 103, type: !76, align: 4)
!140 = distinct !DILexicalBlock(scope: !114, file: !2, line: 103, column: 2)
!141 = !DILocalVariable(name: "image_name", scope: !142, file: !2, line: 105, type: !143, align: 8)
!142 = distinct !DILexicalBlock(scope: !140, file: !2, line: 104, column: 2)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 11, baseType: !97, align: 8)
!144 = !DILocation(line: 99, column: 29, scope: !114)
!145 = !DILocation(line: 99, column: 35, scope: !114)
!146 = !DILocation(line: 100, column: 6, scope: !114)
!147 = !DILocation(line: 100, column: 19, scope: !114)
!148 = !DILocation(line: 101, column: 9, scope: !114)
!149 = !DILocation(line: 101, column: 16, scope: !114)
!150 = !DILocation(line: 101, column: 42, scope: !114)
!151 = !DILocation(line: 102, column: 7, scope: !114)
!152 = !DILocation(line: 102, column: 20, scope: !114)
!153 = !DILocation(line: 103, column: 12, scope: !140)
!154 = !DILocation(line: 103, column: 16, scope: !140)
!155 = !DILocation(line: 103, column: 19, scope: !140)
!156 = !DILocation(line: 103, column: 23, scope: !140)
!157 = !DILocation(line: 105, column: 11, scope: !142)
!158 = !DILocation(line: 105, column: 53, scope: !142)
!159 = !DILocation(line: 105, column: 24, scope: !142)
!160 = !DILocation(line: 106, column: 7, scope: !142)
!161 = !DILocation(line: 106, column: 20, scope: !142)
!162 = !DILocation(line: 107, column: 7, scope: !142)
!163 = !DILocation(line: 107, column: 32, scope: !142)
!164 = !DILocation(line: 107, column: 38, scope: !142)
!165 = !DILocation(line: 108, column: 10, scope: !142)
!166 = !DILocation(line: 108, column: 60, scope: !142)
!167 = !DILocation(line: 108, column: 23, scope: !142)
!168 = !DILocation(line: 103, column: 35, scope: !140)
!169 = !DILocation(line: 110, column: 9, scope: !114)
!170 = distinct !DISubprogram(name: "backtrace_load_element", linkageName: "std.os.darwin.backtrace_load_element.19122", scope: !2, file: !2, line: 113, type: !171, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !190)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !182, !137, !185, !185}
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !174, identifier: "std.os.backtrace.Backtrace")
!174 = !{!175, !177, !178, !179, !180, !181, !188}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !173, file: !2, line: 11, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !87)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !173, file: !2, line: 12, baseType: !137, size: 128, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !173, file: !2, line: 13, baseType: !137, size: 128, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !173, file: !2, line: 14, baseType: !137, size: 128, align: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !173, file: !2, line: 15, baseType: !76, size: 32, align: 32, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !173, file: !2, line: 16, baseType: !182, size: 128, align: 64, offset: 512)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !183, identifier: "Allocator")
!183 = !{!184, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !182, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, baseType: !187, size: 64, align: 64, offset: 64)
!187 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !173, file: !2, line: 17, baseType: !189, size: 8, align: 8, offset: 640)
!189 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!190 = !{!191, !196, !197, !198, !205, !207}
!191 = !DILocalVariable(name: "buf", scope: !192, file: !2, line: 117, type: !193, align: 1)
!192 = distinct !DILexicalBlock(scope: !170, file: !2, line: 116, column: 2)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 8192, align: 8, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1024, lowerBound: 0)
!196 = !DILocalVariable(name: "s", scope: !192, file: !2, line: 118, type: !137, align: 8)
!197 = !DILocalVariable(name: "mem", scope: !192, file: !2, line: 123, type: !182, align: 8)
!198 = !DILocalVariable(name: "parts", scope: !199, file: !2, line: 125, type: !200, align: 8)
!199 = distinct !DILexicalBlock(scope: !192, file: !2, line: 124, column: 9)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !201, identifier: "String[]")
!201 = !{!202, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !200, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !200, baseType: !99, size: 64, align: 64, offset: 64)
!205 = !DILocalVariable(name: "path_parts", scope: !206, file: !2, line: 128, type: !200, align: 8)
!206 = distinct !DILexicalBlock(scope: !199, file: !2, line: 127, column: 4)
!207 = !DILocalVariable(name: "info", scope: !170, file: !2, line: 140, type: !208, align: 8)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Darwin_Dl_info", scope: !2, file: !2, line: 47, size: 256, align: 64, elements: !209, identifier: "std.os.darwin.Darwin_Dl_info")
!209 = !{!210, !211, !212, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fname", scope: !208, file: !2, line: 49, baseType: !143, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fbase", scope: !208, file: !2, line: 50, baseType: !185, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dli_sname", scope: !208, file: !2, line: 51, baseType: !143, size: 64, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dli_saddr", scope: !208, file: !2, line: 52, baseType: !185, size: 64, align: 64, offset: 192)
!214 = !DILocalVariable(name: "allocator", arg: 1, scope: !170, file: !2, line: 113, type: !182)
!215 = !DILocation(line: 113, column: 48, scope: !170)
!216 = !DILocalVariable(name: "execpath", arg: 2, scope: !170, file: !2, line: 113, type: !137)
!217 = !DILocation(line: 113, column: 66, scope: !170)
!218 = !DILocalVariable(name: "buffer", arg: 3, scope: !170, file: !2, line: 113, type: !185)
!219 = !DILocation(line: 113, column: 82, scope: !170)
!220 = !DILocalVariable(name: "load_address", arg: 4, scope: !170, file: !2, line: 113, type: !185)
!221 = !DILocation(line: 113, column: 96, scope: !170)
!222 = !DILocation(line: 115, column: 6, scope: !170)
!223 = !DILocation(line: 117, column: 14, scope: !192)
!224 = !DILocation(line: 118, column: 10, scope: !192)
!225 = !DILocation(line: 118, column: 49, scope: !192)
!226 = !DILocation(line: 119, column: 6, scope: !192)
!227 = !DILocation(line: 119, column: 14, scope: !192)
!228 = !DILocation(line: 119, column: 20, scope: !192)
!229 = !DILocation(line: 119, column: 30, scope: !192)
!230 = !DILocation(line: 119, column: 39, scope: !192)
!231 = !DILocation(line: 119, column: 74, scope: !192)
!232 = !DILocation(line: 120, column: 43, scope: !192)
!233 = !DILocation(line: 120, column: 5, scope: !192)
!234 = !DILocation(line: 121, column: 52, scope: !192)
!235 = !DILocation(line: 121, column: 43, scope: !192)
!236 = !DILocation(line: 121, column: 5, scope: !192)
!237 = !DILocation(line: 122, column: 11, scope: !192)
!238 = !DILocation(line: 118, column: 14, scope: !192)
!239 = !DILocalVariable(name: "buffer", scope: !240, file: !2, line: 579, type: !256, align: 1)
!240 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !241, file: !241, line: 577, scopeLine: 577, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, retainedNodes: !242)
!241 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!242 = !{!239, !243}
!243 = !DILocalVariable(name: "allocator", scope: !240, file: !2, line: 580, type: !244, align: 8)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !245, identifier: "std.core.mem.allocator.OnStackAllocator")
!245 = !{!246, !247, !248, !249}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !244, file: !2, line: 14, baseType: !182, size: 128, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !2, line: 15, baseType: !94, size: 128, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !244, file: !2, line: 16, baseType: !99, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !244, file: !2, line: 17, baseType: !250, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !251, size: 64, align: 64, dwarfAddressSpace: 0)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !252, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.9581")
!252 = !{!253, !254, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !251, file: !2, line: 22, baseType: !189, size: 8, align: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !251, file: !2, line: 23, baseType: !250, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !2, line: 24, baseType: !185, size: 64, align: 64, offset: 128)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 4096, align: 8, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 512, lowerBound: 0)
!259 = !DILocation(line: 579, column: 14, scope: !240, inlinedAt: !260)
!260 = !DILocation(line: 123, column: 3, scope: !192)
!261 = !DILocation(line: 580, column: 19, scope: !240, inlinedAt: !260)
!262 = !DILocation(line: 581, column: 18, scope: !240, inlinedAt: !260)
!263 = !DILocation(line: 581, column: 26, scope: !240, inlinedAt: !260)
!264 = !DILocation(line: 581, column: 2, scope: !240, inlinedAt: !260)
!265 = !DILocation(line: 123, column: 29, scope: !192)
!266 = !DILocation(line: 583, column: 8, scope: !267, inlinedAt: !260)
!267 = distinct !DILexicalBlock(scope: !240, file: !241, line: 583, column: 2)
!268 = !DILocation(line: 125, column: 13, scope: !199)
!269 = !DILocation(line: 350, column: 102, scope: !270, inlinedAt: !272)
!270 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !271, file: !271, line: 350, scopeLine: 350, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83)
!271 = !DIFile(filename: "string.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!272 = !DILocation(line: 125, column: 21, scope: !199)
!273 = !DILocation(line: 126, column: 8, scope: !199)
!274 = !DILocation(line: 128, column: 14, scope: !206)
!275 = !DILocation(line: 128, column: 27, scope: !206)
!276 = !DILocation(line: 128, column: 33, scope: !206)
!277 = !DILocation(line: 350, column: 102, scope: !278, inlinedAt: !275)
!278 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !271, file: !271, line: 350, scopeLine: 350, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83)
!279 = !DILocation(line: 130, column: 16, scope: !206)
!280 = !DILocation(line: 131, column: 18, scope: !206)
!281 = !DILocation(line: 131, column: 32, scope: !206)
!282 = !DILocation(line: 132, column: 21, scope: !206)
!283 = !DILocation(line: 132, column: 27, scope: !206)
!284 = !DILocation(line: 132, column: 30, scope: !206)
!285 = !DILocation(line: 132, column: 33, scope: !206)
!286 = !DILocation(line: 133, column: 14, scope: !206)
!287 = !DILocation(line: 133, column: 25, scope: !206)
!288 = !DILocation(line: 133, column: 28, scope: !206)
!289 = !DILocation(line: 134, column: 14, scope: !206)
!290 = !DILocation(line: 134, column: 25, scope: !206)
!291 = !DILocation(line: 134, column: 28, scope: !206)
!292 = !DILocation(line: 134, column: 31, scope: !206)
!293 = !DILocation(line: 582, column: 8, scope: !294, inlinedAt: !260)
!294 = distinct !DILexicalBlock(scope: !240, file: !241, line: 582, column: 8)
!295 = !DILocation(line: 135, column: 19, scope: !206)
!296 = !DILocation(line: 582, column: 8, scope: !297, inlinedAt: !260)
!297 = distinct !DILexicalBlock(scope: !240, file: !241, line: 582, column: 8)
!298 = !DILocation(line: 582, column: 8, scope: !299, inlinedAt: !260)
!299 = distinct !DILexicalBlock(scope: !240, file: !241, line: 582, column: 8)
!300 = !DILocation(line: 140, column: 17, scope: !170)
!301 = !DILocation(line: 141, column: 6, scope: !170)
!302 = !DILocation(line: 141, column: 17, scope: !170)
!303 = !DILocation(line: 141, column: 56, scope: !170)
!304 = !DILocation(line: 143, column: 13, scope: !170)
!305 = !DILocation(line: 144, column: 15, scope: !170)
!306 = !DILocation(line: 144, column: 32, scope: !170)
!307 = !DILocation(line: 144, column: 52, scope: !170)
!308 = !DILocation(line: 144, column: 65, scope: !170)
!309 = !DILocation(line: 145, column: 38, scope: !170)
!310 = !DILocation(line: 145, column: 18, scope: !170)
!311 = !DILocation(line: 146, column: 11, scope: !170)
!312 = !DILocation(line: 147, column: 11, scope: !170)
!313 = !DILocation(line: 148, column: 16, scope: !170)
!314 = distinct !DISubprogram(name: "symbolize_backtrace", linkageName: "std.os.darwin.symbolize_backtrace", scope: !2, file: !2, line: 152, type: !315, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !330)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !182, !325}
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !318, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !317, file: !2, line: 20, baseType: !99, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !317, file: !2, line: 21, baseType: !99, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !317, file: !2, line: 22, baseType: !182, size: 128, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !317, file: !2, line: 23, baseType: !323, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !324, size: 64, align: 64, dwarfAddressSpace: 0)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 88, baseType: !173, align: 8)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !326, identifier: "void*[]")
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !325, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !185, size: 64, align: 64, dwarfAddressSpace: 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !325, baseType: !99, size: 64, align: 64, offset: 64)
!330 = !{!331, !332, !334, !335, !338, !340, !342}
!331 = !DILocalVariable(name: "load_addr", scope: !314, file: !2, line: 154, type: !185, align: 8)
!332 = !DILocalVariable(name: "list", scope: !314, file: !2, line: 155, type: !333, align: 8)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "BacktraceList", scope: !2, file: !2, line: 88, baseType: !317, align: 8)
!334 = !DILocalVariable(name: "execpath", scope: !314, file: !2, line: 165, type: !137, align: 8)
!335 = !DILocalVariable(name: ".temp", scope: !336, file: !2, line: 159, type: !99, align: 8)
!336 = distinct !DILexicalBlock(scope: !337, file: !2, line: 159, column: 3)
!337 = distinct !DILexicalBlock(scope: !314, file: !2, line: 158, column: 2)
!338 = !DILocalVariable(name: "trace", scope: !339, file: !2, line: 159, type: !324, align: 8)
!339 = distinct !DILexicalBlock(scope: !336, file: !2, line: 160, column: 3)
!340 = !DILocalVariable(name: ".temp", scope: !341, file: !2, line: 166, type: !99, align: 8)
!341 = distinct !DILexicalBlock(scope: !314, file: !2, line: 166, column: 2)
!342 = !DILocalVariable(name: "addr", scope: !343, file: !2, line: 166, type: !185, align: 8)
!343 = distinct !DILexicalBlock(scope: !341, file: !2, line: 167, column: 2)
!344 = !DILocalVariable(name: "allocator", arg: 1, scope: !314, file: !2, line: 152, type: !182)
!345 = !DILocation(line: 152, column: 49, scope: !314)
!346 = !DILocalVariable(name: "backtrace", arg: 2, scope: !314, file: !2, line: 152, type: !325)
!347 = !DILocation(line: 152, column: 68, scope: !314)
!348 = !DILocation(line: 154, column: 8, scope: !314)
!349 = !DILocation(line: 154, column: 28, scope: !314)
!350 = !DILocation(line: 155, column: 16, scope: !314)
!351 = !DILocation(line: 156, column: 23, scope: !314)
!352 = !DILocation(line: 156, column: 2, scope: !314)
!353 = !DILocation(line: 165, column: 9, scope: !314)
!354 = !DILocation(line: 165, column: 20, scope: !314)
!355 = !DILocation(line: 159, column: 20, scope: !336)
!356 = !DILocation(line: 159, column: 12, scope: !339)
!357 = !DILocation(line: 393, column: 26, scope: !358, inlinedAt: !356)
!358 = distinct !DILexicalBlock(scope: !360, file: !359, line: 394, column: 1)
!359 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/collections")
!360 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !359, file: !359, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83)
!361 = !DILocation(line: 391, column: 11, scope: !358, inlinedAt: !356)
!362 = !DILocation(line: 391, column: 19, scope: !358, inlinedAt: !356)
!363 = !DILocation(line: 159, column: 12, scope: !358, inlinedAt: !356)
!364 = !DILocation(line: 395, column: 9, scope: !360, inlinedAt: !356)
!365 = !DILocation(line: 395, column: 22, scope: !360, inlinedAt: !356)
!366 = !DILocation(line: 161, column: 4, scope: !367)
!367 = distinct !DILexicalBlock(scope: !339, file: !2, line: 160, column: 3)
!368 = !DILocation(line: 163, column: 3, scope: !337)
!369 = !DILocation(line: 166, column: 18, scope: !341)
!370 = !DILocation(line: 166, column: 11, scope: !343)
!371 = !DILocation(line: 166, column: 18, scope: !343)
!372 = !DILocation(line: 168, column: 13, scope: !373)
!373 = distinct !DILexicalBlock(scope: !343, file: !2, line: 167, column: 2)
!374 = !DILocation(line: 168, column: 77, scope: !373)
!375 = !DILocation(line: 168, column: 3, scope: !373)
!376 = !DILocation(line: 170, column: 9, scope: !314)
!377 = distinct !DISubprogram(name: "find_first_directory_temp", linkageName: "std.os.darwin.find_first_directory_temp", scope: !86, file: !86, line: 49, type: !378, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !380)
!378 = !DISubroutineType(types: !379)
!379 = !{!94, !85, !89}
!380 = !{!381, !387, !391}
