; ModuleID = 'std::core::mem::mempool'
source_filename = "std::core::mem::mempool"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.219 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any.221 = type { ptr, i64 }
%"char[].218" = type { ptr, i64 }
%"any[].222" = type { ptr, i64 }

@"$ct.std.core.mem.mempool.FixedBlockPoolNode" = linkonce global %.introspect.219 { i8 10, i64 0, ptr null, i64 24, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.mem.mempool.FixedBlockPoolEntry" = linkonce global %.introspect.219 { i8 10, i64 0, ptr null, i64 8, i64 0, i64 1, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.mem.mempool.FixedBlockPool" = linkonce global %.introspect.219 { i8 10, i64 0, ptr null, i64 120, i64 0, i64 12, [0 x i64] zeroinitializer }, align 8
@std.core.mem.mempool.INITIAL_CAPACITY = weak local_unnamed_addr constant i32 0, align 4, !dbg !0
@"$sel.release" = linkonce_odr constant [8 x i8] c"release\00", align 1
@.panic_msg = internal constant [45 x i8] c"No method 'release' could be found on target\00", align 1
@.file = internal constant [17 x i8] c"mem_allocator.c3\00", align 1
@.func = internal constant [5 x i8] c"free\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@"$sel.acquire" = linkonce_odr constant [8 x i8] c"acquire\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "INITIAL_CAPACITY", linkageName: "std.core.mem.mempool.INITIAL_CAPACITY", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "mem_mempool.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !{i32 2, !"Dwarf Version", i32 4}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 2, !"wchar_size", i32 4}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"uwtable", i32 1}
!9 = !{i32 2, !"frame-pointer", i32 1}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !11, splitDebugInlining: false)
!11 = !{!0}
!12 = distinct !DISubprogram(name: "free", linkageName: "std.core.mem.mempool.FixedBlockPool.free", scope: !2, file: !2, line: 117, type: !13, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !45)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedBlockPool*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedBlockPool", scope: !2, file: !2, line: 28, size: 960, align: 64, elements: !17, identifier: "std.core.mem.mempool.FixedBlockPool")
!17 = !{!18, !25, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 30, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !20, identifier: "Allocator")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !19, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !16, file: !2, line: 31, baseType: !26, size: 192, align: 64, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedBlockPoolNode", scope: !16, file: !2, line: 7, size: 192, align: 64, elements: !27, identifier: "std.core.mem.mempool.FixedBlockPoolNode")
!27 = !{!28, !29, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !26, file: !2, line: 9, baseType: !22, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !2, line: 10, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedBlockPoolNode*", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !26, file: !2, line: 11, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !33)
!33 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !16, file: !2, line: 32, baseType: !30, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !16, file: !2, line: 33, baseType: !22, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !16, file: !2, line: 34, baseType: !22, size: 64, align: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !16, file: !2, line: 35, baseType: !32, size: 64, align: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "grow_capacity", scope: !16, file: !2, line: 36, baseType: !32, size: 64, align: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !16, file: !2, line: 37, baseType: !32, size: 64, align: 64, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !16, file: !2, line: 38, baseType: !32, size: 64, align: 64, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !16, file: !2, line: 39, baseType: !32, size: 64, align: 64, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !16, file: !2, line: 40, baseType: !32, size: 64, align: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !16, file: !2, line: 41, baseType: !44, size: 8, align: 8, offset: 896)
!44 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!45 = !{!46, !47}
!46 = !DILocalVariable(name: "iter", scope: !12, file: !2, line: 123, type: !30, align: 8)
!47 = !DILocalVariable(name: "current", scope: !48, file: !2, line: 131, type: !30, align: 8)
!48 = distinct !DILexicalBlock(scope: !49, file: !2, line: 126, column: 2)
!49 = distinct !DILexicalBlock(scope: !12, file: !2, line: 125, column: 2)
!50 = !DILocalVariable(name: "self", arg: 1, scope: !12, file: !2, line: 117, type: !15)
!51 = !DILocation(line: 117, column: 29, scope: !12)
!52 = !DILocation(line: 115, column: 11, scope: !53)
!53 = distinct !DILexicalBlock(scope: !12, file: !2, line: 118, column: 1)
!54 = !DILocation(line: 122, column: 17, scope: !12)
!55 = !DILocation(line: 234, column: 37, scope: !56, inlinedAt: !58)
!56 = distinct !DILexicalBlock(scope: !57, file: !2, line: 235, column: 1)
!57 = distinct !DISubprogram(name: "free_page", linkageName: "free_page", scope: !2, file: !2, line: 234, scopeLine: 234, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!58 = !DILocation(line: 122, column: 2, scope: !12)
!59 = !DILocation(line: 236, column: 6, scope: !57, inlinedAt: !58)
!60 = !DILocation(line: 160, column: 6, scope: !61, inlinedAt: !63)
!61 = distinct !DISubprogram(name: "free_aligned", linkageName: "free_aligned", scope: !62, file: !62, line: 158, scopeLine: 158, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!62 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!63 = !DILocation(line: 238, column: 3, scope: !64, inlinedAt: !58)
!64 = distinct !DILexicalBlock(scope: !57, file: !2, line: 237, column: 2)
!65 = !DILocation(line: 160, column: 18, scope: !61, inlinedAt: !63)
!66 = !DILocation(line: 164, column: 34, scope: !61, inlinedAt: !63)
!67 = !DILocation(line: 164, column: 2, scope: !61, inlinedAt: !63)
!68 = !DILocation(line: 119, column: 6, scope: !69, inlinedAt: !70)
!69 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !62, file: !62, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!70 = !DILocation(line: 242, column: 3, scope: !71, inlinedAt: !58)
!71 = distinct !DILexicalBlock(scope: !57, file: !2, line: 241, column: 2)
!72 = !DILocation(line: 119, column: 18, scope: !69, inlinedAt: !70)
!73 = !DILocation(line: 123, column: 25, scope: !69, inlinedAt: !70)
!74 = !DILocation(line: 123, column: 2, scope: !69, inlinedAt: !70)
!75 = !DILocation(line: 123, column: 22, scope: !12)
!76 = !DILocation(line: 123, column: 29, scope: !12)
!77 = !DILocation(line: 125, column: 2, scope: !12)
!78 = !DILocation(line: 125, column: 9, scope: !49)
!79 = !DILocation(line: 130, column: 18, scope: !48)
!80 = !DILocation(line: 234, column: 37, scope: !81, inlinedAt: !83)
!81 = distinct !DILexicalBlock(scope: !82, file: !2, line: 235, column: 1)
!82 = distinct !DISubprogram(name: "free_page", linkageName: "free_page", scope: !2, file: !2, line: 234, scopeLine: 234, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!83 = !DILocation(line: 130, column: 3, scope: !48)
!84 = !DILocation(line: 236, column: 6, scope: !82, inlinedAt: !83)
!85 = !DILocation(line: 160, column: 6, scope: !86, inlinedAt: !87)
!86 = distinct !DISubprogram(name: "free_aligned", linkageName: "free_aligned", scope: !62, file: !62, line: 158, scopeLine: 158, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!87 = !DILocation(line: 238, column: 3, scope: !88, inlinedAt: !83)
!88 = distinct !DILexicalBlock(scope: !82, file: !2, line: 237, column: 2)
!89 = !DILocation(line: 160, column: 18, scope: !86, inlinedAt: !87)
!90 = !DILocation(line: 164, column: 34, scope: !86, inlinedAt: !87)
!91 = !DILocation(line: 164, column: 2, scope: !86, inlinedAt: !87)
