; ModuleID = 'std::os::env'
source_filename = "std::os::env"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%"char[].531" = type { ptr, i64 }
%any.534 = type { ptr, i64 }
%PathImp.535 = type { %"char[].531", i32, %any.534 }

@std.core.builtin.NOT_FOUND = linkonce constant %"char[].531" { ptr @std.core.builtin.NOT_FOUND.nameof, i64 18 }, align 8
@std.core.builtin.NOT_FOUND.nameof = internal constant [19 x i8] c"builtin::NOT_FOUND\00", align 1
@std.core.mem.allocator.current_temp = extern_weak thread_local global %any.534, align 8
@.str = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"Library/Application Support\00", align 1
@get_config_dir.DIR = internal unnamed_addr constant %"char[].531" { ptr @.str.2, i64 27 }, align 8, !dbg !0

; Function Attrs: nounwind uwtable(sync)
define weak i64 @std.os.env.get_var(ptr %0, [2 x i64] %1, [2 x i64] %2) #0 !dbg !37 {
entry:
  %allocator = alloca %any.534, align 8
  %name = alloca %"char[].531", align 8
  %state = alloca ptr, align 8
  %val = alloca ptr, align 8
  %reterr = alloca i64, align 8
  %result = alloca %"char[].531", align 8
  store [2 x i64] %1, ptr %allocator, align 8
    #dbg_declare(ptr %allocator, !44, !DIExpression(), !45)
  store [2 x i64] %2, ptr %name, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DIR", linkageName: "get_config_dir.DIR", scope: !2, file: !2, line: 91, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "env.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/os")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !4)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !5, identifier: "char[]")
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !4, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !4, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 2, !"wchar_size", i32 4}
!15 = !{i32 4, !"PIC Level", i32 2}
!16 = !{i32 1, !"uwtable", i32 1}
!17 = !{i32 2, !"frame-pointer", i32 1}
!18 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, globals: !36, splitDebugInlining: false)
!19 = !{!20}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !21, file: !2, line: 23, baseType: !32, size: 32, align: 32, elements: !33)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 16, size: 320, align: 64, elements: !22, identifier: "std.io.path.PathImp")
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !21, file: !2, line: 18, baseType: !3, size: 128, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !21, file: !2, line: 19, baseType: !20, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !21, file: !2, line: 20, baseType: !26, size: 128, align: 64, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !27, identifier: "Allocator")
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35}
!34 = !DIEnumerator(name: "WIN32", value: 0)
!35 = !DIEnumerator(name: "POSIX", value: 1)
!36 = !{!0}
!37 = distinct !DISubprogram(name: "get_var", linkageName: "std.os.env.get_var", scope: !2, file: !2, line: 12, type: !38, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !40)
!38 = !DISubroutineType(types: !39)
!39 = !{!4, !26, !3}
!40 = !{!41}
!41 = !DILocalVariable(name: "val", scope: !42, file: !2, line: 17, type: !43, align: 8)
!42 = distinct !DILexicalBlock(scope: !37, file: !2, line: 13, column: 1)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 11, baseType: !7, align: 8)
!44 = !DILocalVariable(name: "allocator", arg: 1, scope: !37, file: !2, line: 12, type: !26)
!45 = !DILocation(line: 12, column: 30, scope: !37)
!46 = !DILocalVariable(name: "name", arg: 2, scope: !37, file: !2, line: 12, type: !3)
!47 = !DILocation(line: 12, column: 48, scope: !37)
!48 = !DILocation(line: 9, column: 11, scope: !49)
!49 = distinct !DILexicalBlock(scope: !37, file: !2, line: 12, column: 57)
!50 = !DILocalVariable(name: "state", scope: !51, file: !2, line: 648, type: !54, align: 8)
!51 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !52, file: !52, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, retainedNodes: !53)
!52 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!53 = !{!50}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 420, baseType: !55, align: 8)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !57, identifier: "std.core.mem.allocator.TempAllocator")
!57 = !{!58, !59, !71, !72, !74, !75, !76, !77, !78, !79, !80}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !56, file: !2, line: 33, baseType: !26, size: 128, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !56, file: !2, line: 34, baseType: !60, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !62, identifier: "std.core.mem.allocator.TempAllocatorPage")
!62 = !{!63, !64, !65, !66, !67}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !61, file: !2, line: 56, baseType: !60, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !61, file: !2, line: 57, baseType: !29, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !61, file: !2, line: 58, baseType: !10, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !61, file: !2, line: 59, baseType: !10, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !61, file: !2, line: 60, baseType: !68, align: 8, offset: 256)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 0, lowerBound: 0)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !56, file: !2, line: 35, baseType: !55, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !56, file: !2, line: 36, baseType: !73, size: 8, align: 8, offset: 256)
!73 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !56, file: !2, line: 37, baseType: !10, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !56, file: !2, line: 38, baseType: !10, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !56, file: !2, line: 39, baseType: !10, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !56, file: !2, line: 40, baseType: !10, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !56, file: !2, line: 41, baseType: !10, size: 64, align: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !56, file: !2, line: 42, baseType: !10, size: 64, align: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !2, line: 43, baseType: !68, align: 8, offset: 704)
!81 = !DILocation(line: 648, column: 12, scope: !51, inlinedAt: !82)
!82 = !DILocation(line: 12, column: 57, scope: !37)
!83 = !DILocation(line: 648, column: 20, scope: !51, inlinedAt: !82)
!84 = !DILocation(line: 17, column: 11, scope: !42)
!85 = !DILocation(line: 17, column: 30, scope: !42)
!86 = !DILocation(line: 17, column: 17, scope: !42)
!87 = !DILocation(line: 18, column: 10, scope: !42)
!88 = !DILocation(line: 18, column: 25, scope: !42)
!89 = !DILocation(line: 18, column: 16, scope: !42)
!90 = !DILocation(line: 18, column: 38, scope: !42)
!91 = !DILocation(line: 651, column: 23, scope: !92, inlinedAt: !82)
!92 = distinct !DILexicalBlock(scope: !51, file: !52, line: 650, column: 2)
!93 = !DILocation(line: 651, column: 3, scope: !92, inlinedAt: !82)
!94 = !DILocation(line: 651, column: 23, scope: !95, inlinedAt: !82)
!95 = distinct !DILexicalBlock(scope: !51, file: !52, line: 650, column: 2)
!96 = !DILocation(line: 651, column: 3, scope: !95, inlinedAt: !82)
!97 = distinct !DISubprogram(name: "tget_var", linkageName: "std.os.env.tget_var", scope: !2, file: !2, line: 37, type: !98, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !100)
!98 = !DISubroutineType(types: !99)
!99 = !{!4, !3}
!100 = !{}
!101 = !DILocalVariable(name: "name", arg: 1, scope: !97, file: !2, line: 37, type: !3)
!102 = !DILocation(line: 37, column: 28, scope: !97)
!103 = !DILocation(line: 39, column: 17, scope: !97)
!104 = !DILocation(line: 39, column: 9, scope: !97)
!105 = distinct !DISubprogram(name: "set_var", linkageName: "std.os.env.set_var", scope: !2, file: !2, line: 47, type: !106, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !100)
!106 = !DISubroutineType(types: !107)
!107 = !{!73, !3, !3, !73}
!108 = !DILocalVariable(name: "name", arg: 1, scope: !105, file: !2, line: 47, type: !3)
!109 = !DILocation(line: 47, column: 24, scope: !105)
!110 = !DILocalVariable(name: "value", arg: 2, scope: !105, file: !2, line: 47, type: !3)
!111 = !DILocation(line: 47, column: 37, scope: !105)
!112 = !DILocalVariable(name: "overwrite", arg: 3, scope: !105, file: !2, line: 47, type: !73)
!113 = !DILocation(line: 47, column: 49, scope: !105)
!114 = !DILocation(line: 45, column: 11, scope: !115)
!115 = distinct !DILexicalBlock(scope: !105, file: !2, line: 47, column: 70)
!116 = !DILocalVariable(name: "state", scope: !117, file: !2, line: 648, type: !54, align: 8)
!117 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !52, file: !52, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, retainedNodes: !118)
!118 = !{!116}
!119 = !DILocation(line: 648, column: 12, scope: !117, inlinedAt: !120)
!120 = !DILocation(line: 47, column: 70, scope: !105)
!121 = !DILocation(line: 648, column: 20, scope: !117, inlinedAt: !120)
!122 = !DILocation(line: 60, column: 23, scope: !123)
!123 = distinct !DILexicalBlock(scope: !105, file: !2, line: 48, column: 1)
!124 = !DILocation(line: 60, column: 42, scope: !123)
!125 = !DILocation(line: 60, column: 62, scope: !123)
!126 = !DILocation(line: 60, column: 10, scope: !123)
!127 = !DILocation(line: 651, column: 23, scope: !128, inlinedAt: !120)
!128 = distinct !DILexicalBlock(scope: !117, file: !52, line: 650, column: 2)
!129 = !DILocation(line: 651, column: 3, scope: !128, inlinedAt: !120)
!130 = distinct !DISubprogram(name: "get_home_dir", linkageName: "std.os.env.get_home_dir", scope: !2, file: !2, line: 69, type: !131, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !18, retainedNodes: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!4, !26}
!133 = !{!134}
!134 = !DILocalVariable(name: "home", scope: !130, file: !2, line: 71, type: !3, align: 8)
