; ModuleID = 'std::os::backtrace'
source_filename = "std::os::backtrace"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.493 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Backtrace.495 = type { i64, %"char[].492", %"char[].492", %"char[].492", i32, %any.496, i8 }
%"char[].492" = type { ptr, i64 }
%any.496 = type { ptr, i64 }
%"any[].498" = type { ptr, i64 }
%"void*[].497" = type { ptr, i64 }

@"$ct.std.os.backtrace.Backtrace" = linkonce global %.introspect.493 { i8 10, i64 0, ptr null, i64 88, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@.emptystr = internal constant [1 x i8] zeroinitializer, align 1
@"$ct.void" = linkonce global %.introspect.493 { i8 0, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@std.os.backtrace.BACKTRACE_UNKNOWN = weak local_unnamed_addr constant %Backtrace.495 { i64 0, %"char[].492" { ptr @.emptystr, i64 0 }, %"char[].492" { ptr @.emptystr, i64 0 }, %"char[].492" { ptr @.emptystr, i64 0 }, i32 0, %any.496 { ptr null, i64 ptrtoint (ptr @"$ct.void" to i64) }, i8 0 }, align 8, !dbg !0
@.str = private unnamed_addr constant [10 x i8] c" [inline]\00", align 1
@.str.1 = private unnamed_addr constant [21 x i8] c"%s (in %s) (%s:%d)%s\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BACKTRACE_UNKNOWN", linkageName: "std.os.backtrace.BACKTRACE_UNKNOWN", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "backtrace.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/os")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !4, identifier: "std.os.backtrace.Backtrace")
!4 = !{!5, !8, !17, !18, !19, !21, !28}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3, file: !2, line: 11, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !7)
!7 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !3, file: !2, line: 12, baseType: !9, size: 128, align: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !11, identifier: "char[]")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !10, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !7)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !3, file: !2, line: 13, baseType: !9, size: 128, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !3, file: !2, line: 14, baseType: !9, size: 128, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !3, file: !2, line: 15, baseType: !20, size: 32, align: 32, offset: 448)
!20 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 16, baseType: !22, size: 128, align: 64, offset: 512)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !3, file: !2, line: 17, baseType: !29, size: 8, align: 8, offset: 640)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"wchar_size", i32 4}
!33 = !{i32 4, !"PIC Level", i32 2}
!34 = !{i32 1, !"uwtable", i32 1}
!35 = !{i32 2, !"frame-pointer", i32 1}
!36 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !37, splitDebugInlining: false)
!37 = !{!0}
!38 = distinct !DISubprogram(name: "has_file", linkageName: "std.os.backtrace.Backtrace.has_file", scope: !2, file: !2, line: 21, type: !39, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !42)
!39 = !DISubroutineType(types: !40)
!40 = !{!29, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !{}
!43 = !DILocalVariable(name: "self", arg: 1, scope: !38, file: !2, line: 21, type: !41)
!44 = !DILocation(line: 21, column: 28, scope: !38)
!45 = !DILocation(line: 23, column: 9, scope: !38)
!46 = distinct !DISubprogram(name: "is_unknown", linkageName: "std.os.backtrace.Backtrace.is_unknown", scope: !2, file: !2, line: 26, type: !39, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !42)
!47 = !DILocalVariable(name: "self", arg: 1, scope: !46, file: !2, line: 26, type: !41)
!48 = !DILocation(line: 26, column: 30, scope: !46)
!49 = !DILocation(line: 28, column: 10, scope: !46)
!50 = distinct !DISubprogram(name: "to_format", linkageName: "std.os.backtrace.Backtrace.to_format", scope: !2, file: !2, line: 31, type: !51, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !71)
!51 = !DISubroutineType(types: !52)
!52 = !{!7, !41, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !55, identifier: "std.io.Formatter")
!55 = !{!56, !57, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !2, line: 65, baseType: !25, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !54, file: !2, line: 66, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !59, align: 8)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !25, !14}
!62 = !DIDerivedType(tag: DW_TAG_member, scope: !54, file: !2, line: 67, baseType: !63, size: 192, align: 64, offset: 128)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !54, file: !2, line: 67, size: 192, align: 64, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !2, line: 69, baseType: !20, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !63, file: !2, line: 70, baseType: !20, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !63, file: !2, line: 71, baseType: !20, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !63, file: !2, line: 72, baseType: !69, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !70)
!70 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!71 = !{!72}
!72 = !DILocalVariable(name: "inline_suffix", scope: !50, file: !2, line: 33, type: !9, align: 8)
!73 = !DILocalVariable(name: "self", arg: 1, scope: !50, file: !2, line: 31, type: !41)
!74 = !DILocation(line: 31, column: 29, scope: !50)
!75 = !DILocalVariable(name: "formatter", arg: 2, scope: !50, file: !2, line: 31, type: !53)
!76 = !DILocation(line: 31, column: 47, scope: !50)
!77 = !DILocation(line: 33, column: 9, scope: !50)
!78 = !DILocation(line: 33, column: 25, scope: !50)
!79 = !DILocation(line: 33, column: 56, scope: !50)
!80 = !DILocation(line: 34, column: 6, scope: !50)
!81 = !DILocation(line: 36, column: 51, scope: !82)
!82 = distinct !DILexicalBlock(scope: !50, file: !2, line: 35, column: 2)
!83 = !DILocation(line: 36, column: 66, scope: !82)
!84 = !DILocation(line: 36, column: 84, scope: !82)
!85 = !DILocation(line: 36, column: 95, scope: !82)
!86 = !DILocation(line: 36, column: 106, scope: !82)
!87 = !DILocation(line: 36, column: 10, scope: !82)
!88 = !DILocation(line: 38, column: 6, scope: !50)
!89 = !DILocation(line: 40, column: 49, scope: !90)
!90 = distinct !DILexicalBlock(scope: !50, file: !2, line: 39, column: 2)
!91 = !DILocation(line: 40, column: 10, scope: !90)
!92 = !DILocation(line: 42, column: 63, scope: !50)
!93 = !DILocation(line: 42, column: 78, scope: !50)
!94 = !DILocation(line: 42, column: 96, scope: !50)
!95 = !DILocation(line: 42, column: 9, scope: !50)
!96 = distinct !DISubprogram(name: "free", linkageName: "std.os.backtrace.Backtrace.free", scope: !2, file: !2, line: 44, type: !97, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !42)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !41}
!99 = !DILocalVariable(name: "self", arg: 1, scope: !96, file: !2, line: 44, type: !41)
!100 = !DILocation(line: 44, column: 24, scope: !96)
!101 = !DILocation(line: 46, column: 7, scope: !96)
!102 = !DILocation(line: 46, column: 29, scope: !96)
!103 = !DILocation(line: 47, column: 18, scope: !96)
!104 = !DILocation(line: 47, column: 34, scope: !96)
!105 = !DILocation(line: 119, column: 6, scope: !106, inlinedAt: !108)
!106 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !107, file: !107, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!107 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!108 = !DILocation(line: 47, column: 2, scope: !96)
!109 = !DILocation(line: 119, column: 18, scope: !106, inlinedAt: !108)
!110 = !DILocation(line: 123, column: 25, scope: !106, inlinedAt: !108)
!111 = !DILocation(line: 123, column: 2, scope: !106, inlinedAt: !108)
!112 = !DILocation(line: 48, column: 18, scope: !96)
!113 = !DILocation(line: 48, column: 34, scope: !96)
!114 = !DILocation(line: 119, column: 6, scope: !115, inlinedAt: !116)
!115 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !107, file: !107, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!116 = !DILocation(line: 48, column: 2, scope: !96)
!117 = !DILocation(line: 119, column: 18, scope: !115, inlinedAt: !116)
!118 = !DILocation(line: 123, column: 25, scope: !115, inlinedAt: !116)
!119 = !DILocation(line: 123, column: 2, scope: !115, inlinedAt: !116)
!120 = !DILocation(line: 49, column: 18, scope: !96)
!121 = !DILocation(line: 49, column: 34, scope: !96)
!122 = !DILocation(line: 119, column: 6, scope: !123, inlinedAt: !124)
!123 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !107, file: !107, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!124 = !DILocation(line: 49, column: 2, scope: !96)
!125 = !DILocation(line: 119, column: 18, scope: !123, inlinedAt: !124)
!126 = !DILocation(line: 123, column: 25, scope: !123, inlinedAt: !124)
!127 = !DILocation(line: 123, column: 2, scope: !123, inlinedAt: !124)
!128 = distinct !DISubprogram(name: "init", linkageName: "std.os.backtrace.Backtrace.init", scope: !2, file: !2, line: 52, type: !129, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !42)
!129 = !DISubroutineType(types: !130)
!130 = !{!41, !41, !22, !7, !9, !9, !9, !20}
!131 = !DILocalVariable(name: "self", arg: 1, scope: !128, file: !2, line: 52, type: !41)
!132 = !DILocation(line: 52, column: 30, scope: !128)
!133 = !DILocalVariable(name: "allocator", arg: 2, scope: !128, file: !2, line: 52, type: !22)
!134 = !DILocation(line: 52, column: 47, scope: !128)
!135 = !DILocalVariable(name: "offset", arg: 3, scope: !128, file: !2, line: 52, type: !6)
!136 = !DILocation(line: 52, column: 63, scope: !128)
!137 = !DILocalVariable(name: "function", arg: 4, scope: !128, file: !2, line: 52, type: !9)
!138 = !DILocation(line: 52, column: 78, scope: !128)
!139 = !DILocalVariable(name: "object_file", arg: 5, scope: !128, file: !2, line: 52, type: !9)
!140 = !DILocation(line: 52, column: 95, scope: !128)
!141 = !DILocalVariable(name: "file", arg: 6, scope: !128, file: !2, line: 52, type: !9)
!142 = !DILocation(line: 52, column: 115, scope: !128)
!143 = !DILocalVariable(name: "line", arg: 7, scope: !128, file: !2, line: 52, type: !20)
!144 = !DILocation(line: 52, column: 131, scope: !128)
!145 = !DILocation(line: 54, column: 6, scope: !128)
!146 = !DILocation(line: 56, column: 3, scope: !147)
!147 = distinct !DILexicalBlock(scope: !128, file: !2, line: 55, column: 2)
!148 = !DILocation(line: 57, column: 3, scope: !147)
!149 = !DILocation(line: 58, column: 3, scope: !147)
!150 = !DILocation(line: 59, column: 3, scope: !147)
!151 = !DILocation(line: 60, column: 3, scope: !147)
!152 = !DILocation(line: 61, column: 3, scope: !147)
!153 = !DILocation(line: 62, column: 10, scope: !147)
!154 = !DILocation(line: 64, column: 2, scope: !128)
!155 = !DILocation(line: 65, column: 32, scope: !128)
!156 = !DILocation(line: 65, column: 18, scope: !128)
!157 = !DILocation(line: 65, column: 2, scope: !128)
!158 = !DILocation(line: 66, column: 38, scope: !128)
!159 = !DILocation(line: 66, column: 21, scope: !128)
!160 = !DILocation(line: 66, column: 2, scope: !128)
!161 = !DILocation(line: 67, column: 24, scope: !128)
!162 = !DILocation(line: 67, column: 14, scope: !128)
!163 = !DILocation(line: 67, column: 2, scope: !128)
!164 = !DILocation(line: 68, column: 2, scope: !128)
!165 = !DILocation(line: 69, column: 2, scope: !128)
!166 = !DILocation(line: 70, column: 9, scope: !128)
!167 = distinct !DISubprogram(name: "capture_current", linkageName: "std.os.backtrace.capture_current", scope: !2, file: !2, line: 73, type: !168, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !36, retainedNodes: !175)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !170}
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !171, identifier: "void*[]")
!171 = !{!172, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !170, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !170, baseType: !16, size: 64, align: 64, offset: 64)
!175 = !{!176}
!176 = !DILocalVariable(name: "len", scope: !167, file: !2, line: 78, type: !177, align: 4)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 23, baseType: !178, align: 4)
!178 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!179 = !DILocalVariable(name: "buffer", arg: 1, scope: !167, file: !2, line: 73, type: !170)
!180 = !DILocation(line: 73, column: 36, scope: !167)
!181 = !DILocation(line: 75, column: 6, scope: !167)
!182 = !DILocation(line: 75, column: 26, scope: !167)
!183 = !DILocation(line: 78, column: 9, scope: !167)
!184 = !DILocation(line: 78, column: 44, scope: !167)
!185 = !DILocation(line: 78, column: 15, scope: !167)
!186 = !DILocation(line: 79, column: 11, scope: !167)
!187 = !DILocation(line: 79, column: 19, scope: !167)
