; ModuleID = 'std::io::os'
source_filename = "std::io::os"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.340 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].339" = type { ptr, i64 }
%Stat = type { i32, i16, i16, i64, i32, i32, i32, %TimeSpec.342, %TimeSpec.342, %TimeSpec.342, %TimeSpec.342, i64, i64, i32, i32, i32, i32, [2 x i64] }
%TimeSpec.342 = type { i64, i64 }
%PathImp.343 = type { %"char[].339", i32, %any.344 }
%any.344 = type { ptr, i64 }
%List.345 = type { i64, i64, %any.344, ptr }
%"any[].346" = type { ptr, i64 }

@.enum.DESKTOP = internal constant [8 x i8] c"DESKTOP\00", align 1
@.enum.DOCUMENTS = internal constant [10 x i8] c"DOCUMENTS\00", align 1
@.enum.VIDEOS = internal constant [7 x i8] c"VIDEOS\00", align 1
@.enum.MUSIC = internal constant [6 x i8] c"MUSIC\00", align 1
@.enum.DOWNLOADS = internal constant [10 x i8] c"DOWNLOADS\00", align 1
@.enum.PICTURES = internal constant [9 x i8] c"PICTURES\00", align 1
@.enum.TEMPLATES = internal constant [10 x i8] c"TEMPLATES\00", align 1
@.enum.PUBLIC_SHARE = internal constant [13 x i8] c"PUBLIC_SHARE\00", align 1
@.enum.SAVED_GAMES = internal constant [12 x i8] c"SAVED_GAMES\00", align 1
@.enum.SCREENSHOTS = internal constant [12 x i8] c"SCREENSHOTS\00", align 1
@"$ct.int" = linkonce global %.introspect.340 { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "fileinfo.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io/os")
!8 = !{!9, !35, !41}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !11, file: !10, line: 23, baseType: !31, size: 32, align: 32, elements: !32)
!10 = !DIFile(filename: "rmtree.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io/os")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !10, file: !10, line: 16, size: 320, align: 64, elements: !12, identifier: "std.io.path.PathImp")
!12 = !{!13, !23, !24}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !11, file: !10, line: 18, baseType: !14, size: 128, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !16, identifier: "char[]")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !11, file: !10, line: 19, baseType: !9, size: 32, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !11, file: !10, line: 20, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !26, identifier: "Allocator")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !{!33, !34}
!33 = !DIEnumerator(name: "WIN32", value: 0)
!34 = !DIEnumerator(name: "POSIX", value: 1)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !36, file: !36, line: 7, baseType: !31, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "file_libc.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io/os")
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "SET", value: 0)
!39 = !DIEnumerator(name: "CURSOR", value: 1)
!40 = !DIEnumerator(name: "END", value: 2)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NativeSystemDir", scope: !42, file: !42, line: 3, baseType: !31, size: 32, align: 32, elements: !43)
!42 = !DIFile(filename: "temp_directory.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io/os")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!44 = !DIEnumerator(name: "DESKTOP", value: 0)
!45 = !DIEnumerator(name: "DOCUMENTS", value: 1)
!46 = !DIEnumerator(name: "VIDEOS", value: 2)
!47 = !DIEnumerator(name: "MUSIC", value: 3)
!48 = !DIEnumerator(name: "DOWNLOADS", value: 4)
!49 = !DIEnumerator(name: "PICTURES", value: 5)
!50 = !DIEnumerator(name: "TEMPLATES", value: 6)
!51 = !DIEnumerator(name: "PUBLIC_SHARE", value: 7)
!52 = !DIEnumerator(name: "SAVED_GAMES", value: 8)
!53 = !DIEnumerator(name: "SCREENSHOTS", value: 9)
!54 = distinct !DISubprogram(name: "native_file_or_dir_exists", linkageName: "std.io.os.native_file_or_dir_exists", scope: !7, file: !7, line: 64, type: !55, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !58)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !14}
!57 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!58 = !{!59}
!59 = !DILocalVariable(name: "stat", scope: !54, file: !7, line: 73, type: !60, align: 8)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stat", scope: !7, file: !7, line: 10, size: 1152, align: 64, elements: !61, identifier: "libc.Stat")
!61 = !{!62, !64, !67, !69, !71, !74, !76, !77, !85, !86, !87, !88, !90, !92, !94, !95, !96, !97}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !60, file: !7, line: 12, baseType: !63, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dev_t", scope: !7, file: !7, line: 3, baseType: !31, align: 4)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !60, file: !7, line: 13, baseType: !65, size: 16, align: 16, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mode_t", scope: !7, file: !7, line: 4, baseType: !66, align: 2)
!66 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !60, file: !7, line: 14, baseType: !68, size: 16, align: 16, offset: 48)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nlink_t", scope: !7, file: !7, line: 5, baseType: !66, align: 2)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !60, file: !7, line: 15, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ino_t", scope: !7, file: !7, line: 8, baseType: !22, align: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !60, file: !7, line: 16, baseType: !72, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uid_t", scope: !7, file: !7, line: 22, baseType: !73, align: 4)
!73 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !60, file: !7, line: 17, baseType: !75, size: 32, align: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gid_t", scope: !7, file: !7, line: 23, baseType: !73, align: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !60, file: !7, line: 18, baseType: !63, size: 32, align: 32, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !60, file: !7, line: 21, baseType: !78, size: 128, align: 64, offset: 256)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "TimeSpec", scope: !60, file: !7, line: 435, size: 128, align: 64, elements: !79, identifier: "libc.TimeSpec")
!79 = !{!80, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !78, file: !7, line: 437, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !7, file: !7, line: 82, baseType: !82, align: 8)
!82 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !78, file: !7, line: 439, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLong", scope: !7, file: !7, line: 25, baseType: !82, align: 8)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !60, file: !7, line: 23, baseType: !78, size: 128, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !60, file: !7, line: 25, baseType: !78, size: 128, align: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !60, file: !7, line: 27, baseType: !78, size: 128, align: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !60, file: !7, line: 29, baseType: !89, size: 64, align: 64, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Off_t", scope: !7, file: !7, line: 83, baseType: !22, align: 8)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !60, file: !7, line: 31, baseType: !91, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blkcnt_t", scope: !7, file: !7, line: 6, baseType: !82, align: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocksize", scope: !60, file: !7, line: 33, baseType: !93, size: 32, align: 32, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blksize_t", scope: !7, file: !7, line: 7, baseType: !31, align: 4)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !60, file: !7, line: 35, baseType: !73, size: 32, align: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !60, file: !7, line: 37, baseType: !73, size: 32, align: 32, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !60, file: !7, line: 39, baseType: !31, size: 32, align: 32, offset: 992)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !60, file: !7, line: 41, baseType: !98, size: 128, align: 64, offset: 1024)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, align: 64, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 2, lowerBound: 0)
!101 = !DILocalVariable(name: "path", arg: 1, scope: !54, file: !7, line: 64, type: !14)
!102 = !DILocation(line: 64, column: 42, scope: !54)
!103 = !DILocation(line: 73, column: 9, scope: !54)
!104 = !DILocation(line: 74, column: 34, scope: !105, inlinedAt: !107)
!105 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !106, file: !106, line: 471, scopeLine: 471, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!106 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!107 = !DILocation(line: 74, column: 11, scope: !54)
!108 = !DILocation(line: 473, column: 12, scope: !105, inlinedAt: !107)
!109 = !DILocation(line: 473, column: 26, scope: !105, inlinedAt: !107)
!110 = !DILocation(line: 474, column: 9, scope: !105, inlinedAt: !107)
!111 = distinct !DISubprogram(name: "native_is_file", linkageName: "std.io.os.native_is_file", scope: !7, file: !7, line: 90, type: !55, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !112)
!112 = !{!113}
!113 = !DILocalVariable(name: "stat", scope: !111, file: !7, line: 99, type: !60, align: 8)
!114 = !DILocalVariable(name: "path", arg: 1, scope: !111, file: !7, line: 90, type: !14)
!115 = !DILocation(line: 90, column: 31, scope: !111)
!116 = !DILocation(line: 99, column: 9, scope: !111)
!117 = !DILocation(line: 100, column: 34, scope: !118, inlinedAt: !119)
!118 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !106, file: !106, line: 471, scopeLine: 471, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!119 = !DILocation(line: 100, column: 11, scope: !111)
!120 = !DILocation(line: 473, column: 12, scope: !118, inlinedAt: !119)
!121 = !DILocation(line: 473, column: 26, scope: !118, inlinedAt: !119)
!122 = !DILocation(line: 474, column: 9, scope: !118, inlinedAt: !119)
!123 = !DILocation(line: 100, column: 58, scope: !111)
!124 = !DILocation(line: 386, column: 52, scope: !125, inlinedAt: !127)
!125 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !126, file: !126, line: 386, scopeLine: 386, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!126 = !DIFile(filename: "libc.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/libc")
!127 = !DILocation(line: 100, column: 44, scope: !111)
!128 = !DILocation(line: 386, column: 51, scope: !125, inlinedAt: !127)
!129 = distinct !DISubprogram(name: "native_is_dir", linkageName: "std.io.os.native_is_dir", scope: !7, file: !7, line: 108, type: !55, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !130)
!130 = !{!131}
!131 = !DILocalVariable(name: "stat", scope: !129, file: !7, line: 111, type: !60, align: 8)
!132 = !DILocalVariable(name: "path", arg: 1, scope: !129, file: !7, line: 108, type: !14)
!133 = !DILocation(line: 108, column: 30, scope: !129)
!134 = !DILocation(line: 111, column: 8, scope: !129)
!135 = !DILocation(line: 112, column: 33, scope: !136, inlinedAt: !137)
!136 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !106, file: !106, line: 471, scopeLine: 471, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!137 = !DILocation(line: 112, column: 10, scope: !129)
!138 = !DILocation(line: 473, column: 12, scope: !136, inlinedAt: !137)
!139 = !DILocation(line: 473, column: 26, scope: !136, inlinedAt: !137)
!140 = !DILocation(line: 474, column: 9, scope: !136, inlinedAt: !137)
!141 = !DILocation(line: 112, column: 57, scope: !129)
!142 = !DILocation(line: 386, column: 52, scope: !143, inlinedAt: !144)
!143 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !126, file: !126, line: 386, scopeLine: 386, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!144 = !DILocation(line: 112, column: 43, scope: !129)
!145 = !DILocation(line: 386, column: 51, scope: !143, inlinedAt: !144)
!146 = distinct !DISubprogram(name: "native_stat", linkageName: "std.io.os.native_stat", scope: !7, file: !7, line: 4, type: !147, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !150)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149, !14}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Stat*", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !{!151}
!151 = !DILocalVariable(name: "res", scope: !152, file: !7, line: 7, type: !31, align: 4)
!152 = distinct !DILexicalBlock(scope: !146, file: !7, line: 5, column: 1)
!153 = !DILocalVariable(name: "stat", arg: 1, scope: !146, file: !7, line: 4, type: !149)
!154 = !DILocation(line: 4, column: 28, scope: !146)
!155 = !DILocalVariable(name: "path", arg: 2, scope: !146, file: !7, line: 4, type: !14)
!156 = !DILocation(line: 4, column: 41, scope: !146)
!157 = !DILocalVariable(name: "state", scope: !158, file: !7, line: 648, type: !161, align: 8)
!158 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !159, file: !159, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !160)
!159 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!160 = !{!157}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 420, baseType: !162, align: 8)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !163, size: 64, align: 64, dwarfAddressSpace: 0)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !164, identifier: "std.core.mem.allocator.TempAllocator")
!164 = !{!165, !166, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !163, file: !7, line: 33, baseType: !25, size: 128, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !163, file: !7, line: 34, baseType: !167, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !168, size: 64, align: 64, dwarfAddressSpace: 0)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !169, identifier: "std.core.mem.allocator.TempAllocatorPage")
!169 = !{!170, !171, !172, !173, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !168, file: !7, line: 56, baseType: !167, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !168, file: !7, line: 57, baseType: !28, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !7, line: 58, baseType: !21, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !168, file: !7, line: 59, baseType: !21, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !7, line: 60, baseType: !175, align: 8, offset: 256)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, align: 8, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 0, lowerBound: 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !163, file: !7, line: 35, baseType: !162, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !163, file: !7, line: 36, baseType: !57, size: 8, align: 8, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !163, file: !7, line: 37, baseType: !21, size: 64, align: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !163, file: !7, line: 38, baseType: !21, size: 64, align: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !163, file: !7, line: 39, baseType: !21, size: 64, align: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !163, file: !7, line: 40, baseType: !21, size: 64, align: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !163, file: !7, line: 41, baseType: !21, size: 64, align: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !163, file: !7, line: 42, baseType: !21, size: 64, align: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !7, line: 43, baseType: !175, align: 8, offset: 704)
!187 = !DILocation(line: 648, column: 12, scope: !158, inlinedAt: !188)
!188 = !DILocation(line: 4, column: 116, scope: !146)
!189 = !DILocation(line: 648, column: 20, scope: !158, inlinedAt: !188)
!190 = !DILocation(line: 7, column: 7, scope: !152)
!191 = !DILocation(line: 7, column: 24, scope: !152)
!192 = !DILocation(line: 7, column: 13, scope: !152)
!193 = !DILocation(line: 12, column: 6, scope: !152)
!194 = !DILocation(line: 14, column: 11, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !7, line: 14, column: 3)
!196 = distinct !DILexicalBlock(scope: !152, file: !7, line: 13, column: 2)
!197 = !DILocation(line: 651, column: 23, scope: !198, inlinedAt: !188)
!198 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!199 = !DILocation(line: 651, column: 3, scope: !198, inlinedAt: !188)
!200 = !DILocation(line: 246, column: 2, scope: !201, inlinedAt: !202)
!201 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !106, file: !106, line: 241, scopeLine: 241, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!202 = !DILocation(line: 19, column: 5, scope: !203)
!203 = distinct !DILexicalBlock(scope: !195, file: !7, line: 19, column: 5)
!204 = !DILocation(line: 651, column: 23, scope: !205, inlinedAt: !188)
!205 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!206 = !DILocation(line: 651, column: 3, scope: !205, inlinedAt: !188)
!207 = !DILocation(line: 651, column: 23, scope: !208, inlinedAt: !188)
!208 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!209 = !DILocation(line: 651, column: 3, scope: !208, inlinedAt: !188)
!210 = !DILocation(line: 651, column: 23, scope: !211, inlinedAt: !188)
!211 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!212 = !DILocation(line: 651, column: 3, scope: !211, inlinedAt: !188)
!213 = !DILocation(line: 651, column: 23, scope: !214, inlinedAt: !188)
!214 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!215 = !DILocation(line: 651, column: 3, scope: !214, inlinedAt: !188)
!216 = !DILocation(line: 651, column: 23, scope: !217, inlinedAt: !188)
!217 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!218 = !DILocation(line: 651, column: 3, scope: !217, inlinedAt: !188)
!219 = !DILocation(line: 651, column: 23, scope: !220, inlinedAt: !188)
!220 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!221 = !DILocation(line: 651, column: 3, scope: !220, inlinedAt: !188)
!222 = !DILocation(line: 651, column: 23, scope: !223, inlinedAt: !188)
!223 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!224 = !DILocation(line: 651, column: 3, scope: !223, inlinedAt: !188)
!225 = !DILocation(line: 651, column: 23, scope: !226, inlinedAt: !188)
!226 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!227 = !DILocation(line: 651, column: 3, scope: !226, inlinedAt: !188)
!228 = !DILocation(line: 651, column: 23, scope: !229, inlinedAt: !188)
!229 = distinct !DILexicalBlock(scope: !158, file: !159, line: 650, column: 2)
!230 = !DILocation(line: 651, column: 3, scope: !229, inlinedAt: !188)
!231 = distinct !DISubprogram(name: "native_file_size", linkageName: "std.io.os.native_file_size", scope: !7, file: !7, line: 57, type: !232, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !234)
!232 = !DISubroutineType(types: !233)
!233 = !{!22, !14}
!234 = !{!235}
!235 = !DILocalVariable(name: "stat", scope: !231, file: !7, line: 59, type: !60, align: 8)
!236 = !DILocalVariable(name: "path", arg: 1, scope: !231, file: !7, line: 57, type: !14)
!237 = !DILocation(line: 57, column: 33, scope: !231)
!238 = !DILocation(line: 59, column: 7, scope: !231)
!239 = !DILocation(line: 60, column: 21, scope: !231)
!240 = !DILocation(line: 60, column: 2, scope: !231)
!241 = !DILocation(line: 61, column: 9, scope: !231)
!242 = distinct !DISubprogram(name: "native_rmtree", linkageName: "std.io.os.native_rmtree", scope: !10, file: !10, line: 7, type: !243, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !245)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !11}
!245 = !{!246, !249, !262, !266}
!246 = !DILocalVariable(name: "directory", scope: !247, file: !10, line: 11, type: !248, align: 8)
!247 = distinct !DILexicalBlock(scope: !242, file: !10, line: 10, column: 2)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIRPtr", scope: !10, file: !10, line: 5, baseType: !28, align: 8)
!249 = !DILocalVariable(name: "entry", scope: !247, file: !10, line: 14, type: !250, align: 8)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Posix_dirent*", baseType: !251, size: 64, align: 64, dwarfAddressSpace: 0)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_dirent", scope: !10, file: !10, line: 7, size: 8384, align: 64, elements: !252, identifier: "std.os.posix.Posix_dirent")
!252 = !{!253, !254, !255, !256, !257, !258}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "d_fileno", scope: !251, file: !10, line: 9, baseType: !70, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !251, file: !10, line: 10, baseType: !89, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !251, file: !10, line: 11, baseType: !66, size: 16, align: 16, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "d_namelen", scope: !251, file: !10, line: 12, baseType: !66, size: 16, align: 16, offset: 144)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !251, file: !10, line: 13, baseType: !19, size: 8, align: 8, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !10, line: 24, baseType: !259, size: 8192, align: 8, offset: 168)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8192, align: 8, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 1024, lowerBound: 0)
!262 = !DILocalVariable(name: "name", scope: !263, file: !10, line: 19, type: !14, align: 8)
!263 = distinct !DILexicalBlock(scope: !264, file: !10, line: 18, column: 4)
!264 = distinct !DILexicalBlock(scope: !265, file: !10, line: 16, column: 3)
!265 = distinct !DILexicalBlock(scope: !247, file: !10, line: 15, column: 3)
!266 = !DILocalVariable(name: "new_path", scope: !263, file: !10, line: 21, type: !267, align: 8)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !10, file: !10, line: 14, baseType: !11, align: 8)
!268 = !DILocalVariable(name: "dir", arg: 1, scope: !242, file: !10, line: 7, type: !267)
!269 = !DILocation(line: 7, column: 29, scope: !242)
!270 = !DILocalVariable(name: "state", scope: !271, file: !10, line: 648, type: !161, align: 8)
!271 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !159, file: !159, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !272)
!272 = !{!270}
!273 = !DILocation(line: 648, column: 12, scope: !271, inlinedAt: !274)
!274 = !DILocation(line: 9, column: 2, scope: !242)
!275 = !DILocation(line: 648, column: 20, scope: !271, inlinedAt: !274)
!276 = !DILocation(line: 11, column: 10, scope: !247)
!277 = !DILocation(line: 11, column: 37, scope: !247)
!278 = !DILocation(line: 11, column: 22, scope: !247)
!279 = !DILocation(line: 13, column: 7, scope: !247)
!280 = !DILocation(line: 13, column: 26, scope: !247)
!281 = !DILocation(line: 13, column: 46, scope: !247)
!282 = !DILocation(line: 13, column: 69, scope: !247)
!283 = !DILocation(line: 12, column: 13, scope: !284)
!284 = distinct !DILexicalBlock(scope: !247, file: !10, line: 12, column: 9)
!285 = !DILocation(line: 12, column: 40, scope: !284)
!286 = !DILocation(line: 12, column: 24, scope: !284)
!287 = !DILocation(line: 651, column: 23, scope: !288, inlinedAt: !274)
!288 = distinct !DILexicalBlock(scope: !271, file: !159, line: 650, column: 2)
!289 = !DILocation(line: 651, column: 3, scope: !288, inlinedAt: !274)
!290 = !DILocation(line: 12, column: 13, scope: !291)
!291 = distinct !DILexicalBlock(scope: !247, file: !10, line: 12, column: 9)
!292 = !DILocation(line: 12, column: 40, scope: !291)
!293 = !DILocation(line: 12, column: 24, scope: !291)
!294 = !DILocation(line: 651, column: 23, scope: !295, inlinedAt: !274)
!295 = distinct !DILexicalBlock(scope: !271, file: !159, line: 650, column: 2)
!296 = !DILocation(line: 651, column: 3, scope: !295, inlinedAt: !274)
!297 = !DILocation(line: 14, column: 17, scope: !247)
!298 = !DILocation(line: 15, column: 3, scope: !247)
!299 = !DILocation(line: 15, column: 34, scope: !265)
!300 = !DILocation(line: 15, column: 19, scope: !265)
!301 = !DILocalVariable(name: "state", scope: !302, file: !10, line: 648, type: !161, align: 8)
!302 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !159, file: !159, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !303)
!303 = !{!301}
!304 = !DILocation(line: 648, column: 12, scope: !302, inlinedAt: !305)
!305 = !DILocation(line: 17, column: 4, scope: !264)
!306 = !DILocation(line: 648, column: 20, scope: !302, inlinedAt: !305)
!307 = !DILocation(line: 19, column: 12, scope: !263)
!308 = !DILocation(line: 19, column: 30, scope: !263)
!309 = !DILocation(line: 19, column: 19, scope: !263)
!310 = !DILocation(line: 20, column: 10, scope: !263)
!311 = !DILocation(line: 20, column: 18, scope: !263)
!312 = !DILocation(line: 20, column: 33, scope: !263)
!313 = !DILocation(line: 651, column: 23, scope: !314, inlinedAt: !305)
!314 = distinct !DILexicalBlock(scope: !302, file: !159, line: 650, column: 2)
!315 = !DILocation(line: 651, column: 3, scope: !314, inlinedAt: !305)
!316 = !DILocation(line: 21, column: 10, scope: !263)
!317 = !DILocation(line: 21, column: 21, scope: !263)
!318 = !DILocation(line: 651, column: 23, scope: !319, inlinedAt: !305)
!319 = distinct !DILexicalBlock(scope: !302, file: !159, line: 650, column: 2)
!320 = !DILocation(line: 651, column: 3, scope: !319, inlinedAt: !305)
!321 = !DILocation(line: 12, column: 13, scope: !322)
!322 = distinct !DILexicalBlock(scope: !247, file: !10, line: 12, column: 9)
!323 = !DILocation(line: 12, column: 40, scope: !322)
!324 = !DILocation(line: 12, column: 24, scope: !322)
!325 = !DILocation(line: 651, column: 23, scope: !326, inlinedAt: !274)
!326 = distinct !DILexicalBlock(scope: !271, file: !159, line: 650, column: 2)
!327 = !DILocation(line: 651, column: 3, scope: !326, inlinedAt: !274)
!328 = !DILocation(line: 22, column: 9, scope: !263)
!329 = !DILocation(line: 24, column: 6, scope: !330)
!330 = distinct !DILexicalBlock(scope: !263, file: !10, line: 23, column: 5)
!331 = !DILocation(line: 651, column: 23, scope: !332, inlinedAt: !305)
!332 = distinct !DILexicalBlock(scope: !302, file: !159, line: 650, column: 2)
!333 = !DILocation(line: 651, column: 3, scope: !332, inlinedAt: !305)
!334 = !DILocation(line: 12, column: 13, scope: !335)
!335 = distinct !DILexicalBlock(scope: !247, file: !10, line: 12, column: 9)
!336 = !DILocation(line: 12, column: 40, scope: !335)
!337 = !DILocation(line: 12, column: 24, scope: !335)
!338 = !DILocation(line: 651, column: 23, scope: !339, inlinedAt: !274)
!339 = distinct !DILexicalBlock(scope: !271, file: !159, line: 650, column: 2)
!340 = !DILocation(line: 651, column: 3, scope: !339, inlinedAt: !274)
!341 = !DILocation(line: 651, column: 23, scope: !342, inlinedAt: !305)
!342 = distinct !DILexicalBlock(scope: !302, file: !159, line: 650, column: 2)
!343 = !DILocation(line: 651, column: 3, scope: !342, inlinedAt: !305)
!344 = !DILocation(line: 27, column: 22, scope: !263)
!345 = !DILocation(line: 27, column: 9, scope: !263)
!346 = !DILocation(line: 651, column: 23, scope: !347, inlinedAt: !305)
!347 = distinct !DILexicalBlock(scope: !302, file: !159, line: 650, column: 2)
!348 = !DILocation(line: 651, column: 3, scope: !347, inlinedAt: !305)
!349 = !DILocation(line: 12, column: 13, scope: !350)
!350 = distinct !DILexicalBlock(scope: !247, file: !10, line: 12, column: 9)
!351 = !DILocation(line: 12, column: 40, scope: !350)
!352 = !DILocation(line: 12, column: 24, scope: !350)
!353 = !DILocation(line: 651, column: 23, scope: !354, inlinedAt: !274)
!354 = distinct !DILexicalBlock(scope: !271, file: !159, line: 650, column: 2)
!355 = !DILocation(line: 651, column: 3, scope: !354, inlinedAt: !274)
!356 = !DILocation(line: 651, column: 23, scope: !357, inlinedAt: !305)
!357 = distinct !DILexicalBlock(scope: !302, file: !159, line: 650, column: 2)
!358 = !DILocation(line: 651, column: 3, scope: !357, inlinedAt: !305)
!359 = !DILocalVariable(name: "state", scope: !360, file: !10, line: 648, type: !161, align: 8)
!360 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !159, file: !159, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !361)
!361 = !{!359}
!362 = !DILocation(line: 648, column: 12, scope: !360, inlinedAt: !363)
!363 = !DILocation(line: 9, column: 2, scope: !364, inlinedAt: !366)
!364 = distinct !DISubprogram(name: "native_rmdir", linkageName: "native_rmdir", scope: !365, file: !365, line: 7, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!365 = !DIFile(filename: "rmdir.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io/os")
!366 = !DILocation(line: 34, column: 3, scope: !247)
!367 = !DILocation(line: 648, column: 20, scope: !360, inlinedAt: !363)
!368 = !DILocation(line: 13, column: 22, scope: !369, inlinedAt: !366)
!369 = distinct !DILexicalBlock(scope: !364, file: !365, line: 10, column: 2)
!370 = !DILocation(line: 13, column: 8, scope: !369, inlinedAt: !366)
!371 = !DILocation(line: 13, column: 60, scope: !369, inlinedAt: !366)
!372 = !DILocation(line: 651, column: 23, scope: !373, inlinedAt: !363)
!373 = distinct !DILexicalBlock(scope: !360, file: !159, line: 650, column: 2)
!374 = !DILocation(line: 651, column: 3, scope: !373, inlinedAt: !363)
!375 = !DILocation(line: 14, column: 12, scope: !376, inlinedAt: !366)
!376 = distinct !DILexicalBlock(scope: !369, file: !365, line: 14, column: 4)
!377 = !DILocation(line: 16, column: 31, scope: !378, inlinedAt: !366)
!378 = distinct !DILexicalBlock(scope: !376, file: !365, line: 16, column: 24)
!379 = !DILocation(line: 651, column: 23, scope: !380, inlinedAt: !363)
!380 = distinct !DILexicalBlock(scope: !360, file: !159, line: 650, column: 2)
!381 = !DILocation(line: 651, column: 3, scope: !380, inlinedAt: !363)
!382 = !DILocation(line: 20, column: 32, scope: !383, inlinedAt: !366)
!383 = distinct !DILexicalBlock(scope: !376, file: !365, line: 20, column: 25)
!384 = !DILocation(line: 651, column: 23, scope: !385, inlinedAt: !363)
!385 = distinct !DILexicalBlock(scope: !360, file: !159, line: 650, column: 2)
!386 = !DILocation(line: 651, column: 3, scope: !385, inlinedAt: !363)
!387 = !DILocation(line: 21, column: 38, scope: !388, inlinedAt: !366)
!388 = distinct !DILexicalBlock(scope: !376, file: !365, line: 21, column: 31)
!389 = !DILocation(line: 651, column: 23, scope: !390, inlinedAt: !363)
!390 = distinct !DILexicalBlock(scope: !360, file: !159, line: 650, column: 2)
!391 = !DILocation(line: 651, column: 3, scope: !390, inlinedAt: !363)
!392 = !DILocation(line: 23, column: 32, scope: !393, inlinedAt: !366)
!393 = distinct !DILexicalBlock(scope: !376, file: !365, line: 23, column: 25)
!394 = !DILocation(line: 651, column: 23, scope: !395, inlinedAt: !363)
!395 = distinct !DILexicalBlock(scope: !360, file: !159, line: 650, column: 2)
!396 = !DILocation(line: 651, column: 3, scope: !395, inlinedAt: !363)
!397 = !DILocation(line: 24, column: 35, scope: !398, inlinedAt: !366)
!398 = distinct !DILexicalBlock(scope: !376, file: !365, line: 24, column: 28)
!399 = !DILocation(line: 651, column: 23, scope: !400, inlinedAt: !363)
!400 = distinct !DILexicalBlock(scope: !360, file: !159, line: 650, column: 2)
!401 = !DILocation(line: 651, column: 3, scope: !400, inlinedAt: !363)
!402 = !DILocation(line: 25, column: 31, scope: !403, inlinedAt: !366)
!403 = distinct !DILexicalBlock(scope: !376, file: !365, line: 25, column: 24)
!404 = !DILocation(line: 651, column: 23, scope: !405, inlinedAt: !363)
!405 = distinct !DILexicalBlock(scope: !360, file: !159, line: 650, column: 2)
!406 = !DILocation(line: 651, column: 3, scope: !405, inlinedAt: !363)
!407 = !DILocation(line: 26, column: 21, scope: !408, inlinedAt: !366)
!408 = distinct !DILexicalBlock(scope: !376, file: !365, line: 26, column: 14)
!409 = !DILocation(line: 651, column: 23, scope: !410, inlinedAt: !363)
!410 = distinct !DILexicalBlock(scope: !360, file: !159, line: 650, column: 2)
!411 = !DILocation(line: 651, column: 3, scope: !410, inlinedAt: !363)
!412 = !DILocation(line: 12, column: 13, scope: !413)
!413 = distinct !DILexicalBlock(scope: !247, file: !10, line: 12, column: 9)
!414 = !DILocation(line: 12, column: 40, scope: !413)
!415 = !DILocation(line: 12, column: 24, scope: !413)
!416 = !DILocation(line: 651, column: 23, scope: !417, inlinedAt: !274)
!417 = distinct !DILexicalBlock(scope: !271, file: !159, line: 650, column: 2)
!418 = !DILocation(line: 651, column: 3, scope: !417, inlinedAt: !274)
!419 = !DILocation(line: 12, column: 13, scope: !420)
!420 = distinct !DILexicalBlock(scope: !247, file: !10, line: 12, column: 9)
!421 = !DILocation(line: 12, column: 40, scope: !420)
!422 = !DILocation(line: 12, column: 24, scope: !420)
!423 = !DILocation(line: 651, column: 23, scope: !424, inlinedAt: !274)
!424 = distinct !DILexicalBlock(scope: !271, file: !159, line: 650, column: 2)
!425 = !DILocation(line: 651, column: 3, scope: !424, inlinedAt: !274)
!426 = distinct !DISubprogram(name: "native_fopen", linkageName: "std.io.os.native_fopen", scope: !36, file: !36, line: 8, type: !427, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !429)
!427 = !DISubroutineType(types: !428)
!428 = !{!28, !14, !14}
!429 = !{!430}
!430 = !DILocalVariable(name: "file", scope: !431, file: !36, line: 13, type: !28, align: 8)
!431 = distinct !DILexicalBlock(scope: !426, file: !36, line: 9, column: 1)
!432 = !DILocalVariable(name: "filename", arg: 1, scope: !426, file: !36, line: 8, type: !14)
!433 = !DILocation(line: 8, column: 31, scope: !426)
!434 = !DILocalVariable(name: "mode", arg: 2, scope: !426, file: !36, line: 8, type: !14)
!435 = !DILocation(line: 8, column: 48, scope: !426)
!436 = !DILocation(line: 5, column: 11, scope: !437)
!437 = distinct !DILexicalBlock(scope: !426, file: !36, line: 8, column: 65)
!438 = !DILocation(line: 6, column: 11, scope: !437)
!439 = !DILocalVariable(name: "state", scope: !440, file: !36, line: 648, type: !161, align: 8)
!440 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !159, file: !159, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !441)
!441 = !{!439}
!442 = !DILocation(line: 648, column: 12, scope: !440, inlinedAt: !443)
!443 = !DILocation(line: 8, column: 65, scope: !426)
!444 = !DILocation(line: 648, column: 20, scope: !440, inlinedAt: !443)
!445 = !DILocation(line: 13, column: 9, scope: !431)
!446 = !DILocation(line: 13, column: 28, scope: !431)
!447 = !DILocation(line: 13, column: 51, scope: !431)
!448 = !DILocation(line: 13, column: 16, scope: !431)
!449 = !DILocation(line: 15, column: 10, scope: !431)
!450 = !DILocation(line: 81, column: 10, scope: !451, inlinedAt: !453)
!451 = distinct !DILexicalBlock(scope: !452, file: !36, line: 81, column: 2)
!452 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !36, file: !36, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!453 = !DILocation(line: 15, column: 18, scope: !431)
!454 = !DILocation(line: 83, column: 30, scope: !455, inlinedAt: !453)
!455 = distinct !DILexicalBlock(scope: !451, file: !36, line: 83, column: 23)
!456 = !DILocation(line: 84, column: 30, scope: !457, inlinedAt: !453)
!457 = distinct !DILexicalBlock(scope: !451, file: !36, line: 84, column: 23)
!458 = !DILocation(line: 85, column: 29, scope: !459, inlinedAt: !453)
!459 = distinct !DILexicalBlock(scope: !451, file: !36, line: 85, column: 22)
!460 = !DILocation(line: 86, column: 30, scope: !461, inlinedAt: !453)
!461 = distinct !DILexicalBlock(scope: !451, file: !36, line: 86, column: 23)
!462 = !DILocation(line: 87, column: 29, scope: !463, inlinedAt: !453)
!463 = distinct !DILexicalBlock(scope: !451, file: !36, line: 87, column: 22)
!464 = !DILocation(line: 88, column: 30, scope: !465, inlinedAt: !453)
!465 = distinct !DILexicalBlock(scope: !451, file: !36, line: 88, column: 23)
!466 = !DILocation(line: 89, column: 30, scope: !467, inlinedAt: !453)
!467 = distinct !DILexicalBlock(scope: !451, file: !36, line: 89, column: 23)
!468 = !DILocation(line: 90, column: 29, scope: !469, inlinedAt: !453)
!469 = distinct !DILexicalBlock(scope: !451, file: !36, line: 90, column: 22)
!470 = !DILocation(line: 91, column: 30, scope: !471, inlinedAt: !453)
!471 = distinct !DILexicalBlock(scope: !451, file: !36, line: 91, column: 23)
!472 = !DILocation(line: 92, column: 36, scope: !473, inlinedAt: !453)
!473 = distinct !DILexicalBlock(scope: !451, file: !36, line: 92, column: 29)
!474 = !DILocation(line: 93, column: 30, scope: !475, inlinedAt: !453)
!475 = distinct !DILexicalBlock(scope: !451, file: !36, line: 93, column: 23)
!476 = !DILocation(line: 94, column: 31, scope: !477, inlinedAt: !453)
!477 = distinct !DILexicalBlock(scope: !451, file: !36, line: 94, column: 24)
!478 = !DILocation(line: 95, column: 30, scope: !479, inlinedAt: !453)
!479 = distinct !DILexicalBlock(scope: !451, file: !36, line: 95, column: 23)
!480 = !DILocation(line: 96, column: 30, scope: !481, inlinedAt: !453)
!481 = distinct !DILexicalBlock(scope: !451, file: !36, line: 96, column: 23)
!482 = !DILocation(line: 97, column: 29, scope: !483, inlinedAt: !453)
!483 = distinct !DILexicalBlock(scope: !451, file: !36, line: 97, column: 22)
!484 = !DILocation(line: 98, column: 33, scope: !485, inlinedAt: !453)
!485 = distinct !DILexicalBlock(scope: !451, file: !36, line: 98, column: 26)
!486 = !DILocation(line: 99, column: 29, scope: !487, inlinedAt: !453)
!487 = distinct !DILexicalBlock(scope: !451, file: !36, line: 99, column: 22)
!488 = !DILocation(line: 100, column: 34, scope: !489, inlinedAt: !453)
!489 = distinct !DILexicalBlock(scope: !451, file: !36, line: 100, column: 27)
!490 = !DILocation(line: 101, column: 27, scope: !491, inlinedAt: !453)
!491 = distinct !DILexicalBlock(scope: !451, file: !36, line: 101, column: 20)
!492 = !DILocation(line: 102, column: 35, scope: !493, inlinedAt: !453)
!493 = distinct !DILexicalBlock(scope: !451, file: !36, line: 102, column: 28)
!494 = !DILocation(line: 103, column: 19, scope: !495, inlinedAt: !453)
!495 = distinct !DILexicalBlock(scope: !451, file: !36, line: 103, column: 12)
!496 = !DILocation(line: 651, column: 23, scope: !497, inlinedAt: !443)
!497 = distinct !DILexicalBlock(scope: !440, file: !159, line: 650, column: 2)
!498 = !DILocation(line: 651, column: 3, scope: !497, inlinedAt: !443)
!499 = !DILocation(line: 651, column: 23, scope: !500, inlinedAt: !443)
!500 = distinct !DILexicalBlock(scope: !440, file: !159, line: 650, column: 2)
!501 = !DILocation(line: 651, column: 3, scope: !500, inlinedAt: !443)
!502 = distinct !DISubprogram(name: "native_remove", linkageName: "std.io.os.native_remove", scope: !36, file: !36, line: 18, type: !503, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !14}
!505 = !{!506}
!506 = !DILocalVariable(name: "result", scope: !507, file: !36, line: 23, type: !508, align: 4)
!507 = distinct !DILexicalBlock(scope: !502, file: !36, line: 19, column: 1)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !36, file: !36, line: 23, baseType: !31, align: 4)
!509 = !DILocalVariable(name: "filename", arg: 1, scope: !502, file: !36, line: 18, type: !14)
!510 = !DILocation(line: 18, column: 31, scope: !502)
!511 = !DILocalVariable(name: "state", scope: !512, file: !36, line: 648, type: !161, align: 8)
!512 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !159, file: !159, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !513)
!513 = !{!511}
!514 = !DILocation(line: 648, column: 12, scope: !512, inlinedAt: !515)
!515 = !DILocation(line: 18, column: 44, scope: !502)
!516 = !DILocation(line: 648, column: 20, scope: !512, inlinedAt: !515)
!517 = !DILocation(line: 23, column: 8, scope: !507)
!518 = !DILocation(line: 23, column: 30, scope: !507)
!519 = !DILocation(line: 23, column: 17, scope: !507)
!520 = !DILocation(line: 25, column: 6, scope: !507)
!521 = !DILocation(line: 27, column: 11, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !36, line: 27, column: 3)
!523 = distinct !DILexicalBlock(scope: !507, file: !36, line: 26, column: 2)
!524 = !DILocation(line: 651, column: 23, scope: !525, inlinedAt: !515)
!525 = distinct !DILexicalBlock(scope: !512, file: !159, line: 650, column: 2)
!526 = !DILocation(line: 651, column: 3, scope: !525, inlinedAt: !515)
!527 = !DILocation(line: 651, column: 23, scope: !528, inlinedAt: !515)
!528 = distinct !DILexicalBlock(scope: !512, file: !159, line: 650, column: 2)
!529 = !DILocation(line: 651, column: 3, scope: !528, inlinedAt: !515)
!530 = !DILocation(line: 651, column: 23, scope: !531, inlinedAt: !515)
!531 = distinct !DILexicalBlock(scope: !512, file: !159, line: 650, column: 2)
!532 = !DILocation(line: 651, column: 3, scope: !531, inlinedAt: !515)
!533 = distinct !DISubprogram(name: "native_freopen", linkageName: "std.io.os.native_freopen", scope: !36, file: !36, line: 42, type: !534, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{!28, !28, !14, !14}
!536 = !{}
!537 = !DILocalVariable(name: "file", arg: 1, scope: !533, file: !36, line: 42, type: !28)
!538 = !DILocation(line: 42, column: 32, scope: !533)
!539 = !DILocalVariable(name: "filename", arg: 2, scope: !533, file: !36, line: 42, type: !14)
!540 = !DILocation(line: 42, column: 45, scope: !533)
!541 = !DILocalVariable(name: "mode", arg: 3, scope: !533, file: !36, line: 42, type: !14)
!542 = !DILocation(line: 42, column: 62, scope: !533)
!543 = !DILocation(line: 39, column: 11, scope: !544)
!544 = distinct !DILexicalBlock(scope: !533, file: !36, line: 42, column: 79)
!545 = !DILocation(line: 40, column: 11, scope: !544)
!546 = !DILocalVariable(name: "state", scope: !547, file: !36, line: 648, type: !161, align: 8)
!547 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !159, file: !159, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !548)
!548 = !{!546}
!549 = !DILocation(line: 648, column: 12, scope: !547, inlinedAt: !550)
!550 = !DILocation(line: 42, column: 79, scope: !533)
!551 = !DILocation(line: 648, column: 20, scope: !547, inlinedAt: !550)
!552 = !DILocation(line: 47, column: 24, scope: !553)
!553 = distinct !DILexicalBlock(scope: !533, file: !36, line: 43, column: 1)
!554 = !DILocation(line: 47, column: 47, scope: !553)
!555 = !DILocation(line: 47, column: 66, scope: !553)
!556 = !DILocation(line: 47, column: 10, scope: !553)
!557 = !DILocation(line: 49, column: 10, scope: !553)
!558 = !DILocation(line: 81, column: 10, scope: !559, inlinedAt: !561)
!559 = distinct !DILexicalBlock(scope: !560, file: !36, line: 81, column: 2)
!560 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !36, file: !36, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!561 = !DILocation(line: 49, column: 18, scope: !553)
!562 = !DILocation(line: 83, column: 30, scope: !563, inlinedAt: !561)
!563 = distinct !DILexicalBlock(scope: !559, file: !36, line: 83, column: 23)
!564 = !DILocation(line: 84, column: 30, scope: !565, inlinedAt: !561)
!565 = distinct !DILexicalBlock(scope: !559, file: !36, line: 84, column: 23)
!566 = !DILocation(line: 85, column: 29, scope: !567, inlinedAt: !561)
!567 = distinct !DILexicalBlock(scope: !559, file: !36, line: 85, column: 22)
!568 = !DILocation(line: 86, column: 30, scope: !569, inlinedAt: !561)
!569 = distinct !DILexicalBlock(scope: !559, file: !36, line: 86, column: 23)
!570 = !DILocation(line: 87, column: 29, scope: !571, inlinedAt: !561)
!571 = distinct !DILexicalBlock(scope: !559, file: !36, line: 87, column: 22)
!572 = !DILocation(line: 88, column: 30, scope: !573, inlinedAt: !561)
!573 = distinct !DILexicalBlock(scope: !559, file: !36, line: 88, column: 23)
!574 = !DILocation(line: 89, column: 30, scope: !575, inlinedAt: !561)
!575 = distinct !DILexicalBlock(scope: !559, file: !36, line: 89, column: 23)
!576 = !DILocation(line: 90, column: 29, scope: !577, inlinedAt: !561)
!577 = distinct !DILexicalBlock(scope: !559, file: !36, line: 90, column: 22)
!578 = !DILocation(line: 91, column: 30, scope: !579, inlinedAt: !561)
!579 = distinct !DILexicalBlock(scope: !559, file: !36, line: 91, column: 23)
!580 = !DILocation(line: 92, column: 36, scope: !581, inlinedAt: !561)
!581 = distinct !DILexicalBlock(scope: !559, file: !36, line: 92, column: 29)
!582 = !DILocation(line: 93, column: 30, scope: !583, inlinedAt: !561)
!583 = distinct !DILexicalBlock(scope: !559, file: !36, line: 93, column: 23)
!584 = !DILocation(line: 94, column: 31, scope: !585, inlinedAt: !561)
!585 = distinct !DILexicalBlock(scope: !559, file: !36, line: 94, column: 24)
!586 = !DILocation(line: 95, column: 30, scope: !587, inlinedAt: !561)
!587 = distinct !DILexicalBlock(scope: !559, file: !36, line: 95, column: 23)
!588 = !DILocation(line: 96, column: 30, scope: !589, inlinedAt: !561)
!589 = distinct !DILexicalBlock(scope: !559, file: !36, line: 96, column: 23)
!590 = !DILocation(line: 97, column: 29, scope: !591, inlinedAt: !561)
!591 = distinct !DILexicalBlock(scope: !559, file: !36, line: 97, column: 22)
!592 = !DILocation(line: 98, column: 33, scope: !593, inlinedAt: !561)
!593 = distinct !DILexicalBlock(scope: !559, file: !36, line: 98, column: 26)
!594 = !DILocation(line: 99, column: 29, scope: !595, inlinedAt: !561)
!595 = distinct !DILexicalBlock(scope: !559, file: !36, line: 99, column: 22)
!596 = !DILocation(line: 100, column: 34, scope: !597, inlinedAt: !561)
!597 = distinct !DILexicalBlock(scope: !559, file: !36, line: 100, column: 27)
!598 = !DILocation(line: 101, column: 27, scope: !599, inlinedAt: !561)
!599 = distinct !DILexicalBlock(scope: !559, file: !36, line: 101, column: 20)
!600 = !DILocation(line: 102, column: 35, scope: !601, inlinedAt: !561)
!601 = distinct !DILexicalBlock(scope: !559, file: !36, line: 102, column: 28)
!602 = !DILocation(line: 103, column: 19, scope: !603, inlinedAt: !561)
!603 = distinct !DILexicalBlock(scope: !559, file: !36, line: 103, column: 12)
!604 = !DILocation(line: 651, column: 23, scope: !605, inlinedAt: !550)
!605 = distinct !DILexicalBlock(scope: !547, file: !159, line: 650, column: 2)
!606 = !DILocation(line: 651, column: 3, scope: !605, inlinedAt: !550)
!607 = !DILocation(line: 651, column: 23, scope: !608, inlinedAt: !550)
!608 = distinct !DILexicalBlock(scope: !547, file: !159, line: 650, column: 2)
!609 = !DILocation(line: 651, column: 3, scope: !608, inlinedAt: !550)
!610 = distinct !DISubprogram(name: "native_fseek", linkageName: "std.io.os.native_fseek", scope: !36, file: !36, line: 52, type: !611, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !536)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !28, !82, !35}
!613 = !DILocalVariable(name: "file", arg: 1, scope: !610, file: !36, line: 52, type: !28)
!614 = !DILocation(line: 52, column: 29, scope: !610)
!615 = !DILocalVariable(name: "offset", arg: 2, scope: !610, file: !36, line: 52, type: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !82)
!617 = !DILocation(line: 52, column: 39, scope: !610)
!618 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !610, file: !36, line: 52, type: !35)
!619 = !DILocation(line: 52, column: 52, scope: !610)
!620 = !DILocation(line: 54, column: 6, scope: !610)
!621 = !DILocation(line: 109, column: 10, scope: !622, inlinedAt: !624)
!622 = distinct !DILexicalBlock(scope: !623, file: !36, line: 109, column: 2)
!623 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !36, file: !36, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!624 = !DILocation(line: 54, column: 70, scope: !610)
!625 = !DILocation(line: 111, column: 30, scope: !626, inlinedAt: !624)
!626 = distinct !DILexicalBlock(scope: !622, file: !36, line: 111, column: 23)
!627 = !DILocation(line: 112, column: 29, scope: !628, inlinedAt: !624)
!628 = distinct !DILexicalBlock(scope: !622, file: !36, line: 112, column: 22)
!629 = !DILocation(line: 113, column: 33, scope: !630, inlinedAt: !624)
!630 = distinct !DILexicalBlock(scope: !622, file: !36, line: 113, column: 26)
!631 = !DILocation(line: 114, column: 29, scope: !632, inlinedAt: !624)
!632 = distinct !DILexicalBlock(scope: !622, file: !36, line: 114, column: 22)
!633 = !DILocation(line: 115, column: 30, scope: !634, inlinedAt: !624)
!634 = distinct !DILexicalBlock(scope: !622, file: !36, line: 115, column: 23)
!635 = !DILocation(line: 116, column: 27, scope: !636, inlinedAt: !624)
!636 = distinct !DILexicalBlock(scope: !622, file: !36, line: 116, column: 20)
!637 = !DILocation(line: 117, column: 30, scope: !638, inlinedAt: !624)
!638 = distinct !DILexicalBlock(scope: !622, file: !36, line: 117, column: 23)
!639 = !DILocation(line: 118, column: 29, scope: !640, inlinedAt: !624)
!640 = distinct !DILexicalBlock(scope: !622, file: !36, line: 118, column: 22)
!641 = !DILocation(line: 119, column: 29, scope: !642, inlinedAt: !624)
!642 = distinct !DILexicalBlock(scope: !622, file: !36, line: 119, column: 22)
!643 = !DILocation(line: 120, column: 29, scope: !644, inlinedAt: !624)
!644 = distinct !DILexicalBlock(scope: !622, file: !36, line: 120, column: 22)
!645 = !DILocation(line: 121, column: 30, scope: !646, inlinedAt: !624)
!646 = distinct !DILexicalBlock(scope: !622, file: !36, line: 121, column: 23)
!647 = !DILocation(line: 122, column: 19, scope: !648, inlinedAt: !624)
!648 = distinct !DILexicalBlock(scope: !622, file: !36, line: 122, column: 12)
!649 = distinct !DISubprogram(name: "native_ftell", linkageName: "std.io.os.native_ftell", scope: !36, file: !36, line: 58, type: !650, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !652)
!650 = !DISubroutineType(types: !651)
!651 = !{!22, !28}
!652 = !{!653}
!653 = !DILocalVariable(name: "index", scope: !649, file: !36, line: 60, type: !82, align: 8)
!654 = !DILocalVariable(name: "file", arg: 1, scope: !649, file: !36, line: 58, type: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !36, file: !36, line: 368, baseType: !28, align: 8)
!656 = !DILocation(line: 58, column: 28, scope: !649)
!657 = !DILocation(line: 60, column: 7, scope: !649)
!658 = !DILocation(line: 60, column: 15, scope: !649)
!659 = !DILocation(line: 61, column: 9, scope: !649)
!660 = !DILocation(line: 61, column: 22, scope: !649)
!661 = !DILocation(line: 109, column: 10, scope: !662, inlinedAt: !664)
!662 = distinct !DILexicalBlock(scope: !663, file: !36, line: 109, column: 2)
!663 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !36, file: !36, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!664 = !DILocation(line: 61, column: 35, scope: !649)
!665 = !DILocation(line: 111, column: 30, scope: !666, inlinedAt: !664)
!666 = distinct !DILexicalBlock(scope: !662, file: !36, line: 111, column: 23)
!667 = !DILocation(line: 112, column: 29, scope: !668, inlinedAt: !664)
!668 = distinct !DILexicalBlock(scope: !662, file: !36, line: 112, column: 22)
!669 = !DILocation(line: 113, column: 33, scope: !670, inlinedAt: !664)
!670 = distinct !DILexicalBlock(scope: !662, file: !36, line: 113, column: 26)
!671 = !DILocation(line: 114, column: 29, scope: !672, inlinedAt: !664)
!672 = distinct !DILexicalBlock(scope: !662, file: !36, line: 114, column: 22)
!673 = !DILocation(line: 115, column: 30, scope: !674, inlinedAt: !664)
!674 = distinct !DILexicalBlock(scope: !662, file: !36, line: 115, column: 23)
!675 = !DILocation(line: 116, column: 27, scope: !676, inlinedAt: !664)
!676 = distinct !DILexicalBlock(scope: !662, file: !36, line: 116, column: 20)
!677 = !DILocation(line: 117, column: 30, scope: !678, inlinedAt: !664)
!678 = distinct !DILexicalBlock(scope: !662, file: !36, line: 117, column: 23)
!679 = !DILocation(line: 118, column: 29, scope: !680, inlinedAt: !664)
!680 = distinct !DILexicalBlock(scope: !662, file: !36, line: 118, column: 22)
!681 = !DILocation(line: 119, column: 29, scope: !682, inlinedAt: !664)
!682 = distinct !DILexicalBlock(scope: !662, file: !36, line: 119, column: 22)
!683 = !DILocation(line: 120, column: 29, scope: !684, inlinedAt: !664)
!684 = distinct !DILexicalBlock(scope: !662, file: !36, line: 120, column: 22)
!685 = !DILocation(line: 121, column: 30, scope: !686, inlinedAt: !664)
!686 = distinct !DILexicalBlock(scope: !662, file: !36, line: 121, column: 23)
!687 = !DILocation(line: 122, column: 19, scope: !688, inlinedAt: !664)
!688 = distinct !DILexicalBlock(scope: !662, file: !36, line: 122, column: 12)
!689 = distinct !DISubprogram(name: "native_fwrite", linkageName: "std.io.os.native_fwrite", scope: !36, file: !36, line: 64, type: !690, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !536)
!690 = !DISubroutineType(types: !691)
!691 = !{!22, !28, !15}
!692 = !DILocalVariable(name: "file", arg: 1, scope: !689, file: !36, line: 64, type: !655)
!693 = !DILocation(line: 64, column: 29, scope: !689)
!694 = !DILocalVariable(name: "buffer", arg: 2, scope: !689, file: !36, line: 64, type: !15)
!695 = !DILocation(line: 64, column: 42, scope: !689)
!696 = !DILocation(line: 66, column: 22, scope: !689)
!697 = !DILocation(line: 66, column: 37, scope: !689)
!698 = !DILocation(line: 66, column: 49, scope: !689)
!699 = !DILocation(line: 66, column: 9, scope: !689)
!700 = distinct !DISubprogram(name: "native_fputc", linkageName: "std.io.os.native_fputc", scope: !36, file: !36, line: 69, type: !701, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !536)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !31, !28}
!703 = !DILocalVariable(name: "c", arg: 1, scope: !700, file: !36, line: 69, type: !508)
!704 = !DILocation(line: 69, column: 28, scope: !700)
!705 = !DILocalVariable(name: "stream", arg: 2, scope: !700, file: !36, line: 69, type: !655)
!706 = !DILocation(line: 69, column: 37, scope: !700)
!707 = !DILocation(line: 71, column: 6, scope: !700)
!708 = !DILocation(line: 71, column: 50, scope: !700)
!709 = distinct !DISubprogram(name: "native_fread", linkageName: "std.io.os.native_fread", scope: !36, file: !36, line: 74, type: !690, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !536)
!710 = !DILocalVariable(name: "file", arg: 1, scope: !709, file: !36, line: 74, type: !655)
!711 = !DILocation(line: 74, column: 28, scope: !709)
!712 = !DILocalVariable(name: "buffer", arg: 2, scope: !709, file: !36, line: 74, type: !15)
!713 = !DILocation(line: 74, column: 41, scope: !709)
!714 = !DILocation(line: 76, column: 21, scope: !709)
!715 = !DILocation(line: 76, column: 36, scope: !709)
!716 = !DILocation(line: 76, column: 48, scope: !709)
!717 = !DILocation(line: 76, column: 9, scope: !709)
!718 = distinct !DISubprogram(name: "native_ls", linkageName: "std.io.os.native_ls", scope: !719, file: !719, line: 4, type: !720, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !730)
!719 = !DIFile(filename: "ls.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/io/os")
!720 = !DISubroutineType(types: !721)
!721 = !{!722, !11, !57, !57, !14, !25}
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !719, file: !719, line: 18, size: 320, align: 64, elements: !723, identifier: "std_collections_list$std.io.path.PathImp$.List")
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !722, file: !719, line: 20, baseType: !21, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !722, file: !719, line: 21, baseType: !21, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !722, file: !719, line: 22, baseType: !25, size: 128, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !722, file: !719, line: 23, baseType: !728, size: 64, align: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !729, size: 64, align: 64, dwarfAddressSpace: 0)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !719, file: !719, line: 10, baseType: !11, align: 8)
!730 = !{!731, !733, !734, !735, !738}
!731 = !DILocalVariable(name: "list", scope: !718, file: !719, line: 6, type: !732, align: 8)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathList", scope: !719, file: !719, line: 10, baseType: !722, align: 8)
!733 = !DILocalVariable(name: "directory", scope: !718, file: !719, line: 8, type: !248, align: 8)
!734 = !DILocalVariable(name: "entry", scope: !718, file: !719, line: 15, type: !250, align: 8)
!735 = !DILocalVariable(name: "name", scope: !736, file: !719, line: 18, type: !14, align: 8)
!736 = distinct !DILexicalBlock(scope: !737, file: !719, line: 17, column: 2)
!737 = distinct !DILexicalBlock(scope: !718, file: !719, line: 16, column: 2)
!738 = !DILocalVariable(name: "path", scope: !736, file: !719, line: 22, type: !267, align: 8)
!739 = !DILocalVariable(name: "dir", arg: 1, scope: !718, file: !719, line: 4, type: !267)
!740 = !DILocation(line: 4, column: 29, scope: !718)
!741 = !DILocalVariable(name: "no_dirs", arg: 2, scope: !718, file: !719, line: 4, type: !57)
!742 = !DILocation(line: 4, column: 39, scope: !718)
!743 = !DILocalVariable(name: "no_symlinks", arg: 3, scope: !718, file: !719, line: 4, type: !57)
!744 = !DILocation(line: 4, column: 53, scope: !718)
!745 = !DILocalVariable(name: "mask", arg: 4, scope: !718, file: !719, line: 4, type: !14)
!746 = !DILocation(line: 4, column: 73, scope: !718)
!747 = !DILocalVariable(name: "allocator", arg: 5, scope: !718, file: !719, line: 4, type: !25)
!748 = !DILocation(line: 4, column: 89, scope: !718)
!749 = !DILocation(line: 6, column: 11, scope: !718)
!750 = !DILocation(line: 30, column: 71, scope: !751, inlinedAt: !753)
!751 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !752, file: !752, line: 30, scopeLine: 30, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!752 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/collections")
!753 = !DILocation(line: 7, column: 2, scope: !718)
!754 = !DILocation(line: 8, column: 9, scope: !718)
!755 = !DILocalVariable(name: "state", scope: !756, file: !719, line: 648, type: !161, align: 8)
!756 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !159, file: !159, line: 646, scopeLine: 646, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !757)
!757 = !{!755}
!758 = !DILocation(line: 648, column: 12, scope: !756, inlinedAt: !759)
!759 = !DILocation(line: 9, column: 2, scope: !718)
!760 = !DILocation(line: 648, column: 20, scope: !756, inlinedAt: !759)
!761 = !DILocation(line: 11, column: 30, scope: !762)
!762 = distinct !DILexicalBlock(scope: !718, file: !719, line: 10, column: 2)
!763 = !DILocation(line: 11, column: 47, scope: !762)
!764 = !DILocation(line: 11, column: 77, scope: !762)
!765 = !DILocation(line: 11, column: 15, scope: !762)
!766 = !DILocation(line: 651, column: 23, scope: !767, inlinedAt: !759)
!767 = distinct !DILexicalBlock(scope: !756, file: !159, line: 650, column: 2)
!768 = !DILocation(line: 651, column: 3, scope: !767, inlinedAt: !759)
!769 = !DILocation(line: 14, column: 6, scope: !718)
!770 = !DILocation(line: 14, column: 26, scope: !718)
!771 = !DILocation(line: 14, column: 68, scope: !718)
!772 = !DILocation(line: 13, column: 12, scope: !773)
!773 = distinct !DILexicalBlock(scope: !718, file: !719, line: 13, column: 8)
!774 = !DILocation(line: 13, column: 39, scope: !773)
!775 = !DILocation(line: 13, column: 23, scope: !773)
!776 = !DILocation(line: 15, column: 16, scope: !718)
!777 = !DILocation(line: 16, column: 2, scope: !718)
