; ModuleID = 'std::core::mem'
source_filename = "std::core::mem"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.157 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].156" = type { ptr, i64 }
%any.159 = type { ptr, i64 }
%"any[].160" = type { ptr, i64 }

@.enum.NOT_ATOMIC = internal constant [11 x i8] c"NOT_ATOMIC\00", align 1
@.enum.UNORDERED = internal constant [10 x i8] c"UNORDERED\00", align 1
@.enum.RELAXED = internal constant [8 x i8] c"RELAXED\00", align 1
@.enum.ACQUIRE = internal constant [8 x i8] c"ACQUIRE\00", align 1
@.enum.RELEASE = internal constant [8 x i8] c"RELEASE\00", align 1
@.enum.ACQUIRE_RELEASE = internal constant [16 x i8] c"ACQUIRE_RELEASE\00", align 1
@.enum.SEQ_CONSISTENT = internal constant [15 x i8] c"SEQ_CONSISTENT\00", align 1
@"$ct.int" = linkonce global %.introspect.157 { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_MEM_ALIGNMENT", linkageName: "std.core.mem.DEFAULT_MEM_ALIGNMENT", scope: !2, file: !2, line: 10, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "KB", linkageName: "std.core.mem.KB", scope: !2, file: !2, line: 11, type: !9, isLocal: false, isDefinition: true, align: 8)
!9 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "MB", linkageName: "std.core.mem.MB", scope: !2, file: !2, line: 12, type: !9, isLocal: false, isDefinition: true, align: 8)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "GB", linkageName: "std.core.mem.GB", scope: !2, file: !2, line: 13, type: !9, isLocal: false, isDefinition: true, align: 8)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "TB", linkageName: "std.core.mem.TB", scope: !2, file: !2, line: 14, type: !9, isLocal: false, isDefinition: true, align: 8)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "pagesize", linkageName: "os_pagesize.pagesize", scope: !2, file: !2, line: 30, type: !18, isLocal: true, isDefinition: true, align: 8)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !9)
!19 = !{i32 2, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 2, !"wchar_size", i32 4}
!22 = !{i32 4, !"PIC Level", i32 2}
!23 = !{i32 1, !"uwtable", i32 1}
!24 = !{i32 2, !"frame-pointer", i32 1}
!25 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !26, splitDebugInlining: false)
!26 = !{!0, !4, !7, !10, !12, !14, !16}
!27 = distinct !DISubprogram(name: "os_pagesize", linkageName: "std.core.mem.os_pagesize", scope: !2, file: !2, line: 26, type: !28, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25)
!28 = !DISubroutineType(types: !29)
!29 = !{!18}
!30 = !DILocation(line: 31, column: 8, scope: !27)
!31 = !DILocation(line: 31, column: 25, scope: !27)
!32 = !DILocation(line: 32, column: 22, scope: !27)
!33 = distinct !DISubprogram(name: "aligned_offset", linkageName: "std.core.mem.aligned_offset", scope: !2, file: !2, line: 313, type: !34, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !36)
!34 = !DISubroutineType(types: !35)
!35 = !{!18, !9, !9}
!36 = !{}
!37 = !DILocalVariable(name: "offset", arg: 1, scope: !33, file: !2, line: 313, type: !18)
!38 = !DILocation(line: 313, column: 27, scope: !33)
!39 = !DILocalVariable(name: "alignment", arg: 2, scope: !33, file: !2, line: 313, type: !18)
!40 = !DILocation(line: 313, column: 39, scope: !33)
!41 = !DILocation(line: 315, column: 10, scope: !33)
!42 = !DILocation(line: 315, column: 38, scope: !33)
!43 = !DILocation(line: 315, column: 9, scope: !33)
!44 = distinct !DISubprogram(name: "ptr_is_aligned", linkageName: "std.core.mem.ptr_is_aligned", scope: !2, file: !2, line: 326, type: !45, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !36)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !48, !9}
!47 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!49 = !DILocalVariable(name: "ptr", arg: 1, scope: !44, file: !2, line: 326, type: !48)
!50 = !DILocation(line: 326, column: 30, scope: !44)
!51 = !DILocalVariable(name: "alignment", arg: 2, scope: !44, file: !2, line: 326, type: !18)
!52 = !DILocation(line: 326, column: 39, scope: !44)
!53 = !DILocation(line: 328, column: 9, scope: !44)
!54 = !DILocation(line: 328, column: 22, scope: !44)
!55 = distinct !DISubprogram(name: "ptr_is_page_aligned", linkageName: "std.core.mem.ptr_is_page_aligned", scope: !2, file: !2, line: 331, type: !56, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !36)
!56 = !DISubroutineType(types: !57)
!57 = !{!47, !48}
!58 = !DILocalVariable(name: "ptr", arg: 1, scope: !55, file: !2, line: 331, type: !48)
!59 = !DILocation(line: 331, column: 35, scope: !55)
!60 = !DILocation(line: 333, column: 9, scope: !55)
!61 = !DILocation(line: 333, column: 22, scope: !55)
!62 = distinct !DISubprogram(name: "temp_push", linkageName: "std.core.mem.temp_push", scope: !2, file: !2, line: 601, type: !63, scopeLine: 601, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25)
!63 = !DISubroutineType(types: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 420, baseType: !66, align: 8)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !68, identifier: "std.core.mem.allocator.TempAllocator")
!68 = !{!69, !75, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !67, file: !2, line: 33, baseType: !70, size: 128, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !71, identifier: "Allocator")
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !70, baseType: !48, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !67, file: !2, line: 34, baseType: !76, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !77, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !78, identifier: "std.core.mem.allocator.TempAllocatorPage")
!78 = !{!79, !80, !81, !82, !83}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !77, file: !2, line: 56, baseType: !76, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !77, file: !2, line: 57, baseType: !48, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !77, file: !2, line: 58, baseType: !18, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !77, file: !2, line: 59, baseType: !18, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !2, line: 60, baseType: !84, align: 8, offset: 256)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, align: 8, elements: !86)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87}
!87 = !DISubrange(count: 0, lowerBound: 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !67, file: !2, line: 35, baseType: !66, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !67, file: !2, line: 36, baseType: !47, size: 8, align: 8, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !67, file: !2, line: 37, baseType: !18, size: 64, align: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !67, file: !2, line: 38, baseType: !18, size: 64, align: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !67, file: !2, line: 39, baseType: !18, size: 64, align: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !67, file: !2, line: 40, baseType: !18, size: 64, align: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !67, file: !2, line: 41, baseType: !18, size: 64, align: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !67, file: !2, line: 42, baseType: !18, size: 64, align: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !2, line: 43, baseType: !84, align: 8, offset: 704)
!97 = !DILocation(line: 603, column: 9, scope: !62)
!98 = distinct !DISubprogram(name: "temp_pop", linkageName: "std.core.mem.temp_pop", scope: !2, file: !2, line: 609, type: !99, scopeLine: 609, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !36)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !65}
!101 = !DILocalVariable(name: "old_state", arg: 1, scope: !98, file: !2, line: 609, type: !65)
!102 = !DILocation(line: 609, column: 28, scope: !98)
!103 = !DILocation(line: 611, column: 2, scope: !98)
!104 = distinct !DISubprogram(name: "malloc", linkageName: "std.core.mem.malloc", scope: !2, file: !2, line: 728, type: !105, scopeLine: 728, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !36)
!105 = !DISubroutineType(types: !106)
!106 = !{!48, !9}
!107 = !DILocalVariable(name: "size", arg: 1, scope: !104, file: !2, line: 728, type: !18)
!108 = !DILocation(line: 728, column: 21, scope: !104)
!109 = !DILocation(line: 730, column: 27, scope: !104)
!110 = !DILocation(line: 80, column: 6, scope: !111, inlinedAt: !113)
!111 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !112, file: !112, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!112 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!113 = !DILocation(line: 75, column: 9, scope: !114, inlinedAt: !115)
!114 = distinct !DISubprogram(name: "malloc", linkageName: "malloc", scope: !112, file: !112, line: 73, scopeLine: 73, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!115 = !DILocation(line: 730, column: 9, scope: !104)
!116 = !DILocation(line: 80, column: 20, scope: !111, inlinedAt: !113)
!117 = !DILocation(line: 43, column: 71, scope: !118, inlinedAt: !119)
!118 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !112, file: !112, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!119 = !DILocation(line: 86, column: 10, scope: !111, inlinedAt: !113)
!120 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "std.core.mem.malloc_aligned", scope: !2, file: !2, line: 737, type: !121, scopeLine: 737, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !36)
!121 = !DISubroutineType(types: !122)
!122 = !{!48, !9, !9}
!123 = !DILocalVariable(name: "size", arg: 1, scope: !120, file: !2, line: 737, type: !18)
!124 = !DILocation(line: 737, column: 29, scope: !120)
!125 = !DILocalVariable(name: "alignment", arg: 2, scope: !120, file: !2, line: 737, type: !18)
!126 = !DILocation(line: 737, column: 39, scope: !120)
!127 = !DILocation(line: 739, column: 35, scope: !120)
!128 = !DILocation(line: 128, column: 6, scope: !129, inlinedAt: !130)
!129 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "malloc_aligned", scope: !112, file: !112, line: 126, scopeLine: 126, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!130 = !DILocation(line: 739, column: 9, scope: !120)
!131 = !DILocation(line: 128, column: 20, scope: !129, inlinedAt: !130)
!132 = !DILocation(line: 134, column: 43, scope: !129, inlinedAt: !130)
!133 = !DILocation(line: 134, column: 10, scope: !129, inlinedAt: !130)
!134 = distinct !DISubprogram(name: "tmalloc", linkageName: "std.core.mem.tmalloc", scope: !2, file: !2, line: 742, type: !121, scopeLine: 742, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !25, retainedNodes: !36)
!135 = !DILocalVariable(name: "size", arg: 1, scope: !134, file: !2, line: 742, type: !18)
!136 = !DILocation(line: 742, column: 22, scope: !134)
!137 = !DILocalVariable(name: "alignment", arg: 2, scope: !134, file: !2, line: 742, type: !18)
