; ModuleID = 'std::net::tcp'
source_filename = "std::net::tcp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.107 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].106" = type { ptr, i64 }
%Socket.109 = type { i32, i32, [128 x i8] }
%TcpSocketPair = type { %Socket.109, %Socket.109 }

@"$ct.std.net.tcp.TcpSocket" = linkonce global %.introspect.107 { i8 18, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), ptr null, i64 136, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.net.Socket" = linkonce global %.introspect.107 { i8 10, i64 0, ptr null, i64 136, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@"$ct.std.net.tcp.TcpServerSocket" = linkonce global %.introspect.107 { i8 18, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), ptr null, i64 136, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.net.tcp.TcpSocketPair" = linkonce global %.introspect.107 { i8 10, i64 0, ptr null, i64 272, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@.enum.UNSPECIFIED = internal constant [12 x i8] c"UNSPECIFIED\00", align 1
@.enum.IPV4 = internal constant [5 x i8] c"IPV4\00", align 1
@.enum.IPV6 = internal constant [5 x i8] c"IPV6\00", align 1
@"$ct.char" = linkonce global %.introspect.107 { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "tcp.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/net")
!8 = !{!9, !18}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SocketOption", scope: !7, file: !7, line: 110, baseType: !10, size: 8, align: 8, elements: !11)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DIEnumerator(name: "REUSEADDR", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "REUSEPORT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "KEEPALIVE", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "BROADCAST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OOBINLINE", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "DONTROUTE", value: 5, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpProtocol", scope: !7, file: !7, line: 4, baseType: !10, size: 8, align: 8, elements: !19)
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "UNSPECIFIED", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "IPV4", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "IPV6", value: 2, isUnsigned: true)
!23 = distinct !DISubprogram(name: "init", linkageName: "std.net.tcp.TcpSocketPair.init", scope: !7, file: !7, line: 80, type: !24, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !44)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TcpSocketPair*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "TcpSocketPair", scope: !7, file: !7, line: 74, size: 2176, align: 32, elements: !28, identifier: "std.net.tcp.TcpSocketPair")
!28 = !{!29, !43}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !27, file: !7, line: 76, baseType: !30, size: 1088, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "TcpSocket", scope: !7, file: !7, line: 10, baseType: !31, align: 4)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !7, file: !7, line: 4, size: 1088, align: 32, elements: !32, identifier: "std.net.Socket")
!32 = !{!33, !36, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !31, file: !7, line: 6, baseType: !34, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeSocket", scope: !7, file: !7, line: 7, baseType: !35, align: 4)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !31, file: !7, line: 7, baseType: !37, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Socklen_t", scope: !7, file: !7, line: 9, baseType: !38, align: 4)
!38 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr_storage", scope: !31, file: !7, line: 10, baseType: !40, size: 1024, align: 8, offset: 64)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, align: 8, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 128, lowerBound: 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !27, file: !7, line: 77, baseType: !30, size: 1088, align: 32, offset: 1088)
!44 = !{!45, !49, !52, !53, !54, !55}
!45 = !DILocalVariable(name: "sockets", scope: !23, file: !7, line: 103, type: !46, align: 4)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 64, align: 32, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 2, lowerBound: 0)
!49 = !DILocalVariable(name: "sockpair_result", scope: !23, file: !7, line: 104, type: !50, align: 8)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !51)
!51 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!52 = !DILocalVariable(name: "send_sock", scope: !23, file: !7, line: 107, type: !31, align: 4)
!53 = !DILocalVariable(name: "tcp_send_sock", scope: !23, file: !7, line: 108, type: !30, align: 4)
!54 = !DILocalVariable(name: "recv_sock", scope: !23, file: !7, line: 110, type: !31, align: 4)
!55 = !DILocalVariable(name: "tcp_recv_sock", scope: !23, file: !7, line: 111, type: !30, align: 4)
!56 = !DILocalVariable(name: "self", arg: 1, scope: !23, file: !7, line: 80, type: !26)
!57 = !DILocation(line: 80, column: 39, scope: !23)
!58 = !DILocation(line: 103, column: 19, scope: !23)
!59 = !DILocation(line: 104, column: 7, scope: !23)
!60 = !DILocation(line: 104, column: 25, scope: !23)
!61 = !DILocation(line: 105, column: 7, scope: !23)
!62 = !DILocation(line: 105, column: 35, scope: !23)
!63 = !DILocation(line: 107, column: 10, scope: !23)
!64 = !DILocation(line: 107, column: 40, scope: !23)
!65 = !DILocation(line: 108, column: 13, scope: !23)
!66 = !DILocation(line: 108, column: 29, scope: !23)
!67 = !DILocation(line: 110, column: 10, scope: !23)
!68 = !DILocation(line: 110, column: 40, scope: !23)
!69 = !DILocation(line: 111, column: 13, scope: !23)
!70 = !DILocation(line: 111, column: 29, scope: !23)
!71 = !DILocation(line: 114, column: 20, scope: !23)
!72 = !DILocation(line: 114, column: 44, scope: !23)
!73 = !DILocation(line: 114, column: 3, scope: !23)
!74 = !DILocation(line: 115, column: 9, scope: !23)
!75 = distinct !DISubprogram(name: "destroy", linkageName: "std.net.tcp.TcpSocketPair.destroy", scope: !7, file: !7, line: 118, type: !76, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !78)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !26}
!78 = !{}
!79 = !DILocalVariable(name: "self", arg: 1, scope: !75, file: !7, line: 118, type: !26)
!80 = !DILocation(line: 118, column: 32, scope: !75)
!81 = !DILocation(line: 122, column: 3, scope: !82)
!82 = distinct !DILexicalBlock(scope: !75, file: !7, line: 120, column: 2)
!83 = !DILocation(line: 121, column: 21, scope: !84)
!84 = distinct !DILexicalBlock(scope: !82, file: !7, line: 121, column: 15)
!85 = !DILocation(line: 121, column: 15, scope: !84)
!86 = !DILocation(line: 124, column: 2, scope: !75)
!87 = distinct !DISubprogram(name: "connect", linkageName: "std.net.tcp.connect", scope: !7, file: !7, line: 13, type: !88, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !104)
!88 = !DISubroutineType(types: !89)
!89 = !{!31, !90, !38, !98, !99, !18}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !92, identifier: "char[]")
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !91, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !97)
!97 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "Duration", scope: !7, file: !7, line: 5, baseType: !51, align: 8)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "SocketOption[]", size: 128, align: 64, elements: !100, identifier: "SocketOption[]")
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !99, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SocketOption*", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !99, baseType: !96, size: 64, align: 64, offset: 64)
!104 = !{!105}
!105 = !DILocalVariable(name: "ai", scope: !87, file: !7, line: 15, type: !106, align: 8)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AddrInfo*", baseType: !107, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo", scope: !7, file: !7, line: 14, size: 384, align: 64, elements: !108, identifier: "std.net.os.AddrInfo")
!108 = !{!109, !111, !113, !115, !117, !118, !126}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !107, file: !7, line: 16, baseType: !110, size: 32, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFlags", scope: !7, file: !7, line: 7, baseType: !35, align: 4)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !107, file: !7, line: 17, baseType: !112, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFamily", scope: !7, file: !7, line: 4, baseType: !35, align: 4)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !107, file: !7, line: 18, baseType: !114, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AISockType", scope: !7, file: !7, line: 6, baseType: !35, align: 4)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !107, file: !7, line: 19, baseType: !116, size: 32, align: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIProtocol", scope: !7, file: !7, line: 5, baseType: !35, align: 4)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !107, file: !7, line: 20, baseType: !37, size: 32, align: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, scope: !107, file: !7, line: 21, baseType: !119, size: 128, align: 64, offset: 192)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo.$anon", scope: !107, file: !7, line: 21, size: 128, align: 64, elements: !120)
!120 = !{!121, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !119, file: !7, line: 23, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !7, file: !7, line: 11, baseType: !94, align: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !119, file: !7, line: 24, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "SockAddrPtr", scope: !7, file: !7, line: 12, baseType: !125, align: 8)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !107, file: !7, line: 31, baseType: !106, size: 64, align: 64, offset: 320)
!127 = !DILocalVariable(name: "host", arg: 1, scope: !87, file: !7, line: 13, type: !90)
!128 = !DILocation(line: 13, column: 30, scope: !87)
!129 = !DILocalVariable(name: "port", arg: 2, scope: !87, file: !7, line: 13, type: !38)
!130 = !DILocation(line: 13, column: 41, scope: !87)
!131 = !DILocalVariable(name: "timeout", arg: 3, scope: !87, file: !7, line: 13, type: !98)
!132 = !DILocation(line: 13, column: 56, scope: !87)
!133 = !DILocalVariable(name: "options", arg: 4, scope: !87, file: !7, line: 13, type: !99)
!134 = !DILocation(line: 13, column: 103, scope: !87)
!135 = !DILocalVariable(name: "ip_protocol", arg: 5, scope: !87, file: !7, line: 13, type: !18)
!136 = !DILocation(line: 13, column: 123, scope: !87)
!137 = !DILocation(line: 15, column: 12, scope: !87)
!138 = !DILocation(line: 15, column: 44, scope: !87)
!139 = !DILocation(line: 15, column: 18, scope: !87)
!140 = !DILocation(line: 17, column: 6, scope: !87)
!141 = !DILocation(line: 19, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !87, file: !7, line: 18, column: 2)
!143 = !DILocation(line: 16, column: 25, scope: !144)
!144 = distinct !DILexicalBlock(scope: !87, file: !7, line: 16, column: 8)
!145 = !DILocation(line: 16, column: 8, scope: !144)
!146 = !DILocation(line: 16, column: 25, scope: !147)
!147 = distinct !DILexicalBlock(scope: !87, file: !7, line: 16, column: 8)
!148 = !DILocation(line: 16, column: 8, scope: !147)
!149 = !DILocation(line: 21, column: 9, scope: !87)
!150 = !DILocation(line: 16, column: 25, scope: !151)
!151 = distinct !DILexicalBlock(scope: !87, file: !7, line: 16, column: 8)
!152 = !DILocation(line: 16, column: 8, scope: !151)
!153 = !DILocation(line: 16, column: 25, scope: !154)
!154 = distinct !DILexicalBlock(scope: !87, file: !7, line: 16, column: 8)
!155 = !DILocation(line: 16, column: 8, scope: !154)
!156 = distinct !DISubprogram(name: "connect_async", linkageName: "std.net.tcp.connect_async", scope: !7, file: !7, line: 24, type: !157, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{!31, !90, !38, !99, !18}
!159 = !{!160}
!160 = !DILocalVariable(name: "ai", scope: !156, file: !7, line: 26, type: !106, align: 8)
!161 = !DILocalVariable(name: "host", arg: 1, scope: !156, file: !7, line: 24, type: !90)
!162 = !DILocation(line: 24, column: 36, scope: !156)
!163 = !DILocalVariable(name: "port", arg: 2, scope: !156, file: !7, line: 24, type: !38)
!164 = !DILocation(line: 24, column: 47, scope: !156)
!165 = !DILocalVariable(name: "options", arg: 3, scope: !156, file: !7, line: 24, type: !99)
!166 = !DILocation(line: 24, column: 69, scope: !156)
!167 = !DILocalVariable(name: "ip_protocol", arg: 4, scope: !156, file: !7, line: 24, type: !18)
!168 = !DILocation(line: 24, column: 89, scope: !156)
!169 = !DILocation(line: 26, column: 12, scope: !156)
!170 = !DILocation(line: 26, column: 43, scope: !156)
!171 = !DILocation(line: 26, column: 17, scope: !156)
!172 = !DILocation(line: 28, column: 9, scope: !156)
!173 = !DILocation(line: 27, column: 25, scope: !174)
!174 = distinct !DILexicalBlock(scope: !156, file: !7, line: 27, column: 8)
!175 = !DILocation(line: 27, column: 8, scope: !174)
!176 = !DILocation(line: 27, column: 25, scope: !177)
!177 = distinct !DILexicalBlock(scope: !156, file: !7, line: 27, column: 8)
!178 = !DILocation(line: 27, column: 8, scope: !177)
!179 = distinct !DISubprogram(name: "connect_to", linkageName: "std.net.tcp.connect_to", scope: !7, file: !7, line: 31, type: !180, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !6, retainedNodes: !78)
!180 = !DISubroutineType(types: !181)
!181 = !{!31, !106, !99}
!182 = !DILocalVariable(name: "ai", arg: 1, scope: !179, file: !7, line: 31, type: !106)
