; ModuleID = 'std_collections_list$game.Disableable$'
source_filename = "std_collections_list$game.Disableable$"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

@"$ct.std_collections_list$game.Disableable$.List" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 40, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"std_collections_list$game.Disableable$.ELEMENT_IS_EQUATABLE" = weak local_unnamed_addr constant i8 1, align 1, !dbg !0
@"std_collections_list$game.Disableable$.ELEMENT_IS_POINTER" = weak local_unnamed_addr constant i8 0, align 1, !dbg !4
@"$ct.int" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@"std_collections_list$game.Disableable$.LIST_HEAP_ALLOCATOR" = weak local_unnamed_addr constant %any { ptr @"std_collections_list$game.Disableable$.dummy.26154", i64 ptrtoint (ptr @"$ct.int" to i64) }, align 8, !dbg !6
@"std_collections_list$game.Disableable$.ONHEAP" = weak local_unnamed_addr constant %List { i64 0, i64 0, %any { ptr @"std_collections_list$game.Disableable$.dummy.26154", i64 ptrtoint (ptr @"$ct.int" to i64) }, ptr null }, align 8, !dbg !14

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE", linkageName: "std_collections_list$game.Disableable$.ELEMENT_IS_EQUATABLE", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 1)
!2 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/collections")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER", linkageName: "std_collections_list$game.Disableable$.ELEMENT_IS_POINTER", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 1)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR", linkageName: "std_collections_list$game.Disableable$.LIST_HEAP_ALLOCATOR", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 8)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "ONHEAP", linkageName: "std_collections_list$game.Disableable$.ONHEAP", scope: !2, file: !2, line: 14, type: !16, isLocal: false, isDefinition: true, align: 8)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !17, identifier: "std_collections_list$game.Disableable$.List")
!17 = !{!18, !21, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !16, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !16, file: !2, line: 23, baseType: !24, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 20, baseType: !26, align: 8)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Disableable", size: 128, align: 64, elements: !27, identifier: "Disableable")
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, baseType: !11, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, baseType: !13, size: 64, align: 64, offset: 64)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "dummy", linkageName: "std_collections_list$game.Disableable$.dummy.26154", scope: !2, file: !2, line: 573, type: !32, isLocal: true, isDefinition: true, align: 4)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{i32 2, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{i32 2, !"wchar_size", i32 4}
!36 = !{i32 4, !"PIC Level", i32 2}
!37 = !{i32 1, !"uwtable", i32 1}
!38 = !{i32 2, !"frame-pointer", i32 1}
!39 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !40, splitDebugInlining: false)
!40 = !{!0, !4, !6, !14, !30}
!41 = distinct !DISubprogram(name: "init", linkageName: "std_collections_list$game.Disableable$.List.init", scope: !2, file: !2, line: 30, type: !42, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !44, !8, !20}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !{}
!46 = !DILocation(line: 31, column: 1, scope: !41)
!47 = !DILocalVariable(name: "self", arg: 1, scope: !41, file: !2, line: 30, type: !44)
!48 = !DILocation(line: 30, column: 20, scope: !41)
!49 = !DILocalVariable(name: "allocator", arg: 2, scope: !41, file: !2, line: 30, type: !8)
!50 = !DILocation(line: 30, column: 37, scope: !41)
!51 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !41, file: !2, line: 30, type: !19)
!52 = !DILocation(line: 30, column: 52, scope: !41)
!53 = !DILocation(line: 32, column: 2, scope: !41)
!54 = !DILocation(line: 33, column: 2, scope: !41)
!55 = !DILocation(line: 34, column: 2, scope: !41)
!56 = !DILocation(line: 35, column: 2, scope: !41)
!57 = !DILocation(line: 36, column: 15, scope: !41)
!58 = !DILocation(line: 36, column: 2, scope: !41)
!59 = !DILocation(line: 37, column: 9, scope: !41)
!60 = distinct !DISubprogram(name: "tinit", linkageName: "std_collections_list$game.Disableable$.List.tinit", scope: !2, file: !2, line: 46, type: !61, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!61 = !DISubroutineType(types: !62)
!62 = !{!44, !44, !20}
!63 = !DILocation(line: 47, column: 1, scope: !60)
!64 = !DILocalVariable(name: "self", arg: 1, scope: !60, file: !2, line: 46, type: !44)
!65 = !DILocation(line: 46, column: 21, scope: !60)
!66 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !60, file: !2, line: 46, type: !19)
!67 = !DILocation(line: 46, column: 32, scope: !60)
!68 = !DILocation(line: 48, column: 19, scope: !60)
!69 = !DILocation(line: 48, column: 25, scope: !60)
!70 = !DILocation(line: 48, column: 9, scope: !60)
!71 = distinct !DISubprogram(name: "init_with_array", linkageName: "std_collections_list$game.Disableable$.List.init_with_array", scope: !2, file: !2, line: 57, type: !72, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!72 = !DISubroutineType(types: !73)
!73 = !{!44, !44, !8, !74}
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Disableable[]", size: 128, align: 64, elements: !75, identifier: "Disableable[]")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !74, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Disableable*", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, baseType: !19, size: 64, align: 64, offset: 64)
!79 = !DILocation(line: 58, column: 1, scope: !71)
!80 = !DILocalVariable(name: "self", arg: 1, scope: !71, file: !2, line: 57, type: !44)
!81 = !DILocation(line: 57, column: 31, scope: !71)
!82 = !DILocalVariable(name: "allocator", arg: 2, scope: !71, file: !2, line: 57, type: !8)
!83 = !DILocation(line: 57, column: 48, scope: !71)
!84 = !DILocalVariable(name: "values", arg: 3, scope: !71, file: !2, line: 57, type: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type[]", size: 128, align: 64, elements: !86, identifier: "Type[]")
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !85, baseType: !24, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !85, baseType: !19, size: 64, align: 64, offset: 64)
!89 = !DILocation(line: 57, column: 66, scope: !71)
!90 = !DILocation(line: 55, column: 11, scope: !91)
!91 = distinct !DILexicalBlock(scope: !71, file: !2, line: 58, column: 1)
!92 = !DILocation(line: 59, column: 23, scope: !71)
!93 = !DILocation(line: 59, column: 2, scope: !71)
!94 = !DILocation(line: 60, column: 16, scope: !71)
!95 = !DILocation(line: 60, column: 2, scope: !71)
!96 = !DILocation(line: 61, column: 9, scope: !71)
!97 = distinct !DISubprogram(name: "tinit_with_array", linkageName: "std_collections_list$game.Disableable$.List.tinit_with_array", scope: !2, file: !2, line: 70, type: !98, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!98 = !DISubroutineType(types: !99)
!99 = !{!44, !44, !74}
!100 = !DILocation(line: 71, column: 1, scope: !97)
!101 = !DILocalVariable(name: "self", arg: 1, scope: !97, file: !2, line: 70, type: !44)
!102 = !DILocation(line: 70, column: 32, scope: !97)
!103 = !DILocalVariable(name: "values", arg: 2, scope: !97, file: !2, line: 70, type: !85)
!104 = !DILocation(line: 70, column: 46, scope: !97)
!105 = !DILocation(line: 68, column: 11, scope: !106)
!106 = distinct !DILexicalBlock(scope: !97, file: !2, line: 71, column: 1)
!107 = !DILocation(line: 72, column: 13, scope: !97)
!108 = !DILocation(line: 72, column: 2, scope: !97)
!109 = !DILocation(line: 73, column: 16, scope: !97)
!110 = !DILocation(line: 73, column: 2, scope: !97)
!111 = !DILocation(line: 74, column: 9, scope: !97)
!112 = distinct !DISubprogram(name: "init_wrapping_array", linkageName: "std_collections_list$game.Disableable$.List.init_wrapping_array", scope: !2, file: !2, line: 80, type: !113, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !44, !8, !74}
!115 = !DILocation(line: 81, column: 1, scope: !112)
!116 = !DILocalVariable(name: "self", arg: 1, scope: !112, file: !2, line: 80, type: !44)
!117 = !DILocation(line: 80, column: 34, scope: !112)
!118 = !DILocalVariable(name: "allocator", arg: 2, scope: !112, file: !2, line: 80, type: !8)
!119 = !DILocation(line: 80, column: 51, scope: !112)
!120 = !DILocalVariable(name: "types", arg: 3, scope: !112, file: !2, line: 80, type: !85)
!121 = !DILocation(line: 80, column: 69, scope: !112)
!122 = !DILocation(line: 78, column: 12, scope: !123)
!123 = distinct !DILexicalBlock(scope: !112, file: !2, line: 81, column: 1)
!124 = !DILocation(line: 78, column: 11, scope: !123)
!125 = !DILocation(line: 82, column: 2, scope: !112)
!126 = !DILocation(line: 83, column: 18, scope: !112)
!127 = !DILocation(line: 83, column: 2, scope: !112)
!128 = !DILocation(line: 84, column: 2, scope: !112)
!129 = !DILocation(line: 85, column: 2, scope: !112)
!130 = !DILocation(line: 85, column: 16, scope: !112)
!131 = !DILocation(line: 437, column: 11, scope: !112)
!132 = !DILocation(line: 437, column: 28, scope: !112)
!133 = distinct !DISubprogram(name: "is_initialized", linkageName: "std_collections_list$game.Disableable$.List.is_initialized", scope: !2, file: !2, line: 88, type: !134, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!134 = !DISubroutineType(types: !135)
!135 = !{!3, !44}
!136 = !DILocation(line: 88, column: 47, scope: !133)
!137 = !DILocalVariable(name: "self", arg: 1, scope: !133, file: !2, line: 88, type: !44)
!138 = !DILocation(line: 88, column: 29, scope: !133)
!139 = !DILocation(line: 88, column: 73, scope: !133)
!140 = distinct !DISubprogram(name: "to_format", linkageName: "std_collections_list$game.Disableable$.List.to_format", scope: !2, file: !2, line: 90, type: !141, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!141 = !DISubroutineType(types: !142)
!142 = !{!20, !44, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 63, size: 320, align: 64, elements: !145, identifier: "std.io.Formatter")
!145 = !{!146, !147, !153}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !2, line: 65, baseType: !11, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !144, file: !2, line: 66, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 16, baseType: !149, align: 8)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !11, !152}
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !2, line: 67, baseType: !154, size: 192, align: 64, offset: 128)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !144, file: !2, line: 67, size: 192, align: 64, elements: !155)
!155 = !{!156, !158, !159, !160}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !154, file: !2, line: 69, baseType: !157, size: 32, align: 32)
!157 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !154, file: !2, line: 70, baseType: !157, size: 32, align: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !154, file: !2, line: 71, baseType: !157, size: 32, align: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !154, file: !2, line: 72, baseType: !161, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !162)
!162 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!163 = !DILocation(line: 91, column: 1, scope: !140)
!164 = !DILocalVariable(name: "self", arg: 1, scope: !140, file: !2, line: 90, type: !44)
!165 = !DILocation(line: 90, column: 24, scope: !140)
!166 = !DILocalVariable(name: "formatter", arg: 2, scope: !140, file: !2, line: 90, type: !143)
!167 = !DILocation(line: 90, column: 42, scope: !140)
!168 = !DILocation(line: 92, column: 10, scope: !169)
!169 = distinct !DILexicalBlock(scope: !140, file: !2, line: 92, column: 2)
!170 = !DILocation(line: 95, column: 11, scope: !171)
!171 = distinct !DILexicalBlock(scope: !169, file: !2, line: 95, column: 4)
!172 = !DILocation(line: 97, column: 36, scope: !173)
!173 = distinct !DILexicalBlock(scope: !169, file: !2, line: 97, column: 4)
!174 = !DILocation(line: 97, column: 49, scope: !173)
!175 = !DILocation(line: 97, column: 11, scope: !173)
!176 = !DILocalVariable(name: "n", scope: !177, file: !2, line: 99, type: !19, align: 8)
!177 = distinct !DILexicalBlock(scope: !169, file: !2, line: 99, column: 4)
!178 = !DILocation(line: 99, column: 8, scope: !177)
!179 = !DILocation(line: 99, column: 12, scope: !177)
!180 = !DILocation(line: 100, column: 26, scope: !181)
!181 = distinct !DILexicalBlock(scope: !177, file: !2, line: 100, column: 4)
!182 = !DILocation(line: 100, column: 40, scope: !181)
!183 = !DILocalVariable(name: ".temp", scope: !181, file: !2, line: 100, type: !19, align: 8)
!184 = !DILocation(line: 100, column: 13, scope: !181)
!185 = !DILocalVariable(name: "i", scope: !186, file: !2, line: 100, type: !19, align: 8)
!186 = distinct !DILexicalBlock(scope: !181, file: !2, line: 101, column: 4)
!187 = !DILocation(line: 100, column: 13, scope: !186)
!188 = !DILocalVariable(name: "element", scope: !186, file: !2, line: 100, type: !26, align: 8)
!189 = !DILocation(line: 100, column: 16, scope: !186)
!190 = !DILocation(line: 100, column: 26, scope: !186)
!191 = !DILocation(line: 102, column: 9, scope: !192)
!192 = distinct !DILexicalBlock(scope: !186, file: !2, line: 101, column: 4)
!193 = !DILocation(line: 102, column: 17, scope: !192)
!194 = !DILocation(line: 103, column: 5, scope: !192)
!195 = !DILocation(line: 103, column: 33, scope: !192)
!196 = !DILocation(line: 103, column: 10, scope: !192)
!197 = !DILocation(line: 105, column: 4, scope: !177)
!198 = !DILocation(line: 105, column: 9, scope: !177)
!199 = !DILocation(line: 106, column: 11, scope: !177)
!200 = distinct !DISubprogram(name: "push", linkageName: "std_collections_list$game.Disableable$.List.push", scope: !2, file: !2, line: 110, type: !201, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !44, !26}
!203 = !DILocation(line: 111, column: 1, scope: !200)
!204 = !DILocalVariable(name: "self", arg: 1, scope: !200, file: !2, line: 110, type: !44)
!205 = !DILocation(line: 110, column: 19, scope: !200)
!206 = !DILocalVariable(name: "element", arg: 2, scope: !200, file: !2, line: 110, type: !25)
!207 = !DILocation(line: 110, column: 31, scope: !200)
!208 = !DILocation(line: 112, column: 15, scope: !200)
!209 = !DILocation(line: 112, column: 2, scope: !200)
!210 = !DILocation(line: 113, column: 2, scope: !200)
!211 = !DILocation(line: 113, column: 15, scope: !200)
!212 = !DILocation(line: 113, column: 29, scope: !200)
!213 = !DILocation(line: 437, column: 11, scope: !200)
!214 = !DILocation(line: 437, column: 28, scope: !200)
!215 = distinct !DISubprogram(name: "pop", linkageName: "std_collections_list$game.Disableable$.List.pop", scope: !2, file: !2, line: 116, type: !216, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !44}
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !219, identifier: "any")
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !218, baseType: !11, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !218, baseType: !13, size: 64, align: 64, offset: 64)
!222 = !DILocation(line: 117, column: 1, scope: !215)
!223 = !DILocalVariable(name: "self", arg: 1, scope: !215, file: !2, line: 116, type: !44)
!224 = !DILocation(line: 116, column: 19, scope: !215)
!225 = !DILocation(line: 118, column: 7, scope: !215)
!226 = !DILocation(line: 118, column: 25, scope: !215)
!227 = !DILocation(line: 120, column: 9, scope: !215)
!228 = !DILocation(line: 120, column: 22, scope: !215)
!229 = !DILocation(line: 119, column: 8, scope: !230)
!230 = distinct !DILexicalBlock(scope: !215, file: !2, line: 119, column: 8)
!231 = !DILocation(line: 119, column: 22, scope: !230)
!232 = !DILocation(line: 437, column: 11, scope: !230)
!233 = !DILocation(line: 437, column: 28, scope: !230)
!234 = distinct !DISubprogram(name: "clear", linkageName: "std_collections_list$game.Disableable$.List.clear", scope: !2, file: !2, line: 123, type: !235, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !44}
!237 = !DILocation(line: 124, column: 1, scope: !234)
!238 = !DILocalVariable(name: "self", arg: 1, scope: !234, file: !2, line: 123, type: !44)
!239 = !DILocation(line: 123, column: 20, scope: !234)
!240 = !DILocation(line: 125, column: 2, scope: !234)
!241 = !DILocation(line: 437, column: 11, scope: !234)
!242 = !DILocation(line: 437, column: 28, scope: !234)
!243 = distinct !DISubprogram(name: "pop_first", linkageName: "std_collections_list$game.Disableable$.List.pop_first", scope: !2, file: !2, line: 128, type: !216, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!244 = !DILocation(line: 129, column: 1, scope: !243)
!245 = !DILocalVariable(name: "self", arg: 1, scope: !243, file: !2, line: 128, type: !44)
!246 = !DILocation(line: 128, column: 25, scope: !243)
!247 = !DILocation(line: 130, column: 7, scope: !243)
!248 = !DILocation(line: 130, column: 25, scope: !243)
!249 = !DILocation(line: 132, column: 9, scope: !243)
!250 = !DILocation(line: 132, column: 22, scope: !243)
!251 = !DILocation(line: 131, column: 8, scope: !252)
!252 = distinct !DILexicalBlock(scope: !243, file: !2, line: 131, column: 8)
!253 = !DILocation(line: 136, column: 19, scope: !252)
!254 = distinct !DISubprogram(name: "remove_at", linkageName: "std_collections_list$game.Disableable$.List.remove_at", scope: !2, file: !2, line: 138, type: !255, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !39, retainedNodes: !45)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !44, !20}
!257 = !DILocation(line: 139, column: 1, scope: !254)
!258 = !DILocalVariable(name: "self", arg: 1, scope: !254, file: !2, line: 138, type: !44)
!259 = !DILocation(line: 138, column: 24, scope: !254)
!260 = !DILocalVariable(name: "index", arg: 2, scope: !254, file: !2, line: 138, type: !19)
!261 = !DILocation(line: 138, column: 35, scope: !254)
!262 = !DILocation(line: 136, column: 11, scope: !263)
!263 = distinct !DILexicalBlock(scope: !254, file: !2, line: 139, column: 1)
!264 = !DILocation(line: 136, column: 19, scope: !263)
!265 = !DILocalVariable(name: "new_size", scope: !254, file: !2, line: 140, type: !19, align: 8)
!266 = !DILocation(line: 140, column: 6, scope: !254)
!267 = !DILocation(line: 140, column: 17, scope: !254)
!268 = !DILocation(line: 142, column: 6, scope: !254)
!269 = !DILocation(line: 142, column: 19, scope: !254)
!270 = !DILocation(line: 142, column: 28, scope: !254)
!271 = !DILocation(line: 141, column: 8, scope: !272)
!272 = distinct !DILexicalBlock(scope: !254, file: !2, line: 141, column: 8)
!273 = !DILocation(line: 141, column: 22, scope: !272)
!274 = !DILocation(line: 437, column: 11, scope: !272)
!275 = !DILocation(line: 437, column: 28, scope: !272)
!276 = !DILocation(line: 143, column: 40, scope: !254)
!277 = !DILocation(line: 143, column: 53, scope: !254)
