; ModuleID = 'std_hash_hmac$std.hash.md5.Md5$16$64$'
source_filename = "std_hash_hmac$std.hash.md5.Md5$16$64$"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect.636 = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[].635" = type { ptr, i64 }
%Hmac = type { %Md5.638, %Md5.638 }
%Md5.638 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

@"$ct.std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac" = linkonce global %.introspect.636 { i8 10, i64 0, ptr null, i64 304, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"std_hash_hmac$std.hash.md5.Md5$16$64$.IPAD" = internal unnamed_addr constant i32 54, align 4, !dbg !0
@"std_hash_hmac$std.hash.md5.Md5$16$64$.OPAD" = internal unnamed_addr constant i32 92, align 4, !dbg !4
@"std_hash_hmac$std.hash.md5.Md5$16$64$.HASH_BYTES" = weak local_unnamed_addr constant i32 16, align 4, !dbg !6
@"std_hash_hmac$std.hash.md5.Md5$16$64$.BLOCK_BYTES" = weak local_unnamed_addr constant i32 64, align 4, !dbg !9

; Function Attrs: nounwind uwtable(sync)
define weak void @"std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.init"(ptr %0, [2 x i64] %1) #0 !dbg !19 {
entry:
  %key = alloca %"char[].635", align 8
  %buffer = alloca [64 x i8], align 1
  %result = alloca [16 x i8], align 1
  %.anon = alloca i64, align 8
  %b = alloca ptr, align 8
  %taddr = alloca %"char[].635", align 8
  %.anon4 = alloca i64, align 8
  %b8 = alloca ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "IPAD", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.IPAD", scope: !2, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true, align: 4)
!2 = !DIFile(filename: "hmac.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/hash")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OPAD", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.OPAD", scope: !2, file: !2, line: 84, type: !3, isLocal: true, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.HASH_BYTES", scope: !2, file: !2, line: 16, type: !8, isLocal: false, isDefinition: true, align: 4)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.BLOCK_BYTES", scope: !2, file: !2, line: 16, type: !8, isLocal: false, isDefinition: true, align: 4)
!11 = !{i32 2, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 2, !"wchar_size", i32 4}
!14 = !{i32 4, !"PIC Level", i32 2}
!15 = !{i32 1, !"uwtable", i32 1}
!16 = !{i32 2, !"frame-pointer", i32 1}
!17 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !18, splitDebugInlining: false)
!18 = !{!0, !4, !6, !9}
!19 = distinct !DISubprogram(name: "init", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.init", scope: !2, file: !2, line: 45, type: !20, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !17, retainedNodes: !52)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !45}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Hmac*", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hmac", scope: !2, file: !2, line: 4, size: 2432, align: 32, elements: !24, identifier: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac")
!24 = !{!25, !44}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !23, file: !2, line: 6, baseType: !26, size: 1216, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashAlg", scope: !2, file: !2, line: 16, baseType: !27, align: 4)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !28, identifier: "std.hash.md5.Md5")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !40}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !27, file: !2, line: 10, baseType: !3, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !27, file: !2, line: 10, baseType: !3, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !27, file: !2, line: 11, baseType: !3, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !27, file: !2, line: 11, baseType: !3, size: 32, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !27, file: !2, line: 11, baseType: !3, size: 32, align: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !27, file: !2, line: 11, baseType: !3, size: 32, align: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !27, file: !2, line: 12, baseType: !36, size: 512, align: 8, offset: 192)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, align: 8, elements: !38)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 64, lowerBound: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !27, file: !2, line: 13, baseType: !41, size: 512, align: 32, offset: 704)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 512, align: 32, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 16, lowerBound: 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !23, file: !2, line: 6, baseType: !26, size: 1216, align: 32, offset: 1216)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !46, identifier: "char[]")
!46 = !{!47, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !45, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !51)
!51 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!52 = !{!53, !54, !56, !58, !60}
!53 = !DILocalVariable(name: "buffer", scope: !19, file: !2, line: 47, type: !36, align: 1)
!54 = !DILocalVariable(name: ".temp", scope: !55, file: !2, line: 59, type: !50, align: 8)
!55 = distinct !DILexicalBlock(scope: !19, file: !2, line: 59, column: 2)
!56 = !DILocalVariable(name: "b", scope: !57, file: !2, line: 59, type: !48, align: 8)
!57 = distinct !DILexicalBlock(scope: !55, file: !2, line: 59, column: 24)
!58 = !DILocalVariable(name: ".temp", scope: !59, file: !2, line: 64, type: !50, align: 8)
!59 = distinct !DILexicalBlock(scope: !19, file: !2, line: 64, column: 2)
!60 = !DILocalVariable(name: "b", scope: !61, file: !2, line: 64, type: !48, align: 8)
!61 = distinct !DILexicalBlock(scope: !59, file: !2, line: 64, column: 24)
!62 = !DILocalVariable(name: "self", arg: 1, scope: !19, file: !2, line: 45, type: !22)
!63 = !DILocation(line: 45, column: 19, scope: !19)
!64 = !DILocalVariable(name: "key", arg: 2, scope: !19, file: !2, line: 45, type: !45)
!65 = !DILocation(line: 45, column: 33, scope: !19)
!66 = !DILocation(line: 47, column: 20, scope: !19)
!67 = !DILocation(line: 48, column: 6, scope: !19)
!68 = !DILocation(line: 50, column: 3, scope: !69)
!69 = distinct !DILexicalBlock(scope: !19, file: !2, line: 49, column: 2)
!70 = !DILocation(line: 51, column: 17, scope: !69)
!71 = !DILocation(line: 51, column: 3, scope: !69)
!72 = !DILocation(line: 52, column: 25, scope: !69)
!73 = !DILocation(line: 52, column: 3, scope: !69)
!74 = !DILocation(line: 56, column: 22, scope: !75)
!75 = distinct !DILexicalBlock(scope: !19, file: !2, line: 55, column: 2)
!76 = !DILocation(line: 56, column: 26, scope: !75)
!77 = !DILocation(line: 56, column: 11, scope: !75)
!78 = !DILocation(line: 59, column: 16, scope: !55)
!79 = !DILocation(line: 59, column: 12, scope: !57)
!80 = !DILocation(line: 59, column: 16, scope: !57)
!81 = !DILocation(line: 59, column: 25, scope: !57)
!82 = !DILocation(line: 59, column: 24, scope: !57)
!83 = !DILocation(line: 61, column: 2, scope: !19)
!84 = !DILocation(line: 62, column: 17, scope: !19)
!85 = !DILocation(line: 62, column: 2, scope: !19)
!86 = !DILocation(line: 64, column: 16, scope: !59)
!87 = !DILocation(line: 64, column: 12, scope: !61)
!88 = !DILocation(line: 64, column: 16, scope: !61)
!89 = !DILocation(line: 64, column: 25, scope: !61)
!90 = !DILocation(line: 64, column: 24, scope: !61)
!91 = !DILocation(line: 66, column: 2, scope: !19)
!92 = !DILocation(line: 67, column: 2, scope: !19)
!93 = !DILocation(line: 67, column: 17, scope: !19)
!94 = !DILocation(line: 69, column: 22, scope: !19)
!95 = !DILocation(line: 338, column: 11, scope: !96, inlinedAt: !98)
!96 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !97, file: !97, line: 336, scopeLine: 336, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !17)
!97 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.7/lib/c3/std/core")
!98 = !DILocation(line: 69, column: 2, scope: !19)
!99 = !DILocation(line: 338, column: 30, scope: !96, inlinedAt: !98)
!100 = !DILocation(line: 338, column: 40, scope: !96, inlinedAt: !98)
!101 = distinct !DISubprogram(name: "update", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.update", scope: !2, file: !2, line: 72, type: !20, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !17, retainedNodes: !102)
!102 = !{}
!103 = !DILocalVariable(name: "self", arg: 1, scope: !101, file: !2, line: 72, type: !22)
!104 = !DILocation(line: 72, column: 21, scope: !101)
!105 = !DILocalVariable(name: "data", arg: 2, scope: !101, file: !2, line: 72, type: !45)
!106 = !DILocation(line: 72, column: 35, scope: !101)
